package f3d

import (
	"fmt"
	"time"

	"gitee.com/meepo/backend/kit/components/sdk/conv"
	"gitee.com/meepo/backend/kit/components/sdk/helper"
	"gitee.com/meepo/backend/kit/components/sdk/helper/timed"
)

var (
	PrizeHour, PrizeMinute = 21, 15

	Z1RewardPerTicket = float64(1040)
	Z3RewardPerTicket = float64(346)
	Z6RewardPerTicket = float64(173)
)

var (
	// 国庆前4天
	// 春节前2天 到 初7 todo 也可能是春节前1天
	F3dExcludeDates = []string{
		// 2023 春节 (1/19-1/28)
		"2023-01-19", "2023-01-20", "2023-01-21", "2023-01-22", "2023-01-23",
		"2023-01-24", "2023-01-25", "2023-01-26", "2023-01-27", "2023-01-28",
		// 2023 国庆 (10/1-10/4)
		"2023-10-01", "2023-10-02", "2023-10-03", "2023-10-04",
		// 2024 春节 (2/8-2/17)
		"2024-02-08", "2024-02-09", "2024-02-10", "2024-02-11", "2024-02-12",
		"2024-02-13", "2024-02-14", "2024-02-15", "2024-02-16", "2024-02-17",
		// 2024 国庆 (10/1-10/4)
		"2024-10-01", "2024-10-02", "2024-10-03", "2024-10-04",
		// 2025 春节 (1/27-2/5)
		"2025-01-27", "2025-01-28", "2025-01-29", "2025-01-30", "2025-01-31",
		"2025-02-01", "2025-02-02", "2025-02-03", "2025-02-04", "2025-02-05",
		// 2025 国庆 (10/1-10/4)
		"2025-10-01", "2025-10-02", "2025-10-03", "2025-10-04",
		// 2026 春节 (2/14-2/23)
		"2026-02-14", "2026-02-15", "2026-02-16", "2026-02-17", "2026-02-18",
		"2026-02-19", "2026-02-20", "2026-02-21", "2026-02-22", "2026-02-23",
		// 2026 国庆 (10/1-10/4)
		"2026-10-01", "2026-10-02", "2026-10-03", "2026-10-04",
		// 2027 春节 (预测: 2/6春节, 休市1/30-2/8)
		"2027-01-30", "2027-01-31", "2027-02-01", "2027-02-02", "2027-02-03",
		"2027-02-04", "2027-02-05", "2027-02-06", "2027-02-07", "2027-02-08",
		// 2027 国庆 (10/1-10/4)
		"2027-10-01", "2027-10-02", "2027-10-03", "2027-10-04",
		// 2028 春节 (预测: 1/26春节, 休市1/20-1/29)
		"2028-01-20", "2028-01-21", "2028-01-22", "2028-01-23", "2028-01-24",
		"2028-01-25", "2028-01-26", "2028-01-27", "2028-01-28", "2028-01-29",
		// 2028 国庆 (10/1-10/4)
		"2028-10-01", "2028-10-02", "2028-10-03", "2028-10-04",
	}
)

type Generator struct {
}

func (t *Generator) Generate(fromIndex string, fromTime time.Time) (string, time.Time, time.Time) {

	// 每天开奖
	y, m, d := fromTime.AddDate(0, 0, 1).Date()
	prizeAt := time.Date(y, m, d, PrizeHour, PrizeMinute, 0, 0, timed.LocAsiaShanghai)

	for {
		if helper.InSlice(prizeAt.Format(time.DateOnly), F3dExcludeDates) {
			prizeAt = prizeAt.AddDate(0, 0, 1)
			continue
		}
		break
	}

	issueIndex := fmt.Sprintf("%d", conv.Int(fromIndex)+1)
	// 跨年
	if prizeAt.Year() != fromTime.Year() {
		issueIndex = fmt.Sprintf("%d001", prizeAt.Year())
	}

	return issueIndex, prizeAt.Add(-2 * time.Hour), prizeAt
}
