package loc

type Loc struct {
	Name     string `json:"label"`
	Id       string `json:"value"`
	Children []*Loc `json:"children"`
}

type Province struct {
	Name string
	Id   string
}

type City struct {
	Province string
	Name     string
	Id       string
}

type Area struct {
	City string
	Name string
	Id   string
}

var provinces = []Province{
	{
		Name: "北京市",
		Id:   "110000000000",
	}, {
		Name: "天津市",
		Id:   "120000000000",
	}, {
		Name: "河北省",
		Id:   "130000000000",
	}, {
		Name: "山西省",
		Id:   "140000000000",
	}, {
		Name: "内蒙古自治区",
		Id:   "150000000000",
	}, {
		Name: "辽宁省",
		Id:   "210000000000",
	}, {
		Name: "吉林省",
		Id:   "220000000000",
	}, {
		Name: "黑龙江省",
		Id:   "230000000000",
	}, {
		Name: "上海市",
		Id:   "310000000000",
	}, {
		Name: "江苏省",
		Id:   "320000000000",
	}, {
		Name: "浙江省",
		Id:   "330000000000",
	}, {
		Name: "安徽省",
		Id:   "340000000000",
	}, {
		Name: "福建省",
		Id:   "350000000000",
	}, {
		Name: "江西省",
		Id:   "360000000000",
	}, {
		Name: "山东省",
		Id:   "370000000000",
	}, {
		Name: "河南省",
		Id:   "410000000000",
	}, {
		Name: "湖北省",
		Id:   "420000000000",
	}, {
		Name: "湖南省",
		Id:   "430000000000",
	}, {
		Name: "广东省",
		Id:   "440000000000",
	}, {
		Name: "广西壮族自治区",
		Id:   "450000000000",
	}, {
		Name: "海南省",
		Id:   "460000000000",
	}, {
		Name: "重庆市",
		Id:   "500000000000",
	}, {
		Name: "四川省",
		Id:   "510000000000",
	}, {
		Name: "贵州省",
		Id:   "520000000000",
	}, {
		Name: "云南省",
		Id:   "530000000000",
	}, {
		Name: "西藏自治区",
		Id:   "540000000000",
	}, {
		Name: "陕西省",
		Id:   "610000000000",
	}, {
		Name: "甘肃省",
		Id:   "620000000000",
	}, {
		Name: "青海省",
		Id:   "630000000000",
	}, {
		Name: "宁夏回族自治区",
		Id:   "640000000000",
	}, {
		Name: "新疆维吾尔自治区",
		Id:   "650000000000",
	},
}
var cities = map[string][]City{
	"110000000000": {
		{
			Province: "北京市",
			Name:     "市辖区",
			Id:       "110100000000",
		},
	},
	"120000000000": {
		{
			Province: "天津市",
			Name:     "市辖区",
			Id:       "120100000000",
		},
	},
	"130000000000": {
		{
			Province: "河北省",
			Name:     "石家庄市",
			Id:       "130100000000",
		},
		{
			Province: "河北省",
			Name:     "唐山市",
			Id:       "130200000000",
		},
		{
			Province: "河北省",
			Name:     "秦皇岛市",
			Id:       "130300000000",
		},
		{
			Province: "河北省",
			Name:     "邯郸市",
			Id:       "130400000000",
		},
		{
			Province: "河北省",
			Name:     "邢台市",
			Id:       "130500000000",
		},
		{
			Province: "河北省",
			Name:     "保定市",
			Id:       "130600000000",
		},
		{
			Province: "河北省",
			Name:     "张家口市",
			Id:       "130700000000",
		},
		{
			Province: "河北省",
			Name:     "承德市",
			Id:       "130800000000",
		},
		{
			Province: "河北省",
			Name:     "沧州市",
			Id:       "130900000000",
		},
		{
			Province: "河北省",
			Name:     "廊坊市",
			Id:       "131000000000",
		},
		{
			Province: "河北省",
			Name:     "衡水市",
			Id:       "131100000000",
		},
	},
	"140000000000": {
		{
			Province: "山西省",
			Name:     "太原市",
			Id:       "140100000000",
		},
		{
			Province: "山西省",
			Name:     "大同市",
			Id:       "140200000000",
		},
		{
			Province: "山西省",
			Name:     "阳泉市",
			Id:       "140300000000",
		},
		{
			Province: "山西省",
			Name:     "长治市",
			Id:       "140400000000",
		},
		{
			Province: "山西省",
			Name:     "晋城市",
			Id:       "140500000000",
		},
		{
			Province: "山西省",
			Name:     "朔州市",
			Id:       "140600000000",
		},
		{
			Province: "山西省",
			Name:     "晋中市",
			Id:       "140700000000",
		},
		{
			Province: "山西省",
			Name:     "运城市",
			Id:       "140800000000",
		},
		{
			Province: "山西省",
			Name:     "忻州市",
			Id:       "140900000000",
		},
		{
			Province: "山西省",
			Name:     "临汾市",
			Id:       "141000000000",
		},
		{
			Province: "山西省",
			Name:     "吕梁市",
			Id:       "141100000000",
		},
	},
	"150000000000": {
		{
			Province: "内蒙古自治区",
			Name:     "呼和浩特市",
			Id:       "150100000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "包头市",
			Id:       "150200000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "乌海市",
			Id:       "150300000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "赤峰市",
			Id:       "150400000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "通辽市",
			Id:       "150500000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "鄂尔多斯市",
			Id:       "150600000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "呼伦贝尔市",
			Id:       "150700000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "巴彦淖尔市",
			Id:       "150800000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "乌兰察布市",
			Id:       "150900000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "兴安盟",
			Id:       "152200000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "锡林郭勒盟",
			Id:       "152500000000",
		},
		{
			Province: "内蒙古自治区",
			Name:     "阿拉善盟",
			Id:       "152900000000",
		},
	},
	"210000000000": {
		{
			Province: "辽宁省",
			Name:     "沈阳市",
			Id:       "210100000000",
		},
		{
			Province: "辽宁省",
			Name:     "大连市",
			Id:       "210200000000",
		},
		{
			Province: "辽宁省",
			Name:     "鞍山市",
			Id:       "210300000000",
		},
		{
			Province: "辽宁省",
			Name:     "抚顺市",
			Id:       "210400000000",
		},
		{
			Province: "辽宁省",
			Name:     "本溪市",
			Id:       "210500000000",
		},
		{
			Province: "辽宁省",
			Name:     "丹东市",
			Id:       "210600000000",
		},
		{
			Province: "辽宁省",
			Name:     "锦州市",
			Id:       "210700000000",
		},
		{
			Province: "辽宁省",
			Name:     "营口市",
			Id:       "210800000000",
		},
		{
			Province: "辽宁省",
			Name:     "阜新市",
			Id:       "210900000000",
		},
		{
			Province: "辽宁省",
			Name:     "辽阳市",
			Id:       "211000000000",
		},
		{
			Province: "辽宁省",
			Name:     "盘锦市",
			Id:       "211100000000",
		},
		{
			Province: "辽宁省",
			Name:     "铁岭市",
			Id:       "211200000000",
		},
		{
			Province: "辽宁省",
			Name:     "朝阳市",
			Id:       "211300000000",
		},
		{
			Province: "辽宁省",
			Name:     "葫芦岛市",
			Id:       "211400000000",
		},
	},
	"220000000000": {
		{
			Province: "吉林省",
			Name:     "长春市",
			Id:       "220100000000",
		},
		{
			Province: "吉林省",
			Name:     "吉林市",
			Id:       "220200000000",
		},
		{
			Province: "吉林省",
			Name:     "四平市",
			Id:       "220300000000",
		},
		{
			Province: "吉林省",
			Name:     "辽源市",
			Id:       "220400000000",
		},
		{
			Province: "吉林省",
			Name:     "通化市",
			Id:       "220500000000",
		},
		{
			Province: "吉林省",
			Name:     "白山市",
			Id:       "220600000000",
		},
		{
			Province: "吉林省",
			Name:     "松原市",
			Id:       "220700000000",
		},
		{
			Province: "吉林省",
			Name:     "白城市",
			Id:       "220800000000",
		},
		{
			Province: "吉林省",
			Name:     "延边朝鲜族自治州",
			Id:       "222400000000",
		},
	},
	"230000000000": {
		{
			Province: "黑龙江省",
			Name:     "哈尔滨市",
			Id:       "230100000000",
		},
		{
			Province: "黑龙江省",
			Name:     "齐齐哈尔市",
			Id:       "230200000000",
		},
		{
			Province: "黑龙江省",
			Name:     "鸡西市",
			Id:       "230300000000",
		},
		{
			Province: "黑龙江省",
			Name:     "鹤岗市",
			Id:       "230400000000",
		},
		{
			Province: "黑龙江省",
			Name:     "双鸭山市",
			Id:       "230500000000",
		},
		{
			Province: "黑龙江省",
			Name:     "大庆市",
			Id:       "230600000000",
		},
		{
			Province: "黑龙江省",
			Name:     "伊春市",
			Id:       "230700000000",
		},
		{
			Province: "黑龙江省",
			Name:     "佳木斯市",
			Id:       "230800000000",
		},
		{
			Province: "黑龙江省",
			Name:     "七台河市",
			Id:       "230900000000",
		},
		{
			Province: "黑龙江省",
			Name:     "牡丹江市",
			Id:       "231000000000",
		},
		{
			Province: "黑龙江省",
			Name:     "黑河市",
			Id:       "231100000000",
		},
		{
			Province: "黑龙江省",
			Name:     "绥化市",
			Id:       "231200000000",
		},
		{
			Province: "黑龙江省",
			Name:     "大兴安岭地区",
			Id:       "232700000000",
		},
	},
	"310000000000": {
		{
			Province: "上海市",
			Name:     "市辖区",
			Id:       "310100000000",
		},
	},
	"320000000000": {
		{
			Province: "江苏省",
			Name:     "南京市",
			Id:       "320100000000",
		},
		{
			Province: "江苏省",
			Name:     "无锡市",
			Id:       "320200000000",
		},
		{
			Province: "江苏省",
			Name:     "徐州市",
			Id:       "320300000000",
		},
		{
			Province: "江苏省",
			Name:     "常州市",
			Id:       "320400000000",
		},
		{
			Province: "江苏省",
			Name:     "苏州市",
			Id:       "320500000000",
		},
		{
			Province: "江苏省",
			Name:     "南通市",
			Id:       "320600000000",
		},
		{
			Province: "江苏省",
			Name:     "连云港市",
			Id:       "320700000000",
		},
		{
			Province: "江苏省",
			Name:     "淮安市",
			Id:       "320800000000",
		},
		{
			Province: "江苏省",
			Name:     "盐城市",
			Id:       "320900000000",
		},
		{
			Province: "江苏省",
			Name:     "扬州市",
			Id:       "321000000000",
		},
		{
			Province: "江苏省",
			Name:     "镇江市",
			Id:       "321100000000",
		},
		{
			Province: "江苏省",
			Name:     "泰州市",
			Id:       "321200000000",
		},
		{
			Province: "江苏省",
			Name:     "宿迁市",
			Id:       "321300000000",
		},
	},
	"330000000000": {
		{
			Province: "浙江省",
			Name:     "杭州市",
			Id:       "330100000000",
		},
		{
			Province: "浙江省",
			Name:     "宁波市",
			Id:       "330200000000",
		},
		{
			Province: "浙江省",
			Name:     "温州市",
			Id:       "330300000000",
		},
		{
			Province: "浙江省",
			Name:     "嘉兴市",
			Id:       "330400000000",
		},
		{
			Province: "浙江省",
			Name:     "湖州市",
			Id:       "330500000000",
		},
		{
			Province: "浙江省",
			Name:     "绍兴市",
			Id:       "330600000000",
		},
		{
			Province: "浙江省",
			Name:     "金华市",
			Id:       "330700000000",
		},
		{
			Province: "浙江省",
			Name:     "衢州市",
			Id:       "330800000000",
		},
		{
			Province: "浙江省",
			Name:     "舟山市",
			Id:       "330900000000",
		},
		{
			Province: "浙江省",
			Name:     "台州市",
			Id:       "331000000000",
		},
		{
			Province: "浙江省",
			Name:     "丽水市",
			Id:       "331100000000",
		},
	},
	"340000000000": {
		{
			Province: "安徽省",
			Name:     "合肥市",
			Id:       "340100000000",
		},
		{
			Province: "安徽省",
			Name:     "芜湖市",
			Id:       "340200000000",
		},
		{
			Province: "安徽省",
			Name:     "蚌埠市",
			Id:       "340300000000",
		},
		{
			Province: "安徽省",
			Name:     "淮南市",
			Id:       "340400000000",
		},
		{
			Province: "安徽省",
			Name:     "马鞍山市",
			Id:       "340500000000",
		},
		{
			Province: "安徽省",
			Name:     "淮北市",
			Id:       "340600000000",
		},
		{
			Province: "安徽省",
			Name:     "铜陵市",
			Id:       "340700000000",
		},
		{
			Province: "安徽省",
			Name:     "安庆市",
			Id:       "340800000000",
		},
		{
			Province: "安徽省",
			Name:     "黄山市",
			Id:       "341000000000",
		},
		{
			Province: "安徽省",
			Name:     "滁州市",
			Id:       "341100000000",
		},
		{
			Province: "安徽省",
			Name:     "阜阳市",
			Id:       "341200000000",
		},
		{
			Province: "安徽省",
			Name:     "宿州市",
			Id:       "341300000000",
		},
		{
			Province: "安徽省",
			Name:     "六安市",
			Id:       "341500000000",
		},
		{
			Province: "安徽省",
			Name:     "亳州市",
			Id:       "341600000000",
		},
		{
			Province: "安徽省",
			Name:     "池州市",
			Id:       "341700000000",
		},
		{
			Province: "安徽省",
			Name:     "宣城市",
			Id:       "341800000000",
		},
	},
	"350000000000": {
		{
			Province: "福建省",
			Name:     "福州市",
			Id:       "350100000000",
		},
		{
			Province: "福建省",
			Name:     "厦门市",
			Id:       "350200000000",
		},
		{
			Province: "福建省",
			Name:     "莆田市",
			Id:       "350300000000",
		},
		{
			Province: "福建省",
			Name:     "三明市",
			Id:       "350400000000",
		},
		{
			Province: "福建省",
			Name:     "泉州市",
			Id:       "350500000000",
		},
		{
			Province: "福建省",
			Name:     "漳州市",
			Id:       "350600000000",
		},
		{
			Province: "福建省",
			Name:     "南平市",
			Id:       "350700000000",
		},
		{
			Province: "福建省",
			Name:     "龙岩市",
			Id:       "350800000000",
		},
		{
			Province: "福建省",
			Name:     "宁德市",
			Id:       "350900000000",
		},
	},
	"360000000000": {
		{
			Province: "江西省",
			Name:     "南昌市",
			Id:       "360100000000",
		},
		{
			Province: "江西省",
			Name:     "景德镇市",
			Id:       "360200000000",
		},
		{
			Province: "江西省",
			Name:     "萍乡市",
			Id:       "360300000000",
		},
		{
			Province: "江西省",
			Name:     "九江市",
			Id:       "360400000000",
		},
		{
			Province: "江西省",
			Name:     "新余市",
			Id:       "360500000000",
		},
		{
			Province: "江西省",
			Name:     "鹰潭市",
			Id:       "360600000000",
		},
		{
			Province: "江西省",
			Name:     "赣州市",
			Id:       "360700000000",
		},
		{
			Province: "江西省",
			Name:     "吉安市",
			Id:       "360800000000",
		},
		{
			Province: "江西省",
			Name:     "宜春市",
			Id:       "360900000000",
		},
		{
			Province: "江西省",
			Name:     "抚州市",
			Id:       "361000000000",
		},
		{
			Province: "江西省",
			Name:     "上饶市",
			Id:       "361100000000",
		},
	},
	"370000000000": {
		{
			Province: "山东省",
			Name:     "济南市",
			Id:       "370100000000",
		},
		{
			Province: "山东省",
			Name:     "青岛市",
			Id:       "370200000000",
		},
		{
			Province: "山东省",
			Name:     "淄博市",
			Id:       "370300000000",
		},
		{
			Province: "山东省",
			Name:     "枣庄市",
			Id:       "370400000000",
		},
		{
			Province: "山东省",
			Name:     "东营市",
			Id:       "370500000000",
		},
		{
			Province: "山东省",
			Name:     "烟台市",
			Id:       "370600000000",
		},
		{
			Province: "山东省",
			Name:     "潍坊市",
			Id:       "370700000000",
		},
		{
			Province: "山东省",
			Name:     "济宁市",
			Id:       "370800000000",
		},
		{
			Province: "山东省",
			Name:     "泰安市",
			Id:       "370900000000",
		},
		{
			Province: "山东省",
			Name:     "威海市",
			Id:       "371000000000",
		},
		{
			Province: "山东省",
			Name:     "日照市",
			Id:       "371100000000",
		},
		{
			Province: "山东省",
			Name:     "临沂市",
			Id:       "371300000000",
		},
		{
			Province: "山东省",
			Name:     "德州市",
			Id:       "371400000000",
		},
		{
			Province: "山东省",
			Name:     "聊城市",
			Id:       "371500000000",
		},
		{
			Province: "山东省",
			Name:     "滨州市",
			Id:       "371600000000",
		},
		{
			Province: "山东省",
			Name:     "菏泽市",
			Id:       "371700000000",
		},
	},
	"410000000000": {
		{
			Province: "河南省",
			Name:     "郑州市",
			Id:       "410100000000",
		},
		{
			Province: "河南省",
			Name:     "开封市",
			Id:       "410200000000",
		},
		{
			Province: "河南省",
			Name:     "洛阳市",
			Id:       "410300000000",
		},
		{
			Province: "河南省",
			Name:     "平顶山市",
			Id:       "410400000000",
		},
		{
			Province: "河南省",
			Name:     "安阳市",
			Id:       "410500000000",
		},
		{
			Province: "河南省",
			Name:     "鹤壁市",
			Id:       "410600000000",
		},
		{
			Province: "河南省",
			Name:     "新乡市",
			Id:       "410700000000",
		},
		{
			Province: "河南省",
			Name:     "焦作市",
			Id:       "410800000000",
		},
		{
			Province: "河南省",
			Name:     "濮阳市",
			Id:       "410900000000",
		},
		{
			Province: "河南省",
			Name:     "许昌市",
			Id:       "411000000000",
		},
		{
			Province: "河南省",
			Name:     "漯河市",
			Id:       "411100000000",
		},
		{
			Province: "河南省",
			Name:     "三门峡市",
			Id:       "411200000000",
		},
		{
			Province: "河南省",
			Name:     "南阳市",
			Id:       "411300000000",
		},
		{
			Province: "河南省",
			Name:     "商丘市",
			Id:       "411400000000",
		},
		{
			Province: "河南省",
			Name:     "信阳市",
			Id:       "411500000000",
		},
		{
			Province: "河南省",
			Name:     "周口市",
			Id:       "411600000000",
		},
		{
			Province: "河南省",
			Name:     "驻马店市",
			Id:       "411700000000",
		},
		{
			Province: "河南省",
			Name:     "省直辖县级行政区划",
			Id:       "419000000000",
		},
	},
	"420000000000": {
		{
			Province: "湖北省",
			Name:     "武汉市",
			Id:       "420100000000",
		},
		{
			Province: "湖北省",
			Name:     "黄石市",
			Id:       "420200000000",
		},
		{
			Province: "湖北省",
			Name:     "十堰市",
			Id:       "420300000000",
		},
		{
			Province: "湖北省",
			Name:     "宜昌市",
			Id:       "420500000000",
		},
		{
			Province: "湖北省",
			Name:     "襄阳市",
			Id:       "420600000000",
		},
		{
			Province: "湖北省",
			Name:     "鄂州市",
			Id:       "420700000000",
		},
		{
			Province: "湖北省",
			Name:     "荆门市",
			Id:       "420800000000",
		},
		{
			Province: "湖北省",
			Name:     "孝感市",
			Id:       "420900000000",
		},
		{
			Province: "湖北省",
			Name:     "荆州市",
			Id:       "421000000000",
		},
		{
			Province: "湖北省",
			Name:     "黄冈市",
			Id:       "421100000000",
		},
		{
			Province: "湖北省",
			Name:     "咸宁市",
			Id:       "421200000000",
		},
		{
			Province: "湖北省",
			Name:     "随州市",
			Id:       "421300000000",
		},
		{
			Province: "湖北省",
			Name:     "恩施土家族苗族自治州",
			Id:       "422800000000",
		},
		{
			Province: "湖北省",
			Name:     "省直辖县级行政区划",
			Id:       "429000000000",
		},
	},
	"430000000000": {
		{
			Province: "湖南省",
			Name:     "长沙市",
			Id:       "430100000000",
		},
		{
			Province: "湖南省",
			Name:     "株洲市",
			Id:       "430200000000",
		},
		{
			Province: "湖南省",
			Name:     "湘潭市",
			Id:       "430300000000",
		},
		{
			Province: "湖南省",
			Name:     "衡阳市",
			Id:       "430400000000",
		},
		{
			Province: "湖南省",
			Name:     "邵阳市",
			Id:       "430500000000",
		},
		{
			Province: "湖南省",
			Name:     "岳阳市",
			Id:       "430600000000",
		},
		{
			Province: "湖南省",
			Name:     "常德市",
			Id:       "430700000000",
		},
		{
			Province: "湖南省",
			Name:     "张家界市",
			Id:       "430800000000",
		},
		{
			Province: "湖南省",
			Name:     "益阳市",
			Id:       "430900000000",
		},
		{
			Province: "湖南省",
			Name:     "郴州市",
			Id:       "431000000000",
		},
		{
			Province: "湖南省",
			Name:     "永州市",
			Id:       "431100000000",
		},
		{
			Province: "湖南省",
			Name:     "怀化市",
			Id:       "431200000000",
		},
		{
			Province: "湖南省",
			Name:     "娄底市",
			Id:       "431300000000",
		},
		{
			Province: "湖南省",
			Name:     "湘西土家族苗族自治州",
			Id:       "433100000000",
		},
	},
	"440000000000": {
		{
			Province: "广东省",
			Name:     "广州市",
			Id:       "440100000000",
		},
		{
			Province: "广东省",
			Name:     "韶关市",
			Id:       "440200000000",
		},
		{
			Province: "广东省",
			Name:     "深圳市",
			Id:       "440300000000",
		},
		{
			Province: "广东省",
			Name:     "珠海市",
			Id:       "440400000000",
		},
		{
			Province: "广东省",
			Name:     "汕头市",
			Id:       "440500000000",
		},
		{
			Province: "广东省",
			Name:     "佛山市",
			Id:       "440600000000",
		},
		{
			Province: "广东省",
			Name:     "江门市",
			Id:       "440700000000",
		},
		{
			Province: "广东省",
			Name:     "湛江市",
			Id:       "440800000000",
		},
		{
			Province: "广东省",
			Name:     "茂名市",
			Id:       "440900000000",
		},
		{
			Province: "广东省",
			Name:     "肇庆市",
			Id:       "441200000000",
		},
		{
			Province: "广东省",
			Name:     "惠州市",
			Id:       "441300000000",
		},
		{
			Province: "广东省",
			Name:     "梅州市",
			Id:       "441400000000",
		},
		{
			Province: "广东省",
			Name:     "汕尾市",
			Id:       "441500000000",
		},
		{
			Province: "广东省",
			Name:     "河源市",
			Id:       "441600000000",
		},
		{
			Province: "广东省",
			Name:     "阳江市",
			Id:       "441700000000",
		},
		{
			Province: "广东省",
			Name:     "清远市",
			Id:       "441800000000",
		},
		{
			Province: "广东省",
			Name:     "东莞市",
			Id:       "441900000000",
		},
		{
			Province: "广东省",
			Name:     "中山市",
			Id:       "442000000000",
		},
		{
			Province: "广东省",
			Name:     "潮州市",
			Id:       "445100000000",
		},
		{
			Province: "广东省",
			Name:     "揭阳市",
			Id:       "445200000000",
		},
		{
			Province: "广东省",
			Name:     "云浮市",
			Id:       "445300000000",
		},
	},
	"450000000000": {
		{
			Province: "广西壮族自治区",
			Name:     "南宁市",
			Id:       "450100000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "柳州市",
			Id:       "450200000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "桂林市",
			Id:       "450300000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "梧州市",
			Id:       "450400000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "北海市",
			Id:       "450500000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "防城港市",
			Id:       "450600000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "钦州市",
			Id:       "450700000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "贵港市",
			Id:       "450800000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "玉林市",
			Id:       "450900000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "百色市",
			Id:       "451000000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "贺州市",
			Id:       "451100000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "河池市",
			Id:       "451200000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "来宾市",
			Id:       "451300000000",
		},
		{
			Province: "广西壮族自治区",
			Name:     "崇左市",
			Id:       "451400000000",
		},
	},
	"460000000000": {
		{
			Province: "海南省",
			Name:     "海口市",
			Id:       "460100000000",
		},
		{
			Province: "海南省",
			Name:     "三亚市",
			Id:       "460200000000",
		},
		{
			Province: "海南省",
			Name:     "三沙市",
			Id:       "460300000000",
		},
		{
			Province: "海南省",
			Name:     "儋州市",
			Id:       "460400000000",
		},
		{
			Province: "海南省",
			Name:     "省直辖县级行政区划",
			Id:       "469000000000",
		},
	},
	"500000000000": {
		{
			Province: "重庆市",
			Name:     "市辖区",
			Id:       "500100000000",
		},
		{
			Province: "重庆市",
			Name:     "县",
			Id:       "500200000000",
		},
	},
	"510000000000": {
		{
			Province: "四川省",
			Name:     "成都市",
			Id:       "510100000000",
		},
		{
			Province: "四川省",
			Name:     "自贡市",
			Id:       "510300000000",
		},
		{
			Province: "四川省",
			Name:     "攀枝花市",
			Id:       "510400000000",
		},
		{
			Province: "四川省",
			Name:     "泸州市",
			Id:       "510500000000",
		},
		{
			Province: "四川省",
			Name:     "德阳市",
			Id:       "510600000000",
		},
		{
			Province: "四川省",
			Name:     "绵阳市",
			Id:       "510700000000",
		},
		{
			Province: "四川省",
			Name:     "广元市",
			Id:       "510800000000",
		},
		{
			Province: "四川省",
			Name:     "遂宁市",
			Id:       "510900000000",
		},
		{
			Province: "四川省",
			Name:     "内江市",
			Id:       "511000000000",
		},
		{
			Province: "四川省",
			Name:     "乐山市",
			Id:       "511100000000",
		},
		{
			Province: "四川省",
			Name:     "南充市",
			Id:       "511300000000",
		},
		{
			Province: "四川省",
			Name:     "眉山市",
			Id:       "511400000000",
		},
		{
			Province: "四川省",
			Name:     "宜宾市",
			Id:       "511500000000",
		},
		{
			Province: "四川省",
			Name:     "广安市",
			Id:       "511600000000",
		},
		{
			Province: "四川省",
			Name:     "达州市",
			Id:       "511700000000",
		},
		{
			Province: "四川省",
			Name:     "雅安市",
			Id:       "511800000000",
		},
		{
			Province: "四川省",
			Name:     "巴中市",
			Id:       "511900000000",
		},
		{
			Province: "四川省",
			Name:     "资阳市",
			Id:       "512000000000",
		},
		{
			Province: "四川省",
			Name:     "阿坝藏族羌族自治州",
			Id:       "513200000000",
		},
		{
			Province: "四川省",
			Name:     "甘孜藏族自治州",
			Id:       "513300000000",
		},
		{
			Province: "四川省",
			Name:     "凉山彝族自治州",
			Id:       "513400000000",
		},
	},
	"520000000000": {
		{
			Province: "贵州省",
			Name:     "贵阳市",
			Id:       "520100000000",
		},
		{
			Province: "贵州省",
			Name:     "六盘水市",
			Id:       "520200000000",
		},
		{
			Province: "贵州省",
			Name:     "遵义市",
			Id:       "520300000000",
		},
		{
			Province: "贵州省",
			Name:     "安顺市",
			Id:       "520400000000",
		},
		{
			Province: "贵州省",
			Name:     "毕节市",
			Id:       "520500000000",
		},
		{
			Province: "贵州省",
			Name:     "铜仁市",
			Id:       "520600000000",
		},
		{
			Province: "贵州省",
			Name:     "黔西南布依族苗族自治州",
			Id:       "522300000000",
		},
		{
			Province: "贵州省",
			Name:     "黔东南苗族侗族自治州",
			Id:       "522600000000",
		},
		{
			Province: "贵州省",
			Name:     "黔南布依族苗族自治州",
			Id:       "522700000000",
		},
	},
	"530000000000": {
		{
			Province: "云南省",
			Name:     "昆明市",
			Id:       "530100000000",
		},
		{
			Province: "云南省",
			Name:     "曲靖市",
			Id:       "530300000000",
		},
		{
			Province: "云南省",
			Name:     "玉溪市",
			Id:       "530400000000",
		},
		{
			Province: "云南省",
			Name:     "保山市",
			Id:       "530500000000",
		},
		{
			Province: "云南省",
			Name:     "昭通市",
			Id:       "530600000000",
		},
		{
			Province: "云南省",
			Name:     "丽江市",
			Id:       "530700000000",
		},
		{
			Province: "云南省",
			Name:     "普洱市",
			Id:       "530800000000",
		},
		{
			Province: "云南省",
			Name:     "临沧市",
			Id:       "530900000000",
		},
		{
			Province: "云南省",
			Name:     "楚雄彝族自治州",
			Id:       "532300000000",
		},
		{
			Province: "云南省",
			Name:     "红河哈尼族彝族自治州",
			Id:       "532500000000",
		},
		{
			Province: "云南省",
			Name:     "文山壮族苗族自治州",
			Id:       "532600000000",
		},
		{
			Province: "云南省",
			Name:     "西双版纳傣族自治州",
			Id:       "532800000000",
		},
		{
			Province: "云南省",
			Name:     "大理白族自治州",
			Id:       "532900000000",
		},
		{
			Province: "云南省",
			Name:     "德宏傣族景颇族自治州",
			Id:       "533100000000",
		},
		{
			Province: "云南省",
			Name:     "怒江傈僳族自治州",
			Id:       "533300000000",
		},
		{
			Province: "云南省",
			Name:     "迪庆藏族自治州",
			Id:       "533400000000",
		},
	},
	"540000000000": {
		{
			Province: "西藏自治区",
			Name:     "拉萨市",
			Id:       "540100000000",
		},
		{
			Province: "西藏自治区",
			Name:     "日喀则市",
			Id:       "540200000000",
		},
		{
			Province: "西藏自治区",
			Name:     "昌都市",
			Id:       "540300000000",
		},
		{
			Province: "西藏自治区",
			Name:     "林芝市",
			Id:       "540400000000",
		},
		{
			Province: "西藏自治区",
			Name:     "山南市",
			Id:       "540500000000",
		},
		{
			Province: "西藏自治区",
			Name:     "那曲市",
			Id:       "540600000000",
		},
		{
			Province: "西藏自治区",
			Name:     "阿里地区",
			Id:       "542500000000",
		},
	},
	"610000000000": {
		{
			Province: "陕西省",
			Name:     "西安市",
			Id:       "610100000000",
		},
		{
			Province: "陕西省",
			Name:     "铜川市",
			Id:       "610200000000",
		},
		{
			Province: "陕西省",
			Name:     "宝鸡市",
			Id:       "610300000000",
		},
		{
			Province: "陕西省",
			Name:     "咸阳市",
			Id:       "610400000000",
		},
		{
			Province: "陕西省",
			Name:     "渭南市",
			Id:       "610500000000",
		},
		{
			Province: "陕西省",
			Name:     "延安市",
			Id:       "610600000000",
		},
		{
			Province: "陕西省",
			Name:     "汉中市",
			Id:       "610700000000",
		},
		{
			Province: "陕西省",
			Name:     "榆林市",
			Id:       "610800000000",
		},
		{
			Province: "陕西省",
			Name:     "安康市",
			Id:       "610900000000",
		},
		{
			Province: "陕西省",
			Name:     "商洛市",
			Id:       "611000000000",
		},
	},
	"620000000000": {
		{
			Province: "甘肃省",
			Name:     "兰州市",
			Id:       "620100000000",
		},
		{
			Province: "甘肃省",
			Name:     "嘉峪关市",
			Id:       "620200000000",
		},
		{
			Province: "甘肃省",
			Name:     "金昌市",
			Id:       "620300000000",
		},
		{
			Province: "甘肃省",
			Name:     "白银市",
			Id:       "620400000000",
		},
		{
			Province: "甘肃省",
			Name:     "天水市",
			Id:       "620500000000",
		},
		{
			Province: "甘肃省",
			Name:     "武威市",
			Id:       "620600000000",
		},
		{
			Province: "甘肃省",
			Name:     "张掖市",
			Id:       "620700000000",
		},
		{
			Province: "甘肃省",
			Name:     "平凉市",
			Id:       "620800000000",
		},
		{
			Province: "甘肃省",
			Name:     "酒泉市",
			Id:       "620900000000",
		},
		{
			Province: "甘肃省",
			Name:     "庆阳市",
			Id:       "621000000000",
		},
		{
			Province: "甘肃省",
			Name:     "定西市",
			Id:       "621100000000",
		},
		{
			Province: "甘肃省",
			Name:     "陇南市",
			Id:       "621200000000",
		},
		{
			Province: "甘肃省",
			Name:     "临夏回族自治州",
			Id:       "622900000000",
		},
		{
			Province: "甘肃省",
			Name:     "甘南藏族自治州",
			Id:       "623000000000",
		},
	},
	"630000000000": {
		{
			Province: "青海省",
			Name:     "西宁市",
			Id:       "630100000000",
		},
		{
			Province: "青海省",
			Name:     "海东市",
			Id:       "630200000000",
		},
		{
			Province: "青海省",
			Name:     "海北藏族自治州",
			Id:       "632200000000",
		},
		{
			Province: "青海省",
			Name:     "黄南藏族自治州",
			Id:       "632300000000",
		},
		{
			Province: "青海省",
			Name:     "海南藏族自治州",
			Id:       "632500000000",
		},
		{
			Province: "青海省",
			Name:     "果洛藏族自治州",
			Id:       "632600000000",
		},
		{
			Province: "青海省",
			Name:     "玉树藏族自治州",
			Id:       "632700000000",
		},
		{
			Province: "青海省",
			Name:     "海西蒙古族藏族自治州",
			Id:       "632800000000",
		},
	},
	"640000000000": {
		{
			Province: "宁夏回族自治区",
			Name:     "银川市",
			Id:       "640100000000",
		},
		{
			Province: "宁夏回族自治区",
			Name:     "石嘴山市",
			Id:       "640200000000",
		},
		{
			Province: "宁夏回族自治区",
			Name:     "吴忠市",
			Id:       "640300000000",
		},
		{
			Province: "宁夏回族自治区",
			Name:     "固原市",
			Id:       "640400000000",
		},
		{
			Province: "宁夏回族自治区",
			Name:     "中卫市",
			Id:       "640500000000",
		},
	},
	"650000000000": {
		{
			Province: "新疆维吾尔自治区",
			Name:     "乌鲁木齐市",
			Id:       "650100000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "克拉玛依市",
			Id:       "650200000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "吐鲁番市",
			Id:       "650400000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "哈密市",
			Id:       "650500000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "昌吉回族自治州",
			Id:       "652300000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "博尔塔拉蒙古自治州",
			Id:       "652700000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "巴音郭楞蒙古自治州",
			Id:       "652800000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "阿克苏地区",
			Id:       "652900000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "克孜勒苏柯尔克孜自治州",
			Id:       "653000000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "喀什地区",
			Id:       "653100000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "和田地区",
			Id:       "653200000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "伊犁哈萨克自治州",
			Id:       "654000000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "塔城地区",
			Id:       "654200000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "阿勒泰地区",
			Id:       "654300000000",
		},
		{
			Province: "新疆维吾尔自治区",
			Name:     "自治区直辖县级行政区划",
			Id:       "659000000000",
		},
	},
}
var areas = map[string][]Area{
	"120100000000": {
		{
			City: "市辖区",
			Name: "和平区",
			Id:   "120101000000",
		},
		{
			City: "市辖区",
			Name: "河东区",
			Id:   "120102000000",
		},
		{
			City: "市辖区",
			Name: "河西区",
			Id:   "120103000000",
		},
		{
			City: "市辖区",
			Name: "南开区",
			Id:   "120104000000",
		},
		{
			City: "市辖区",
			Name: "河北区",
			Id:   "120105000000",
		},
		{
			City: "市辖区",
			Name: "红桥区",
			Id:   "120106000000",
		},
		{
			City: "市辖区",
			Name: "东丽区",
			Id:   "120110000000",
		},
		{
			City: "市辖区",
			Name: "西青区",
			Id:   "120111000000",
		},
		{
			City: "市辖区",
			Name: "津南区",
			Id:   "120112000000",
		},
		{
			City: "市辖区",
			Name: "北辰区",
			Id:   "120113000000",
		},
		{
			City: "市辖区",
			Name: "武清区",
			Id:   "120114000000",
		},
		{
			City: "市辖区",
			Name: "宝坻区",
			Id:   "120115000000",
		},
		{
			City: "市辖区",
			Name: "滨海新区",
			Id:   "120116000000",
		},
		{
			City: "市辖区",
			Name: "宁河区",
			Id:   "120117000000",
		},
		{
			City: "市辖区",
			Name: "静海区",
			Id:   "120118000000",
		},
		{
			City: "市辖区",
			Name: "蓟州区",
			Id:   "120119000000",
		},
		{
			City: "市辖区",
			Name: "和平区",
			Id:   "120101000000",
		},
		{
			City: "市辖区",
			Name: "河东区",
			Id:   "120102000000",
		},
		{
			City: "市辖区",
			Name: "河西区",
			Id:   "120103000000",
		},
		{
			City: "市辖区",
			Name: "南开区",
			Id:   "120104000000",
		},
		{
			City: "市辖区",
			Name: "河北区",
			Id:   "120105000000",
		},
		{
			City: "市辖区",
			Name: "红桥区",
			Id:   "120106000000",
		},
		{
			City: "市辖区",
			Name: "东丽区",
			Id:   "120110000000",
		},
		{
			City: "市辖区",
			Name: "西青区",
			Id:   "120111000000",
		},
		{
			City: "市辖区",
			Name: "津南区",
			Id:   "120112000000",
		},
		{
			City: "市辖区",
			Name: "北辰区",
			Id:   "120113000000",
		},
		{
			City: "市辖区",
			Name: "武清区",
			Id:   "120114000000",
		},
		{
			City: "市辖区",
			Name: "宝坻区",
			Id:   "120115000000",
		},
		{
			City: "市辖区",
			Name: "滨海新区",
			Id:   "120116000000",
		},
		{
			City: "市辖区",
			Name: "宁河区",
			Id:   "120117000000",
		},
		{
			City: "市辖区",
			Name: "静海区",
			Id:   "120118000000",
		},
		{
			City: "市辖区",
			Name: "蓟州区",
			Id:   "120119000000",
		},
	},
	"110100000000": {
		{
			City: "市辖区",
			Name: "东城区",
			Id:   "110101000000",
		},
		{
			City: "市辖区",
			Name: "西城区",
			Id:   "110102000000",
		},
		{
			City: "市辖区",
			Name: "朝阳区",
			Id:   "110105000000",
		},
		{
			City: "市辖区",
			Name: "丰台区",
			Id:   "110106000000",
		},
		{
			City: "市辖区",
			Name: "石景山区",
			Id:   "110107000000",
		},
		{
			City: "市辖区",
			Name: "海淀区",
			Id:   "110108000000",
		},
		{
			City: "市辖区",
			Name: "门头沟区",
			Id:   "110109000000",
		},
		{
			City: "市辖区",
			Name: "房山区",
			Id:   "110111000000",
		},
		{
			City: "市辖区",
			Name: "通州区",
			Id:   "110112000000",
		},
		{
			City: "市辖区",
			Name: "顺义区",
			Id:   "110113000000",
		},
		{
			City: "市辖区",
			Name: "昌平区",
			Id:   "110114000000",
		},
		{
			City: "市辖区",
			Name: "大兴区",
			Id:   "110115000000",
		},
		{
			City: "市辖区",
			Name: "怀柔区",
			Id:   "110116000000",
		},
		{
			City: "市辖区",
			Name: "平谷区",
			Id:   "110117000000",
		},
		{
			City: "市辖区",
			Name: "密云区",
			Id:   "110118000000",
		},
		{
			City: "市辖区",
			Name: "延庆区",
			Id:   "110119000000",
		},
	},
	"130100000000": {
		{
			City: "石家庄市",
			Name: "市辖区",
			Id:   "130101000000",
		},
		{
			City: "石家庄市",
			Name: "长安区",
			Id:   "130102000000",
		},
		{
			City: "石家庄市",
			Name: "桥西区",
			Id:   "130104000000",
		},
		{
			City: "石家庄市",
			Name: "新华区",
			Id:   "130105000000",
		},
		{
			City: "石家庄市",
			Name: "井陉矿区",
			Id:   "130107000000",
		},
		{
			City: "石家庄市",
			Name: "裕华区",
			Id:   "130108000000",
		},
		{
			City: "石家庄市",
			Name: "藁城区",
			Id:   "130109000000",
		},
		{
			City: "石家庄市",
			Name: "鹿泉区",
			Id:   "130110000000",
		},
		{
			City: "石家庄市",
			Name: "栾城区",
			Id:   "130111000000",
		},
		{
			City: "石家庄市",
			Name: "井陉县",
			Id:   "130121000000",
		},
		{
			City: "石家庄市",
			Name: "正定县",
			Id:   "130123000000",
		},
		{
			City: "石家庄市",
			Name: "行唐县",
			Id:   "130125000000",
		},
		{
			City: "石家庄市",
			Name: "灵寿县",
			Id:   "130126000000",
		},
		{
			City: "石家庄市",
			Name: "高邑县",
			Id:   "130127000000",
		},
		{
			City: "石家庄市",
			Name: "深泽县",
			Id:   "130128000000",
		},
		{
			City: "石家庄市",
			Name: "赞皇县",
			Id:   "130129000000",
		},
		{
			City: "石家庄市",
			Name: "无极县",
			Id:   "130130000000",
		},
		{
			City: "石家庄市",
			Name: "平山县",
			Id:   "130131000000",
		},
		{
			City: "石家庄市",
			Name: "元氏县",
			Id:   "130132000000",
		},
		{
			City: "石家庄市",
			Name: "赵县",
			Id:   "130133000000",
		},
		{
			City: "石家庄市",
			Name: "石家庄高新技术产业开发区",
			Id:   "130171000000",
		},
		{
			City: "石家庄市",
			Name: "石家庄循环化工园区",
			Id:   "130172000000",
		},
		{
			City: "石家庄市",
			Name: "辛集市",
			Id:   "130181000000",
		},
		{
			City: "石家庄市",
			Name: "晋州市",
			Id:   "130183000000",
		},
		{
			City: "石家庄市",
			Name: "新乐市",
			Id:   "130184000000",
		},
	},
	"130200000000": {
		{
			City: "唐山市",
			Name: "市辖区",
			Id:   "130201000000",
		},
		{
			City: "唐山市",
			Name: "路南区",
			Id:   "130202000000",
		},
		{
			City: "唐山市",
			Name: "路北区",
			Id:   "130203000000",
		},
		{
			City: "唐山市",
			Name: "古冶区",
			Id:   "130204000000",
		},
		{
			City: "唐山市",
			Name: "开平区",
			Id:   "130205000000",
		},
		{
			City: "唐山市",
			Name: "丰南区",
			Id:   "130207000000",
		},
		{
			City: "唐山市",
			Name: "丰润区",
			Id:   "130208000000",
		},
		{
			City: "唐山市",
			Name: "曹妃甸区",
			Id:   "130209000000",
		},
		{
			City: "唐山市",
			Name: "滦南县",
			Id:   "130224000000",
		},
		{
			City: "唐山市",
			Name: "乐亭县",
			Id:   "130225000000",
		},
		{
			City: "唐山市",
			Name: "迁西县",
			Id:   "130227000000",
		},
		{
			City: "唐山市",
			Name: "玉田县",
			Id:   "130229000000",
		},
		{
			City: "唐山市",
			Name: "河北唐山芦台经济开发区",
			Id:   "130271000000",
		},
		{
			City: "唐山市",
			Name: "唐山市汉沽管理区",
			Id:   "130272000000",
		},
		{
			City: "唐山市",
			Name: "唐山高新技术产业开发区",
			Id:   "130273000000",
		},
		{
			City: "唐山市",
			Name: "河北唐山海港经济开发区",
			Id:   "130274000000",
		},
		{
			City: "唐山市",
			Name: "遵化市",
			Id:   "130281000000",
		},
		{
			City: "唐山市",
			Name: "迁安市",
			Id:   "130283000000",
		},
		{
			City: "唐山市",
			Name: "滦州市",
			Id:   "130284000000",
		},
	},
	"130300000000": {
		{
			City: "秦皇岛市",
			Name: "市辖区",
			Id:   "130301000000",
		},
		{
			City: "秦皇岛市",
			Name: "海港区",
			Id:   "130302000000",
		},
		{
			City: "秦皇岛市",
			Name: "山海关区",
			Id:   "130303000000",
		},
		{
			City: "秦皇岛市",
			Name: "北戴河区",
			Id:   "130304000000",
		},
		{
			City: "秦皇岛市",
			Name: "抚宁区",
			Id:   "130306000000",
		},
		{
			City: "秦皇岛市",
			Name: "青龙满族自治县",
			Id:   "130321000000",
		},
		{
			City: "秦皇岛市",
			Name: "昌黎县",
			Id:   "130322000000",
		},
		{
			City: "秦皇岛市",
			Name: "卢龙县",
			Id:   "130324000000",
		},
		{
			City: "秦皇岛市",
			Name: "秦皇岛市经济技术开发区",
			Id:   "130371000000",
		},
		{
			City: "秦皇岛市",
			Name: "北戴河新区",
			Id:   "130372000000",
		},
	},
	"130400000000": {
		{
			City: "邯郸市",
			Name: "市辖区",
			Id:   "130401000000",
		},
		{
			City: "邯郸市",
			Name: "邯山区",
			Id:   "130402000000",
		},
		{
			City: "邯郸市",
			Name: "丛台区",
			Id:   "130403000000",
		},
		{
			City: "邯郸市",
			Name: "复兴区",
			Id:   "130404000000",
		},
		{
			City: "邯郸市",
			Name: "峰峰矿区",
			Id:   "130406000000",
		},
		{
			City: "邯郸市",
			Name: "肥乡区",
			Id:   "130407000000",
		},
		{
			City: "邯郸市",
			Name: "永年区",
			Id:   "130408000000",
		},
		{
			City: "邯郸市",
			Name: "临漳县",
			Id:   "130423000000",
		},
		{
			City: "邯郸市",
			Name: "成安县",
			Id:   "130424000000",
		},
		{
			City: "邯郸市",
			Name: "大名县",
			Id:   "130425000000",
		},
		{
			City: "邯郸市",
			Name: "涉县",
			Id:   "130426000000",
		},
		{
			City: "邯郸市",
			Name: "磁县",
			Id:   "130427000000",
		},
		{
			City: "邯郸市",
			Name: "邱县",
			Id:   "130430000000",
		},
		{
			City: "邯郸市",
			Name: "鸡泽县",
			Id:   "130431000000",
		},
		{
			City: "邯郸市",
			Name: "广平县",
			Id:   "130432000000",
		},
		{
			City: "邯郸市",
			Name: "馆陶县",
			Id:   "130433000000",
		},
		{
			City: "邯郸市",
			Name: "魏县",
			Id:   "130434000000",
		},
		{
			City: "邯郸市",
			Name: "曲周县",
			Id:   "130435000000",
		},
		{
			City: "邯郸市",
			Name: "邯郸经济技术开发区",
			Id:   "130471000000",
		},
		{
			City: "邯郸市",
			Name: "邯郸冀南新区",
			Id:   "130473000000",
		},
		{
			City: "邯郸市",
			Name: "武安市",
			Id:   "130481000000",
		},
	},
	"130500000000": {
		{
			City: "邢台市",
			Name: "市辖区",
			Id:   "130501000000",
		},
		{
			City: "邢台市",
			Name: "襄都区",
			Id:   "130502000000",
		},
		{
			City: "邢台市",
			Name: "信都区",
			Id:   "130503000000",
		},
		{
			City: "邢台市",
			Name: "任泽区",
			Id:   "130505000000",
		},
		{
			City: "邢台市",
			Name: "南和区",
			Id:   "130506000000",
		},
		{
			City: "邢台市",
			Name: "临城县",
			Id:   "130522000000",
		},
		{
			City: "邢台市",
			Name: "内丘县",
			Id:   "130523000000",
		},
		{
			City: "邢台市",
			Name: "柏乡县",
			Id:   "130524000000",
		},
		{
			City: "邢台市",
			Name: "隆尧县",
			Id:   "130525000000",
		},
		{
			City: "邢台市",
			Name: "宁晋县",
			Id:   "130528000000",
		},
		{
			City: "邢台市",
			Name: "巨鹿县",
			Id:   "130529000000",
		},
		{
			City: "邢台市",
			Name: "新河县",
			Id:   "130530000000",
		},
		{
			City: "邢台市",
			Name: "广宗县",
			Id:   "130531000000",
		},
		{
			City: "邢台市",
			Name: "平乡县",
			Id:   "130532000000",
		},
		{
			City: "邢台市",
			Name: "威县",
			Id:   "130533000000",
		},
		{
			City: "邢台市",
			Name: "清河县",
			Id:   "130534000000",
		},
		{
			City: "邢台市",
			Name: "临西县",
			Id:   "130535000000",
		},
		{
			City: "邢台市",
			Name: "河北邢台经济开发区",
			Id:   "130571000000",
		},
		{
			City: "邢台市",
			Name: "南宫市",
			Id:   "130581000000",
		},
		{
			City: "邢台市",
			Name: "沙河市",
			Id:   "130582000000",
		},
	},
	"130600000000": {
		{
			City: "保定市",
			Name: "市辖区",
			Id:   "130601000000",
		},
		{
			City: "保定市",
			Name: "竞秀区",
			Id:   "130602000000",
		},
		{
			City: "保定市",
			Name: "莲池区",
			Id:   "130606000000",
		},
		{
			City: "保定市",
			Name: "满城区",
			Id:   "130607000000",
		},
		{
			City: "保定市",
			Name: "清苑区",
			Id:   "130608000000",
		},
		{
			City: "保定市",
			Name: "徐水区",
			Id:   "130609000000",
		},
		{
			City: "保定市",
			Name: "涞水县",
			Id:   "130623000000",
		},
		{
			City: "保定市",
			Name: "阜平县",
			Id:   "130624000000",
		},
		{
			City: "保定市",
			Name: "定兴县",
			Id:   "130626000000",
		},
		{
			City: "保定市",
			Name: "唐县",
			Id:   "130627000000",
		},
		{
			City: "保定市",
			Name: "高阳县",
			Id:   "130628000000",
		},
		{
			City: "保定市",
			Name: "容城县",
			Id:   "130629000000",
		},
		{
			City: "保定市",
			Name: "涞源县",
			Id:   "130630000000",
		},
		{
			City: "保定市",
			Name: "望都县",
			Id:   "130631000000",
		},
		{
			City: "保定市",
			Name: "安新县",
			Id:   "130632000000",
		},
		{
			City: "保定市",
			Name: "易县",
			Id:   "130633000000",
		},
		{
			City: "保定市",
			Name: "曲阳县",
			Id:   "130634000000",
		},
		{
			City: "保定市",
			Name: "蠡县",
			Id:   "130635000000",
		},
		{
			City: "保定市",
			Name: "顺平县",
			Id:   "130636000000",
		},
		{
			City: "保定市",
			Name: "博野县",
			Id:   "130637000000",
		},
		{
			City: "保定市",
			Name: "雄县",
			Id:   "130638000000",
		},
		{
			City: "保定市",
			Name: "保定高新技术产业开发区",
			Id:   "130671000000",
		},
		{
			City: "保定市",
			Name: "保定白沟新城",
			Id:   "130672000000",
		},
		{
			City: "保定市",
			Name: "涿州市",
			Id:   "130681000000",
		},
		{
			City: "保定市",
			Name: "定州市",
			Id:   "130682000000",
		},
		{
			City: "保定市",
			Name: "安国市",
			Id:   "130683000000",
		},
		{
			City: "保定市",
			Name: "高碑店市",
			Id:   "130684000000",
		},
	},
	"130700000000": {
		{
			City: "张家口市",
			Name: "市辖区",
			Id:   "130701000000",
		},
		{
			City: "张家口市",
			Name: "桥东区",
			Id:   "130702000000",
		},
		{
			City: "张家口市",
			Name: "桥西区",
			Id:   "130703000000",
		},
		{
			City: "张家口市",
			Name: "宣化区",
			Id:   "130705000000",
		},
		{
			City: "张家口市",
			Name: "下花园区",
			Id:   "130706000000",
		},
		{
			City: "张家口市",
			Name: "万全区",
			Id:   "130708000000",
		},
		{
			City: "张家口市",
			Name: "崇礼区",
			Id:   "130709000000",
		},
		{
			City: "张家口市",
			Name: "张北县",
			Id:   "130722000000",
		},
		{
			City: "张家口市",
			Name: "康保县",
			Id:   "130723000000",
		},
		{
			City: "张家口市",
			Name: "沽源县",
			Id:   "130724000000",
		},
		{
			City: "张家口市",
			Name: "尚义县",
			Id:   "130725000000",
		},
		{
			City: "张家口市",
			Name: "蔚县",
			Id:   "130726000000",
		},
		{
			City: "张家口市",
			Name: "阳原县",
			Id:   "130727000000",
		},
		{
			City: "张家口市",
			Name: "怀安县",
			Id:   "130728000000",
		},
		{
			City: "张家口市",
			Name: "怀来县",
			Id:   "130730000000",
		},
		{
			City: "张家口市",
			Name: "涿鹿县",
			Id:   "130731000000",
		},
		{
			City: "张家口市",
			Name: "赤城县",
			Id:   "130732000000",
		},
		{
			City: "张家口市",
			Name: "张家口经济开发区",
			Id:   "130771000000",
		},
		{
			City: "张家口市",
			Name: "张家口市察北管理区",
			Id:   "130772000000",
		},
		{
			City: "张家口市",
			Name: "张家口市塞北管理区",
			Id:   "130773000000",
		},
	},
	"130800000000": {
		{
			City: "承德市",
			Name: "市辖区",
			Id:   "130801000000",
		},
		{
			City: "承德市",
			Name: "双桥区",
			Id:   "130802000000",
		},
		{
			City: "承德市",
			Name: "双滦区",
			Id:   "130803000000",
		},
		{
			City: "承德市",
			Name: "鹰手营子矿区",
			Id:   "130804000000",
		},
		{
			City: "承德市",
			Name: "承德县",
			Id:   "130821000000",
		},
		{
			City: "承德市",
			Name: "兴隆县",
			Id:   "130822000000",
		},
		{
			City: "承德市",
			Name: "滦平县",
			Id:   "130824000000",
		},
		{
			City: "承德市",
			Name: "隆化县",
			Id:   "130825000000",
		},
		{
			City: "承德市",
			Name: "丰宁满族自治县",
			Id:   "130826000000",
		},
		{
			City: "承德市",
			Name: "宽城满族自治县",
			Id:   "130827000000",
		},
		{
			City: "承德市",
			Name: "围场满族蒙古族自治县",
			Id:   "130828000000",
		},
		{
			City: "承德市",
			Name: "承德高新技术产业开发区",
			Id:   "130871000000",
		},
		{
			City: "承德市",
			Name: "平泉市",
			Id:   "130881000000",
		},
	},
	"130900000000": {
		{
			City: "沧州市",
			Name: "市辖区",
			Id:   "130901000000",
		},
		{
			City: "沧州市",
			Name: "新华区",
			Id:   "130902000000",
		},
		{
			City: "沧州市",
			Name: "运河区",
			Id:   "130903000000",
		},
		{
			City: "沧州市",
			Name: "沧县",
			Id:   "130921000000",
		},
		{
			City: "沧州市",
			Name: "青县",
			Id:   "130922000000",
		},
		{
			City: "沧州市",
			Name: "东光县",
			Id:   "130923000000",
		},
		{
			City: "沧州市",
			Name: "海兴县",
			Id:   "130924000000",
		},
		{
			City: "沧州市",
			Name: "盐山县",
			Id:   "130925000000",
		},
		{
			City: "沧州市",
			Name: "肃宁县",
			Id:   "130926000000",
		},
		{
			City: "沧州市",
			Name: "南皮县",
			Id:   "130927000000",
		},
		{
			City: "沧州市",
			Name: "吴桥县",
			Id:   "130928000000",
		},
		{
			City: "沧州市",
			Name: "献县",
			Id:   "130929000000",
		},
		{
			City: "沧州市",
			Name: "孟村回族自治县",
			Id:   "130930000000",
		},
		{
			City: "沧州市",
			Name: "河北沧州经济开发区",
			Id:   "130971000000",
		},
		{
			City: "沧州市",
			Name: "沧州高新技术产业开发区",
			Id:   "130972000000",
		},
		{
			City: "沧州市",
			Name: "沧州渤海新区",
			Id:   "130973000000",
		},
		{
			City: "沧州市",
			Name: "泊头市",
			Id:   "130981000000",
		},
		{
			City: "沧州市",
			Name: "任丘市",
			Id:   "130982000000",
		},
		{
			City: "沧州市",
			Name: "黄骅市",
			Id:   "130983000000",
		},
		{
			City: "沧州市",
			Name: "河间市",
			Id:   "130984000000",
		},
	},
	"131000000000": {
		{
			City: "廊坊市",
			Name: "市辖区",
			Id:   "131001000000",
		},
		{
			City: "廊坊市",
			Name: "安次区",
			Id:   "131002000000",
		},
		{
			City: "廊坊市",
			Name: "广阳区",
			Id:   "131003000000",
		},
		{
			City: "廊坊市",
			Name: "固安县",
			Id:   "131022000000",
		},
		{
			City: "廊坊市",
			Name: "永清县",
			Id:   "131023000000",
		},
		{
			City: "廊坊市",
			Name: "香河县",
			Id:   "131024000000",
		},
		{
			City: "廊坊市",
			Name: "大城县",
			Id:   "131025000000",
		},
		{
			City: "廊坊市",
			Name: "文安县",
			Id:   "131026000000",
		},
		{
			City: "廊坊市",
			Name: "大厂回族自治县",
			Id:   "131028000000",
		},
		{
			City: "廊坊市",
			Name: "廊坊经济技术开发区",
			Id:   "131071000000",
		},
		{
			City: "廊坊市",
			Name: "霸州市",
			Id:   "131081000000",
		},
		{
			City: "廊坊市",
			Name: "三河市",
			Id:   "131082000000",
		},
	},
	"131100000000": {
		{
			City: "衡水市",
			Name: "市辖区",
			Id:   "131101000000",
		},
		{
			City: "衡水市",
			Name: "桃城区",
			Id:   "131102000000",
		},
		{
			City: "衡水市",
			Name: "冀州区",
			Id:   "131103000000",
		},
		{
			City: "衡水市",
			Name: "枣强县",
			Id:   "131121000000",
		},
		{
			City: "衡水市",
			Name: "武邑县",
			Id:   "131122000000",
		},
		{
			City: "衡水市",
			Name: "武强县",
			Id:   "131123000000",
		},
		{
			City: "衡水市",
			Name: "饶阳县",
			Id:   "131124000000",
		},
		{
			City: "衡水市",
			Name: "安平县",
			Id:   "131125000000",
		},
		{
			City: "衡水市",
			Name: "故城县",
			Id:   "131126000000",
		},
		{
			City: "衡水市",
			Name: "景县",
			Id:   "131127000000",
		},
		{
			City: "衡水市",
			Name: "阜城县",
			Id:   "131128000000",
		},
		{
			City: "衡水市",
			Name: "河北衡水高新技术产业开发区",
			Id:   "131171000000",
		},
		{
			City: "衡水市",
			Name: "衡水滨湖新区",
			Id:   "131172000000",
		},
		{
			City: "衡水市",
			Name: "深州市",
			Id:   "131182000000",
		},
	},
	"140100000000": {
		{
			City: "太原市",
			Name: "市辖区",
			Id:   "140101000000",
		},
		{
			City: "太原市",
			Name: "小店区",
			Id:   "140105000000",
		},
		{
			City: "太原市",
			Name: "迎泽区",
			Id:   "140106000000",
		},
		{
			City: "太原市",
			Name: "杏花岭区",
			Id:   "140107000000",
		},
		{
			City: "太原市",
			Name: "尖草坪区",
			Id:   "140108000000",
		},
		{
			City: "太原市",
			Name: "万柏林区",
			Id:   "140109000000",
		},
		{
			City: "太原市",
			Name: "晋源区",
			Id:   "140110000000",
		},
		{
			City: "太原市",
			Name: "清徐县",
			Id:   "140121000000",
		},
		{
			City: "太原市",
			Name: "阳曲县",
			Id:   "140122000000",
		},
		{
			City: "太原市",
			Name: "娄烦县",
			Id:   "140123000000",
		},
		{
			City: "太原市",
			Name: "山西转型综合改革示范区",
			Id:   "140171000000",
		},
		{
			City: "太原市",
			Name: "古交市",
			Id:   "140181000000",
		},
	},
	"140200000000": {
		{
			City: "大同市",
			Name: "市辖区",
			Id:   "140201000000",
		},
		{
			City: "大同市",
			Name: "新荣区",
			Id:   "140212000000",
		},
		{
			City: "大同市",
			Name: "平城区",
			Id:   "140213000000",
		},
		{
			City: "大同市",
			Name: "云冈区",
			Id:   "140214000000",
		},
		{
			City: "大同市",
			Name: "云州区",
			Id:   "140215000000",
		},
		{
			City: "大同市",
			Name: "阳高县",
			Id:   "140221000000",
		},
		{
			City: "大同市",
			Name: "天镇县",
			Id:   "140222000000",
		},
		{
			City: "大同市",
			Name: "广灵县",
			Id:   "140223000000",
		},
		{
			City: "大同市",
			Name: "灵丘县",
			Id:   "140224000000",
		},
		{
			City: "大同市",
			Name: "浑源县",
			Id:   "140225000000",
		},
		{
			City: "大同市",
			Name: "左云县",
			Id:   "140226000000",
		},
		{
			City: "大同市",
			Name: "山西大同经济开发区",
			Id:   "140271000000",
		},
	},
	"140300000000": {
		{
			City: "阳泉市",
			Name: "市辖区",
			Id:   "140301000000",
		},
		{
			City: "阳泉市",
			Name: "城区",
			Id:   "140302000000",
		},
		{
			City: "阳泉市",
			Name: "矿区",
			Id:   "140303000000",
		},
		{
			City: "阳泉市",
			Name: "郊区",
			Id:   "140311000000",
		},
		{
			City: "阳泉市",
			Name: "平定县",
			Id:   "140321000000",
		},
		{
			City: "阳泉市",
			Name: "盂县",
			Id:   "140322000000",
		},
	},
	"140400000000": {
		{
			City: "长治市",
			Name: "市辖区",
			Id:   "140401000000",
		},
		{
			City: "长治市",
			Name: "潞州区",
			Id:   "140403000000",
		},
		{
			City: "长治市",
			Name: "上党区",
			Id:   "140404000000",
		},
		{
			City: "长治市",
			Name: "屯留区",
			Id:   "140405000000",
		},
		{
			City: "长治市",
			Name: "潞城区",
			Id:   "140406000000",
		},
		{
			City: "长治市",
			Name: "襄垣县",
			Id:   "140423000000",
		},
		{
			City: "长治市",
			Name: "平顺县",
			Id:   "140425000000",
		},
		{
			City: "长治市",
			Name: "黎城县",
			Id:   "140426000000",
		},
		{
			City: "长治市",
			Name: "壶关县",
			Id:   "140427000000",
		},
		{
			City: "长治市",
			Name: "长子县",
			Id:   "140428000000",
		},
		{
			City: "长治市",
			Name: "武乡县",
			Id:   "140429000000",
		},
		{
			City: "长治市",
			Name: "沁县",
			Id:   "140430000000",
		},
		{
			City: "长治市",
			Name: "沁源县",
			Id:   "140431000000",
		},
		{
			City: "长治市",
			Name: "山西长治高新技术产业园区",
			Id:   "140471000000",
		},
	},
	"140500000000": {
		{
			City: "晋城市",
			Name: "市辖区",
			Id:   "140501000000",
		},
		{
			City: "晋城市",
			Name: "城区",
			Id:   "140502000000",
		},
		{
			City: "晋城市",
			Name: "沁水县",
			Id:   "140521000000",
		},
		{
			City: "晋城市",
			Name: "阳城县",
			Id:   "140522000000",
		},
		{
			City: "晋城市",
			Name: "陵川县",
			Id:   "140524000000",
		},
		{
			City: "晋城市",
			Name: "泽州县",
			Id:   "140525000000",
		},
		{
			City: "晋城市",
			Name: "高平市",
			Id:   "140581000000",
		},
	},
	"140600000000": {
		{
			City: "朔州市",
			Name: "市辖区",
			Id:   "140601000000",
		},
		{
			City: "朔州市",
			Name: "朔城区",
			Id:   "140602000000",
		},
		{
			City: "朔州市",
			Name: "平鲁区",
			Id:   "140603000000",
		},
		{
			City: "朔州市",
			Name: "山阴县",
			Id:   "140621000000",
		},
		{
			City: "朔州市",
			Name: "应县",
			Id:   "140622000000",
		},
		{
			City: "朔州市",
			Name: "右玉县",
			Id:   "140623000000",
		},
		{
			City: "朔州市",
			Name: "山西朔州经济开发区",
			Id:   "140671000000",
		},
		{
			City: "朔州市",
			Name: "怀仁市",
			Id:   "140681000000",
		},
	},
	"140700000000": {
		{
			City: "晋中市",
			Name: "市辖区",
			Id:   "140701000000",
		},
		{
			City: "晋中市",
			Name: "榆次区",
			Id:   "140702000000",
		},
		{
			City: "晋中市",
			Name: "太谷区",
			Id:   "140703000000",
		},
		{
			City: "晋中市",
			Name: "榆社县",
			Id:   "140721000000",
		},
		{
			City: "晋中市",
			Name: "左权县",
			Id:   "140722000000",
		},
		{
			City: "晋中市",
			Name: "和顺县",
			Id:   "140723000000",
		},
		{
			City: "晋中市",
			Name: "昔阳县",
			Id:   "140724000000",
		},
		{
			City: "晋中市",
			Name: "寿阳县",
			Id:   "140725000000",
		},
		{
			City: "晋中市",
			Name: "祁县",
			Id:   "140727000000",
		},
		{
			City: "晋中市",
			Name: "平遥县",
			Id:   "140728000000",
		},
		{
			City: "晋中市",
			Name: "灵石县",
			Id:   "140729000000",
		},
		{
			City: "晋中市",
			Name: "介休市",
			Id:   "140781000000",
		},
	},
	"140800000000": {
		{
			City: "运城市",
			Name: "市辖区",
			Id:   "140801000000",
		},
		{
			City: "运城市",
			Name: "盐湖区",
			Id:   "140802000000",
		},
		{
			City: "运城市",
			Name: "临猗县",
			Id:   "140821000000",
		},
		{
			City: "运城市",
			Name: "万荣县",
			Id:   "140822000000",
		},
		{
			City: "运城市",
			Name: "闻喜县",
			Id:   "140823000000",
		},
		{
			City: "运城市",
			Name: "稷山县",
			Id:   "140824000000",
		},
		{
			City: "运城市",
			Name: "新绛县",
			Id:   "140825000000",
		},
		{
			City: "运城市",
			Name: "绛县",
			Id:   "140826000000",
		},
		{
			City: "运城市",
			Name: "垣曲县",
			Id:   "140827000000",
		},
		{
			City: "运城市",
			Name: "夏县",
			Id:   "140828000000",
		},
		{
			City: "运城市",
			Name: "平陆县",
			Id:   "140829000000",
		},
		{
			City: "运城市",
			Name: "芮城县",
			Id:   "140830000000",
		},
		{
			City: "运城市",
			Name: "永济市",
			Id:   "140881000000",
		},
		{
			City: "运城市",
			Name: "河津市",
			Id:   "140882000000",
		},
	},
	"140900000000": {
		{
			City: "忻州市",
			Name: "市辖区",
			Id:   "140901000000",
		},
		{
			City: "忻州市",
			Name: "忻府区",
			Id:   "140902000000",
		},
		{
			City: "忻州市",
			Name: "定襄县",
			Id:   "140921000000",
		},
		{
			City: "忻州市",
			Name: "五台县",
			Id:   "140922000000",
		},
		{
			City: "忻州市",
			Name: "代县",
			Id:   "140923000000",
		},
		{
			City: "忻州市",
			Name: "繁峙县",
			Id:   "140924000000",
		},
		{
			City: "忻州市",
			Name: "宁武县",
			Id:   "140925000000",
		},
		{
			City: "忻州市",
			Name: "静乐县",
			Id:   "140926000000",
		},
		{
			City: "忻州市",
			Name: "神池县",
			Id:   "140927000000",
		},
		{
			City: "忻州市",
			Name: "五寨县",
			Id:   "140928000000",
		},
		{
			City: "忻州市",
			Name: "岢岚县",
			Id:   "140929000000",
		},
		{
			City: "忻州市",
			Name: "河曲县",
			Id:   "140930000000",
		},
		{
			City: "忻州市",
			Name: "保德县",
			Id:   "140931000000",
		},
		{
			City: "忻州市",
			Name: "偏关县",
			Id:   "140932000000",
		},
		{
			City: "忻州市",
			Name: "五台山风景名胜区",
			Id:   "140971000000",
		},
		{
			City: "忻州市",
			Name: "原平市",
			Id:   "140981000000",
		},
	},
	"141000000000": {
		{
			City: "临汾市",
			Name: "市辖区",
			Id:   "141001000000",
		},
		{
			City: "临汾市",
			Name: "尧都区",
			Id:   "141002000000",
		},
		{
			City: "临汾市",
			Name: "曲沃县",
			Id:   "141021000000",
		},
		{
			City: "临汾市",
			Name: "翼城县",
			Id:   "141022000000",
		},
		{
			City: "临汾市",
			Name: "襄汾县",
			Id:   "141023000000",
		},
		{
			City: "临汾市",
			Name: "洪洞县",
			Id:   "141024000000",
		},
		{
			City: "临汾市",
			Name: "古县",
			Id:   "141025000000",
		},
		{
			City: "临汾市",
			Name: "安泽县",
			Id:   "141026000000",
		},
		{
			City: "临汾市",
			Name: "浮山县",
			Id:   "141027000000",
		},
		{
			City: "临汾市",
			Name: "吉县",
			Id:   "141028000000",
		},
		{
			City: "临汾市",
			Name: "乡宁县",
			Id:   "141029000000",
		},
		{
			City: "临汾市",
			Name: "大宁县",
			Id:   "141030000000",
		},
		{
			City: "临汾市",
			Name: "隰县",
			Id:   "141031000000",
		},
		{
			City: "临汾市",
			Name: "永和县",
			Id:   "141032000000",
		},
		{
			City: "临汾市",
			Name: "蒲县",
			Id:   "141033000000",
		},
		{
			City: "临汾市",
			Name: "汾西县",
			Id:   "141034000000",
		},
		{
			City: "临汾市",
			Name: "侯马市",
			Id:   "141081000000",
		},
		{
			City: "临汾市",
			Name: "霍州市",
			Id:   "141082000000",
		},
	},
	"141100000000": {
		{
			City: "吕梁市",
			Name: "市辖区",
			Id:   "141101000000",
		},
		{
			City: "吕梁市",
			Name: "离石区",
			Id:   "141102000000",
		},
		{
			City: "吕梁市",
			Name: "文水县",
			Id:   "141121000000",
		},
		{
			City: "吕梁市",
			Name: "交城县",
			Id:   "141122000000",
		},
		{
			City: "吕梁市",
			Name: "兴县",
			Id:   "141123000000",
		},
		{
			City: "吕梁市",
			Name: "临县",
			Id:   "141124000000",
		},
		{
			City: "吕梁市",
			Name: "柳林县",
			Id:   "141125000000",
		},
		{
			City: "吕梁市",
			Name: "石楼县",
			Id:   "141126000000",
		},
		{
			City: "吕梁市",
			Name: "岚县",
			Id:   "141127000000",
		},
		{
			City: "吕梁市",
			Name: "方山县",
			Id:   "141128000000",
		},
		{
			City: "吕梁市",
			Name: "中阳县",
			Id:   "141129000000",
		},
		{
			City: "吕梁市",
			Name: "交口县",
			Id:   "141130000000",
		},
		{
			City: "吕梁市",
			Name: "孝义市",
			Id:   "141181000000",
		},
		{
			City: "吕梁市",
			Name: "汾阳市",
			Id:   "141182000000",
		},
	},
	"150100000000": {
		{
			City: "呼和浩特市",
			Name: "市辖区",
			Id:   "150101000000",
		},
		{
			City: "呼和浩特市",
			Name: "新城区",
			Id:   "150102000000",
		},
		{
			City: "呼和浩特市",
			Name: "回民区",
			Id:   "150103000000",
		},
		{
			City: "呼和浩特市",
			Name: "玉泉区",
			Id:   "150104000000",
		},
		{
			City: "呼和浩特市",
			Name: "赛罕区",
			Id:   "150105000000",
		},
		{
			City: "呼和浩特市",
			Name: "土默特左旗",
			Id:   "150121000000",
		},
		{
			City: "呼和浩特市",
			Name: "托克托县",
			Id:   "150122000000",
		},
		{
			City: "呼和浩特市",
			Name: "和林格尔县",
			Id:   "150123000000",
		},
		{
			City: "呼和浩特市",
			Name: "清水河县",
			Id:   "150124000000",
		},
		{
			City: "呼和浩特市",
			Name: "武川县",
			Id:   "150125000000",
		},
		{
			City: "呼和浩特市",
			Name: "呼和浩特经济技术开发区",
			Id:   "150172000000",
		},
	},
	"150200000000": {
		{
			City: "包头市",
			Name: "市辖区",
			Id:   "150201000000",
		},
		{
			City: "包头市",
			Name: "东河区",
			Id:   "150202000000",
		},
		{
			City: "包头市",
			Name: "昆都仑区",
			Id:   "150203000000",
		},
		{
			City: "包头市",
			Name: "青山区",
			Id:   "150204000000",
		},
		{
			City: "包头市",
			Name: "石拐区",
			Id:   "150205000000",
		},
		{
			City: "包头市",
			Name: "白云鄂博矿区",
			Id:   "150206000000",
		},
		{
			City: "包头市",
			Name: "九原区",
			Id:   "150207000000",
		},
		{
			City: "包头市",
			Name: "土默特右旗",
			Id:   "150221000000",
		},
		{
			City: "包头市",
			Name: "固阳县",
			Id:   "150222000000",
		},
		{
			City: "包头市",
			Name: "达尔罕茂明安联合旗",
			Id:   "150223000000",
		},
		{
			City: "包头市",
			Name: "包头稀土高新技术产业开发区",
			Id:   "150271000000",
		},
	},
	"150300000000": {
		{
			City: "乌海市",
			Name: "市辖区",
			Id:   "150301000000",
		},
		{
			City: "乌海市",
			Name: "海勃湾区",
			Id:   "150302000000",
		},
		{
			City: "乌海市",
			Name: "海南区",
			Id:   "150303000000",
		},
		{
			City: "乌海市",
			Name: "乌达区",
			Id:   "150304000000",
		},
	},
	"150400000000": {
		{
			City: "赤峰市",
			Name: "市辖区",
			Id:   "150401000000",
		},
		{
			City: "赤峰市",
			Name: "红山区",
			Id:   "150402000000",
		},
		{
			City: "赤峰市",
			Name: "元宝山区",
			Id:   "150403000000",
		},
		{
			City: "赤峰市",
			Name: "松山区",
			Id:   "150404000000",
		},
		{
			City: "赤峰市",
			Name: "阿鲁科尔沁旗",
			Id:   "150421000000",
		},
		{
			City: "赤峰市",
			Name: "巴林左旗",
			Id:   "150422000000",
		},
		{
			City: "赤峰市",
			Name: "巴林右旗",
			Id:   "150423000000",
		},
		{
			City: "赤峰市",
			Name: "林西县",
			Id:   "150424000000",
		},
		{
			City: "赤峰市",
			Name: "克什克腾旗",
			Id:   "150425000000",
		},
		{
			City: "赤峰市",
			Name: "翁牛特旗",
			Id:   "150426000000",
		},
		{
			City: "赤峰市",
			Name: "喀喇沁旗",
			Id:   "150428000000",
		},
		{
			City: "赤峰市",
			Name: "宁城县",
			Id:   "150429000000",
		},
		{
			City: "赤峰市",
			Name: "敖汉旗",
			Id:   "150430000000",
		},
	},
	"150500000000": {
		{
			City: "通辽市",
			Name: "市辖区",
			Id:   "150501000000",
		},
		{
			City: "通辽市",
			Name: "科尔沁区",
			Id:   "150502000000",
		},
		{
			City: "通辽市",
			Name: "科尔沁左翼中旗",
			Id:   "150521000000",
		},
		{
			City: "通辽市",
			Name: "科尔沁左翼后旗",
			Id:   "150522000000",
		},
		{
			City: "通辽市",
			Name: "开鲁县",
			Id:   "150523000000",
		},
		{
			City: "通辽市",
			Name: "库伦旗",
			Id:   "150524000000",
		},
		{
			City: "通辽市",
			Name: "奈曼旗",
			Id:   "150525000000",
		},
		{
			City: "通辽市",
			Name: "扎鲁特旗",
			Id:   "150526000000",
		},
		{
			City: "通辽市",
			Name: "通辽经济技术开发区",
			Id:   "150571000000",
		},
		{
			City: "通辽市",
			Name: "霍林郭勒市",
			Id:   "150581000000",
		},
	},
	"150600000000": {
		{
			City: "鄂尔多斯市",
			Name: "市辖区",
			Id:   "150601000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "东胜区",
			Id:   "150602000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "康巴什区",
			Id:   "150603000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "达拉特旗",
			Id:   "150621000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "准格尔旗",
			Id:   "150622000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "鄂托克前旗",
			Id:   "150623000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "鄂托克旗",
			Id:   "150624000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "杭锦旗",
			Id:   "150625000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "乌审旗",
			Id:   "150626000000",
		},
		{
			City: "鄂尔多斯市",
			Name: "伊金霍洛旗",
			Id:   "150627000000",
		},
	},
	"150700000000": {
		{
			City: "呼伦贝尔市",
			Name: "市辖区",
			Id:   "150701000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "海拉尔区",
			Id:   "150702000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "扎赉诺尔区",
			Id:   "150703000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "阿荣旗",
			Id:   "150721000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "莫力达瓦达斡尔族自治旗",
			Id:   "150722000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "鄂伦春自治旗",
			Id:   "150723000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "鄂温克族自治旗",
			Id:   "150724000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "陈巴尔虎旗",
			Id:   "150725000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "新巴尔虎左旗",
			Id:   "150726000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "新巴尔虎右旗",
			Id:   "150727000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "满洲里市",
			Id:   "150781000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "牙克石市",
			Id:   "150782000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "扎兰屯市",
			Id:   "150783000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "额尔古纳市",
			Id:   "150784000000",
		},
		{
			City: "呼伦贝尔市",
			Name: "根河市",
			Id:   "150785000000",
		},
	},
	"150800000000": {
		{
			City: "巴彦淖尔市",
			Name: "市辖区",
			Id:   "150801000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "临河区",
			Id:   "150802000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "五原县",
			Id:   "150821000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "磴口县",
			Id:   "150822000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "乌拉特前旗",
			Id:   "150823000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "乌拉特中旗",
			Id:   "150824000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "乌拉特后旗",
			Id:   "150825000000",
		},
		{
			City: "巴彦淖尔市",
			Name: "杭锦后旗",
			Id:   "150826000000",
		},
	},
	"150900000000": {
		{
			City: "乌兰察布市",
			Name: "市辖区",
			Id:   "150901000000",
		},
		{
			City: "乌兰察布市",
			Name: "集宁区",
			Id:   "150902000000",
		},
		{
			City: "乌兰察布市",
			Name: "卓资县",
			Id:   "150921000000",
		},
		{
			City: "乌兰察布市",
			Name: "化德县",
			Id:   "150922000000",
		},
		{
			City: "乌兰察布市",
			Name: "商都县",
			Id:   "150923000000",
		},
		{
			City: "乌兰察布市",
			Name: "兴和县",
			Id:   "150924000000",
		},
		{
			City: "乌兰察布市",
			Name: "凉城县",
			Id:   "150925000000",
		},
		{
			City: "乌兰察布市",
			Name: "察哈尔右翼前旗",
			Id:   "150926000000",
		},
		{
			City: "乌兰察布市",
			Name: "察哈尔右翼中旗",
			Id:   "150927000000",
		},
		{
			City: "乌兰察布市",
			Name: "察哈尔右翼后旗",
			Id:   "150928000000",
		},
		{
			City: "乌兰察布市",
			Name: "四子王旗",
			Id:   "150929000000",
		},
		{
			City: "乌兰察布市",
			Name: "丰镇市",
			Id:   "150981000000",
		},
	},
	"152200000000": {
		{
			City: "兴安盟",
			Name: "乌兰浩特市",
			Id:   "152201000000",
		},
		{
			City: "兴安盟",
			Name: "阿尔山市",
			Id:   "152202000000",
		},
		{
			City: "兴安盟",
			Name: "科尔沁右翼前旗",
			Id:   "152221000000",
		},
		{
			City: "兴安盟",
			Name: "科尔沁右翼中旗",
			Id:   "152222000000",
		},
		{
			City: "兴安盟",
			Name: "扎赉特旗",
			Id:   "152223000000",
		},
		{
			City: "兴安盟",
			Name: "突泉县",
			Id:   "152224000000",
		},
	},
	"152500000000": {
		{
			City: "锡林郭勒盟",
			Name: "二连浩特市",
			Id:   "152501000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "锡林浩特市",
			Id:   "152502000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "阿巴嘎旗",
			Id:   "152522000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "苏尼特左旗",
			Id:   "152523000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "苏尼特右旗",
			Id:   "152524000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "东乌珠穆沁旗",
			Id:   "152525000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "西乌珠穆沁旗",
			Id:   "152526000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "太仆寺旗",
			Id:   "152527000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "镶黄旗",
			Id:   "152528000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "正镶白旗",
			Id:   "152529000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "正蓝旗",
			Id:   "152530000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "多伦县",
			Id:   "152531000000",
		},
		{
			City: "锡林郭勒盟",
			Name: "乌拉盖管委会",
			Id:   "152571000000",
		},
	},
	"152900000000": {
		{
			City: "阿拉善盟",
			Name: "阿拉善左旗",
			Id:   "152921000000",
		},
		{
			City: "阿拉善盟",
			Name: "阿拉善右旗",
			Id:   "152922000000",
		},
		{
			City: "阿拉善盟",
			Name: "额济纳旗",
			Id:   "152923000000",
		},
		{
			City: "阿拉善盟",
			Name: "内蒙古阿拉善经济开发区",
			Id:   "152971000000",
		},
	},
	"210100000000": {
		{
			City: "沈阳市",
			Name: "市辖区",
			Id:   "210101000000",
		},
		{
			City: "沈阳市",
			Name: "和平区",
			Id:   "210102000000",
		},
		{
			City: "沈阳市",
			Name: "沈河区",
			Id:   "210103000000",
		},
		{
			City: "沈阳市",
			Name: "大东区",
			Id:   "210104000000",
		},
		{
			City: "沈阳市",
			Name: "皇姑区",
			Id:   "210105000000",
		},
		{
			City: "沈阳市",
			Name: "铁西区",
			Id:   "210106000000",
		},
		{
			City: "沈阳市",
			Name: "苏家屯区",
			Id:   "210111000000",
		},
		{
			City: "沈阳市",
			Name: "浑南区",
			Id:   "210112000000",
		},
		{
			City: "沈阳市",
			Name: "沈北新区",
			Id:   "210113000000",
		},
		{
			City: "沈阳市",
			Name: "于洪区",
			Id:   "210114000000",
		},
		{
			City: "沈阳市",
			Name: "辽中区",
			Id:   "210115000000",
		},
		{
			City: "沈阳市",
			Name: "康平县",
			Id:   "210123000000",
		},
		{
			City: "沈阳市",
			Name: "法库县",
			Id:   "210124000000",
		},
		{
			City: "沈阳市",
			Name: "新民市",
			Id:   "210181000000",
		},
	},
	"210200000000": {
		{
			City: "大连市",
			Name: "市辖区",
			Id:   "210201000000",
		},
		{
			City: "大连市",
			Name: "中山区",
			Id:   "210202000000",
		},
		{
			City: "大连市",
			Name: "西岗区",
			Id:   "210203000000",
		},
		{
			City: "大连市",
			Name: "沙河口区",
			Id:   "210204000000",
		},
		{
			City: "大连市",
			Name: "甘井子区",
			Id:   "210211000000",
		},
		{
			City: "大连市",
			Name: "旅顺口区",
			Id:   "210212000000",
		},
		{
			City: "大连市",
			Name: "金州区",
			Id:   "210213000000",
		},
		{
			City: "大连市",
			Name: "普兰店区",
			Id:   "210214000000",
		},
		{
			City: "大连市",
			Name: "长海县",
			Id:   "210224000000",
		},
		{
			City: "大连市",
			Name: "瓦房店市",
			Id:   "210281000000",
		},
		{
			City: "大连市",
			Name: "庄河市",
			Id:   "210283000000",
		},
	},
	"210300000000": {
		{
			City: "鞍山市",
			Name: "市辖区",
			Id:   "210301000000",
		},
		{
			City: "鞍山市",
			Name: "铁东区",
			Id:   "210302000000",
		},
		{
			City: "鞍山市",
			Name: "铁西区",
			Id:   "210303000000",
		},
		{
			City: "鞍山市",
			Name: "立山区",
			Id:   "210304000000",
		},
		{
			City: "鞍山市",
			Name: "千山区",
			Id:   "210311000000",
		},
		{
			City: "鞍山市",
			Name: "台安县",
			Id:   "210321000000",
		},
		{
			City: "鞍山市",
			Name: "岫岩满族自治县",
			Id:   "210323000000",
		},
		{
			City: "鞍山市",
			Name: "海城市",
			Id:   "210381000000",
		},
	},
	"210400000000": {
		{
			City: "抚顺市",
			Name: "市辖区",
			Id:   "210401000000",
		},
		{
			City: "抚顺市",
			Name: "新抚区",
			Id:   "210402000000",
		},
		{
			City: "抚顺市",
			Name: "东洲区",
			Id:   "210403000000",
		},
		{
			City: "抚顺市",
			Name: "望花区",
			Id:   "210404000000",
		},
		{
			City: "抚顺市",
			Name: "顺城区",
			Id:   "210411000000",
		},
		{
			City: "抚顺市",
			Name: "抚顺县",
			Id:   "210421000000",
		},
		{
			City: "抚顺市",
			Name: "新宾满族自治县",
			Id:   "210422000000",
		},
		{
			City: "抚顺市",
			Name: "清原满族自治县",
			Id:   "210423000000",
		},
	},
	"210500000000": {
		{
			City: "本溪市",
			Name: "市辖区",
			Id:   "210501000000",
		},
		{
			City: "本溪市",
			Name: "平山区",
			Id:   "210502000000",
		},
		{
			City: "本溪市",
			Name: "溪湖区",
			Id:   "210503000000",
		},
		{
			City: "本溪市",
			Name: "明山区",
			Id:   "210504000000",
		},
		{
			City: "本溪市",
			Name: "南芬区",
			Id:   "210505000000",
		},
		{
			City: "本溪市",
			Name: "本溪满族自治县",
			Id:   "210521000000",
		},
		{
			City: "本溪市",
			Name: "桓仁满族自治县",
			Id:   "210522000000",
		},
	},
	"210600000000": {
		{
			City: "丹东市",
			Name: "市辖区",
			Id:   "210601000000",
		},
		{
			City: "丹东市",
			Name: "元宝区",
			Id:   "210602000000",
		},
		{
			City: "丹东市",
			Name: "振兴区",
			Id:   "210603000000",
		},
		{
			City: "丹东市",
			Name: "振安区",
			Id:   "210604000000",
		},
		{
			City: "丹东市",
			Name: "宽甸满族自治县",
			Id:   "210624000000",
		},
		{
			City: "丹东市",
			Name: "东港市",
			Id:   "210681000000",
		},
		{
			City: "丹东市",
			Name: "凤城市",
			Id:   "210682000000",
		},
	},
	"210700000000": {
		{
			City: "锦州市",
			Name: "市辖区",
			Id:   "210701000000",
		},
		{
			City: "锦州市",
			Name: "古塔区",
			Id:   "210702000000",
		},
		{
			City: "锦州市",
			Name: "凌河区",
			Id:   "210703000000",
		},
		{
			City: "锦州市",
			Name: "太和区",
			Id:   "210711000000",
		},
		{
			City: "锦州市",
			Name: "黑山县",
			Id:   "210726000000",
		},
		{
			City: "锦州市",
			Name: "义县",
			Id:   "210727000000",
		},
		{
			City: "锦州市",
			Name: "凌海市",
			Id:   "210781000000",
		},
		{
			City: "锦州市",
			Name: "北镇市",
			Id:   "210782000000",
		},
	},
	"210800000000": {
		{
			City: "营口市",
			Name: "市辖区",
			Id:   "210801000000",
		},
		{
			City: "营口市",
			Name: "站前区",
			Id:   "210802000000",
		},
		{
			City: "营口市",
			Name: "西市区",
			Id:   "210803000000",
		},
		{
			City: "营口市",
			Name: "鲅鱼圈区",
			Id:   "210804000000",
		},
		{
			City: "营口市",
			Name: "老边区",
			Id:   "210811000000",
		},
		{
			City: "营口市",
			Name: "盖州市",
			Id:   "210881000000",
		},
		{
			City: "营口市",
			Name: "大石桥市",
			Id:   "210882000000",
		},
	},
	"210900000000": {
		{
			City: "阜新市",
			Name: "市辖区",
			Id:   "210901000000",
		},
		{
			City: "阜新市",
			Name: "海州区",
			Id:   "210902000000",
		},
		{
			City: "阜新市",
			Name: "新邱区",
			Id:   "210903000000",
		},
		{
			City: "阜新市",
			Name: "太平区",
			Id:   "210904000000",
		},
		{
			City: "阜新市",
			Name: "清河门区",
			Id:   "210905000000",
		},
		{
			City: "阜新市",
			Name: "细河区",
			Id:   "210911000000",
		},
		{
			City: "阜新市",
			Name: "阜新蒙古族自治县",
			Id:   "210921000000",
		},
		{
			City: "阜新市",
			Name: "彰武县",
			Id:   "210922000000",
		},
	},
	"211000000000": {
		{
			City: "辽阳市",
			Name: "市辖区",
			Id:   "211001000000",
		},
		{
			City: "辽阳市",
			Name: "白塔区",
			Id:   "211002000000",
		},
		{
			City: "辽阳市",
			Name: "文圣区",
			Id:   "211003000000",
		},
		{
			City: "辽阳市",
			Name: "宏伟区",
			Id:   "211004000000",
		},
		{
			City: "辽阳市",
			Name: "弓长岭区",
			Id:   "211005000000",
		},
		{
			City: "辽阳市",
			Name: "太子河区",
			Id:   "211011000000",
		},
		{
			City: "辽阳市",
			Name: "辽阳县",
			Id:   "211021000000",
		},
		{
			City: "辽阳市",
			Name: "灯塔市",
			Id:   "211081000000",
		},
	},
	"211100000000": {
		{
			City: "盘锦市",
			Name: "市辖区",
			Id:   "211101000000",
		},
		{
			City: "盘锦市",
			Name: "双台子区",
			Id:   "211102000000",
		},
		{
			City: "盘锦市",
			Name: "兴隆台区",
			Id:   "211103000000",
		},
		{
			City: "盘锦市",
			Name: "大洼区",
			Id:   "211104000000",
		},
		{
			City: "盘锦市",
			Name: "盘山县",
			Id:   "211122000000",
		},
	},
	"211200000000": {
		{
			City: "铁岭市",
			Name: "市辖区",
			Id:   "211201000000",
		},
		{
			City: "铁岭市",
			Name: "银州区",
			Id:   "211202000000",
		},
		{
			City: "铁岭市",
			Name: "清河区",
			Id:   "211204000000",
		},
		{
			City: "铁岭市",
			Name: "铁岭县",
			Id:   "211221000000",
		},
		{
			City: "铁岭市",
			Name: "西丰县",
			Id:   "211223000000",
		},
		{
			City: "铁岭市",
			Name: "昌图县",
			Id:   "211224000000",
		},
		{
			City: "铁岭市",
			Name: "调兵山市",
			Id:   "211281000000",
		},
		{
			City: "铁岭市",
			Name: "开原市",
			Id:   "211282000000",
		},
	},
	"211300000000": {
		{
			City: "朝阳市",
			Name: "市辖区",
			Id:   "211301000000",
		},
		{
			City: "朝阳市",
			Name: "双塔区",
			Id:   "211302000000",
		},
		{
			City: "朝阳市",
			Name: "龙城区",
			Id:   "211303000000",
		},
		{
			City: "朝阳市",
			Name: "朝阳县",
			Id:   "211321000000",
		},
		{
			City: "朝阳市",
			Name: "建平县",
			Id:   "211322000000",
		},
		{
			City: "朝阳市",
			Name: "喀喇沁左翼蒙古族自治县",
			Id:   "211324000000",
		},
		{
			City: "朝阳市",
			Name: "北票市",
			Id:   "211381000000",
		},
		{
			City: "朝阳市",
			Name: "凌源市",
			Id:   "211382000000",
		},
	},
	"211400000000": {
		{
			City: "葫芦岛市",
			Name: "市辖区",
			Id:   "211401000000",
		},
		{
			City: "葫芦岛市",
			Name: "连山区",
			Id:   "211402000000",
		},
		{
			City: "葫芦岛市",
			Name: "龙港区",
			Id:   "211403000000",
		},
		{
			City: "葫芦岛市",
			Name: "南票区",
			Id:   "211404000000",
		},
		{
			City: "葫芦岛市",
			Name: "绥中县",
			Id:   "211421000000",
		},
		{
			City: "葫芦岛市",
			Name: "建昌县",
			Id:   "211422000000",
		},
		{
			City: "葫芦岛市",
			Name: "兴城市",
			Id:   "211481000000",
		},
	},
	"220100000000": {
		{
			City: "长春市",
			Name: "市辖区",
			Id:   "220101000000",
		},
		{
			City: "长春市",
			Name: "南关区",
			Id:   "220102000000",
		},
		{
			City: "长春市",
			Name: "宽城区",
			Id:   "220103000000",
		},
		{
			City: "长春市",
			Name: "朝阳区",
			Id:   "220104000000",
		},
		{
			City: "长春市",
			Name: "二道区",
			Id:   "220105000000",
		},
		{
			City: "长春市",
			Name: "绿园区",
			Id:   "220106000000",
		},
		{
			City: "长春市",
			Name: "双阳区",
			Id:   "220112000000",
		},
		{
			City: "长春市",
			Name: "九台区",
			Id:   "220113000000",
		},
		{
			City: "长春市",
			Name: "农安县",
			Id:   "220122000000",
		},
		{
			City: "长春市",
			Name: "长春经济技术开发区",
			Id:   "220171000000",
		},
		{
			City: "长春市",
			Name: "长春净月高新技术产业开发区",
			Id:   "220172000000",
		},
		{
			City: "长春市",
			Name: "长春高新技术产业开发区",
			Id:   "220173000000",
		},
		{
			City: "长春市",
			Name: "长春汽车经济技术开发区",
			Id:   "220174000000",
		},
		{
			City: "长春市",
			Name: "榆树市",
			Id:   "220182000000",
		},
		{
			City: "长春市",
			Name: "德惠市",
			Id:   "220183000000",
		},
		{
			City: "长春市",
			Name: "公主岭市",
			Id:   "220184000000",
		},
	},
	"220200000000": {
		{
			City: "吉林市",
			Name: "市辖区",
			Id:   "220201000000",
		},
		{
			City: "吉林市",
			Name: "昌邑区",
			Id:   "220202000000",
		},
		{
			City: "吉林市",
			Name: "龙潭区",
			Id:   "220203000000",
		},
		{
			City: "吉林市",
			Name: "船营区",
			Id:   "220204000000",
		},
		{
			City: "吉林市",
			Name: "丰满区",
			Id:   "220211000000",
		},
		{
			City: "吉林市",
			Name: "永吉县",
			Id:   "220221000000",
		},
		{
			City: "吉林市",
			Name: "吉林经济开发区",
			Id:   "220271000000",
		},
		{
			City: "吉林市",
			Name: "吉林高新技术产业开发区",
			Id:   "220272000000",
		},
		{
			City: "吉林市",
			Name: "吉林中国新加坡食品区",
			Id:   "220273000000",
		},
		{
			City: "吉林市",
			Name: "蛟河市",
			Id:   "220281000000",
		},
		{
			City: "吉林市",
			Name: "桦甸市",
			Id:   "220282000000",
		},
		{
			City: "吉林市",
			Name: "舒兰市",
			Id:   "220283000000",
		},
		{
			City: "吉林市",
			Name: "磐石市",
			Id:   "220284000000",
		},
	},
	"220300000000": {
		{
			City: "四平市",
			Name: "市辖区",
			Id:   "220301000000",
		},
		{
			City: "四平市",
			Name: "铁西区",
			Id:   "220302000000",
		},
		{
			City: "四平市",
			Name: "铁东区",
			Id:   "220303000000",
		},
		{
			City: "四平市",
			Name: "梨树县",
			Id:   "220322000000",
		},
		{
			City: "四平市",
			Name: "伊通满族自治县",
			Id:   "220323000000",
		},
		{
			City: "四平市",
			Name: "双辽市",
			Id:   "220382000000",
		},
	},
	"220400000000": {
		{
			City: "辽源市",
			Name: "市辖区",
			Id:   "220401000000",
		},
		{
			City: "辽源市",
			Name: "龙山区",
			Id:   "220402000000",
		},
		{
			City: "辽源市",
			Name: "西安区",
			Id:   "220403000000",
		},
		{
			City: "辽源市",
			Name: "东丰县",
			Id:   "220421000000",
		},
		{
			City: "辽源市",
			Name: "东辽县",
			Id:   "220422000000",
		},
	},
	"220500000000": {
		{
			City: "通化市",
			Name: "市辖区",
			Id:   "220501000000",
		},
		{
			City: "通化市",
			Name: "东昌区",
			Id:   "220502000000",
		},
		{
			City: "通化市",
			Name: "二道江区",
			Id:   "220503000000",
		},
		{
			City: "通化市",
			Name: "通化县",
			Id:   "220521000000",
		},
		{
			City: "通化市",
			Name: "辉南县",
			Id:   "220523000000",
		},
		{
			City: "通化市",
			Name: "柳河县",
			Id:   "220524000000",
		},
		{
			City: "通化市",
			Name: "梅河口市",
			Id:   "220581000000",
		},
		{
			City: "通化市",
			Name: "集安市",
			Id:   "220582000000",
		},
	},
	"220600000000": {
		{
			City: "白山市",
			Name: "市辖区",
			Id:   "220601000000",
		},
		{
			City: "白山市",
			Name: "浑江区",
			Id:   "220602000000",
		},
		{
			City: "白山市",
			Name: "江源区",
			Id:   "220605000000",
		},
		{
			City: "白山市",
			Name: "抚松县",
			Id:   "220621000000",
		},
		{
			City: "白山市",
			Name: "靖宇县",
			Id:   "220622000000",
		},
		{
			City: "白山市",
			Name: "长白朝鲜族自治县",
			Id:   "220623000000",
		},
		{
			City: "白山市",
			Name: "临江市",
			Id:   "220681000000",
		},
	},
	"220700000000": {
		{
			City: "松原市",
			Name: "市辖区",
			Id:   "220701000000",
		},
		{
			City: "松原市",
			Name: "宁江区",
			Id:   "220702000000",
		},
		{
			City: "松原市",
			Name: "前郭尔罗斯蒙古族自治县",
			Id:   "220721000000",
		},
		{
			City: "松原市",
			Name: "长岭县",
			Id:   "220722000000",
		},
		{
			City: "松原市",
			Name: "乾安县",
			Id:   "220723000000",
		},
		{
			City: "松原市",
			Name: "吉林松原经济开发区",
			Id:   "220771000000",
		},
		{
			City: "松原市",
			Name: "扶余市",
			Id:   "220781000000",
		},
	},
	"220800000000": {
		{
			City: "白城市",
			Name: "市辖区",
			Id:   "220801000000",
		},
		{
			City: "白城市",
			Name: "洮北区",
			Id:   "220802000000",
		},
		{
			City: "白城市",
			Name: "镇赉县",
			Id:   "220821000000",
		},
		{
			City: "白城市",
			Name: "通榆县",
			Id:   "220822000000",
		},
		{
			City: "白城市",
			Name: "吉林白城经济开发区",
			Id:   "220871000000",
		},
		{
			City: "白城市",
			Name: "洮南市",
			Id:   "220881000000",
		},
		{
			City: "白城市",
			Name: "大安市",
			Id:   "220882000000",
		},
	},
	"222400000000": {
		{
			City: "延边朝鲜族自治州",
			Name: "延吉市",
			Id:   "222401000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "图们市",
			Id:   "222402000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "敦化市",
			Id:   "222403000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "珲春市",
			Id:   "222404000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "龙井市",
			Id:   "222405000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "和龙市",
			Id:   "222406000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "汪清县",
			Id:   "222424000000",
		},
		{
			City: "延边朝鲜族自治州",
			Name: "安图县",
			Id:   "222426000000",
		},
	},
	"230100000000": {
		{
			City: "哈尔滨市",
			Name: "市辖区",
			Id:   "230101000000",
		},
		{
			City: "哈尔滨市",
			Name: "道里区",
			Id:   "230102000000",
		},
		{
			City: "哈尔滨市",
			Name: "南岗区",
			Id:   "230103000000",
		},
		{
			City: "哈尔滨市",
			Name: "道外区",
			Id:   "230104000000",
		},
		{
			City: "哈尔滨市",
			Name: "平房区",
			Id:   "230108000000",
		},
		{
			City: "哈尔滨市",
			Name: "松北区",
			Id:   "230109000000",
		},
		{
			City: "哈尔滨市",
			Name: "香坊区",
			Id:   "230110000000",
		},
		{
			City: "哈尔滨市",
			Name: "呼兰区",
			Id:   "230111000000",
		},
		{
			City: "哈尔滨市",
			Name: "阿城区",
			Id:   "230112000000",
		},
		{
			City: "哈尔滨市",
			Name: "双城区",
			Id:   "230113000000",
		},
		{
			City: "哈尔滨市",
			Name: "依兰县",
			Id:   "230123000000",
		},
		{
			City: "哈尔滨市",
			Name: "方正县",
			Id:   "230124000000",
		},
		{
			City: "哈尔滨市",
			Name: "宾县",
			Id:   "230125000000",
		},
		{
			City: "哈尔滨市",
			Name: "巴彦县",
			Id:   "230126000000",
		},
		{
			City: "哈尔滨市",
			Name: "木兰县",
			Id:   "230127000000",
		},
		{
			City: "哈尔滨市",
			Name: "通河县",
			Id:   "230128000000",
		},
		{
			City: "哈尔滨市",
			Name: "延寿县",
			Id:   "230129000000",
		},
		{
			City: "哈尔滨市",
			Name: "尚志市",
			Id:   "230183000000",
		},
		{
			City: "哈尔滨市",
			Name: "五常市",
			Id:   "230184000000",
		},
	},
	"230200000000": {
		{
			City: "齐齐哈尔市",
			Name: "市辖区",
			Id:   "230201000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "龙沙区",
			Id:   "230202000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "建华区",
			Id:   "230203000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "铁锋区",
			Id:   "230204000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "昂昂溪区",
			Id:   "230205000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "富拉尔基区",
			Id:   "230206000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "碾子山区",
			Id:   "230207000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "梅里斯达斡尔族区",
			Id:   "230208000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "龙江县",
			Id:   "230221000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "依安县",
			Id:   "230223000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "泰来县",
			Id:   "230224000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "甘南县",
			Id:   "230225000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "富裕县",
			Id:   "230227000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "克山县",
			Id:   "230229000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "克东县",
			Id:   "230230000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "拜泉县",
			Id:   "230231000000",
		},
		{
			City: "齐齐哈尔市",
			Name: "讷河市",
			Id:   "230281000000",
		},
	},
	"230300000000": {
		{
			City: "鸡西市",
			Name: "市辖区",
			Id:   "230301000000",
		},
		{
			City: "鸡西市",
			Name: "鸡冠区",
			Id:   "230302000000",
		},
		{
			City: "鸡西市",
			Name: "恒山区",
			Id:   "230303000000",
		},
		{
			City: "鸡西市",
			Name: "滴道区",
			Id:   "230304000000",
		},
		{
			City: "鸡西市",
			Name: "梨树区",
			Id:   "230305000000",
		},
		{
			City: "鸡西市",
			Name: "城子河区",
			Id:   "230306000000",
		},
		{
			City: "鸡西市",
			Name: "麻山区",
			Id:   "230307000000",
		},
		{
			City: "鸡西市",
			Name: "鸡东县",
			Id:   "230321000000",
		},
		{
			City: "鸡西市",
			Name: "虎林市",
			Id:   "230381000000",
		},
		{
			City: "鸡西市",
			Name: "密山市",
			Id:   "230382000000",
		},
	},
	"230400000000": {
		{
			City: "鹤岗市",
			Name: "市辖区",
			Id:   "230401000000",
		},
		{
			City: "鹤岗市",
			Name: "向阳区",
			Id:   "230402000000",
		},
		{
			City: "鹤岗市",
			Name: "工农区",
			Id:   "230403000000",
		},
		{
			City: "鹤岗市",
			Name: "南山区",
			Id:   "230404000000",
		},
		{
			City: "鹤岗市",
			Name: "兴安区",
			Id:   "230405000000",
		},
		{
			City: "鹤岗市",
			Name: "东山区",
			Id:   "230406000000",
		},
		{
			City: "鹤岗市",
			Name: "兴山区",
			Id:   "230407000000",
		},
		{
			City: "鹤岗市",
			Name: "萝北县",
			Id:   "230421000000",
		},
		{
			City: "鹤岗市",
			Name: "绥滨县",
			Id:   "230422000000",
		},
	},
	"230500000000": {
		{
			City: "双鸭山市",
			Name: "市辖区",
			Id:   "230501000000",
		},
		{
			City: "双鸭山市",
			Name: "尖山区",
			Id:   "230502000000",
		},
		{
			City: "双鸭山市",
			Name: "岭东区",
			Id:   "230503000000",
		},
		{
			City: "双鸭山市",
			Name: "四方台区",
			Id:   "230505000000",
		},
		{
			City: "双鸭山市",
			Name: "宝山区",
			Id:   "230506000000",
		},
		{
			City: "双鸭山市",
			Name: "集贤县",
			Id:   "230521000000",
		},
		{
			City: "双鸭山市",
			Name: "友谊县",
			Id:   "230522000000",
		},
		{
			City: "双鸭山市",
			Name: "宝清县",
			Id:   "230523000000",
		},
		{
			City: "双鸭山市",
			Name: "饶河县",
			Id:   "230524000000",
		},
	},
	"230600000000": {
		{
			City: "大庆市",
			Name: "市辖区",
			Id:   "230601000000",
		},
		{
			City: "大庆市",
			Name: "萨尔图区",
			Id:   "230602000000",
		},
		{
			City: "大庆市",
			Name: "龙凤区",
			Id:   "230603000000",
		},
		{
			City: "大庆市",
			Name: "让胡路区",
			Id:   "230604000000",
		},
		{
			City: "大庆市",
			Name: "红岗区",
			Id:   "230605000000",
		},
		{
			City: "大庆市",
			Name: "大同区",
			Id:   "230606000000",
		},
		{
			City: "大庆市",
			Name: "肇州县",
			Id:   "230621000000",
		},
		{
			City: "大庆市",
			Name: "肇源县",
			Id:   "230622000000",
		},
		{
			City: "大庆市",
			Name: "林甸县",
			Id:   "230623000000",
		},
		{
			City: "大庆市",
			Name: "杜尔伯特蒙古族自治县",
			Id:   "230624000000",
		},
		{
			City: "大庆市",
			Name: "大庆高新技术产业开发区",
			Id:   "230671000000",
		},
	},
	"230700000000": {
		{
			City: "伊春市",
			Name: "市辖区",
			Id:   "230701000000",
		},
		{
			City: "伊春市",
			Name: "伊美区",
			Id:   "230717000000",
		},
		{
			City: "伊春市",
			Name: "乌翠区",
			Id:   "230718000000",
		},
		{
			City: "伊春市",
			Name: "友好区",
			Id:   "230719000000",
		},
		{
			City: "伊春市",
			Name: "嘉荫县",
			Id:   "230722000000",
		},
		{
			City: "伊春市",
			Name: "汤旺县",
			Id:   "230723000000",
		},
		{
			City: "伊春市",
			Name: "丰林县",
			Id:   "230724000000",
		},
		{
			City: "伊春市",
			Name: "大箐山县",
			Id:   "230725000000",
		},
		{
			City: "伊春市",
			Name: "南岔县",
			Id:   "230726000000",
		},
		{
			City: "伊春市",
			Name: "金林区",
			Id:   "230751000000",
		},
		{
			City: "伊春市",
			Name: "铁力市",
			Id:   "230781000000",
		},
	},
	"230800000000": {
		{
			City: "佳木斯市",
			Name: "市辖区",
			Id:   "230801000000",
		},
		{
			City: "佳木斯市",
			Name: "向阳区",
			Id:   "230803000000",
		},
		{
			City: "佳木斯市",
			Name: "前进区",
			Id:   "230804000000",
		},
		{
			City: "佳木斯市",
			Name: "东风区",
			Id:   "230805000000",
		},
		{
			City: "佳木斯市",
			Name: "郊区",
			Id:   "230811000000",
		},
		{
			City: "佳木斯市",
			Name: "桦南县",
			Id:   "230822000000",
		},
		{
			City: "佳木斯市",
			Name: "桦川县",
			Id:   "230826000000",
		},
		{
			City: "佳木斯市",
			Name: "汤原县",
			Id:   "230828000000",
		},
		{
			City: "佳木斯市",
			Name: "同江市",
			Id:   "230881000000",
		},
		{
			City: "佳木斯市",
			Name: "富锦市",
			Id:   "230882000000",
		},
		{
			City: "佳木斯市",
			Name: "抚远市",
			Id:   "230883000000",
		},
	},
	"230900000000": {
		{
			City: "七台河市",
			Name: "市辖区",
			Id:   "230901000000",
		},
		{
			City: "七台河市",
			Name: "新兴区",
			Id:   "230902000000",
		},
		{
			City: "七台河市",
			Name: "桃山区",
			Id:   "230903000000",
		},
		{
			City: "七台河市",
			Name: "茄子河区",
			Id:   "230904000000",
		},
		{
			City: "七台河市",
			Name: "勃利县",
			Id:   "230921000000",
		},
	},
	"231000000000": {
		{
			City: "牡丹江市",
			Name: "市辖区",
			Id:   "231001000000",
		},
		{
			City: "牡丹江市",
			Name: "东安区",
			Id:   "231002000000",
		},
		{
			City: "牡丹江市",
			Name: "阳明区",
			Id:   "231003000000",
		},
		{
			City: "牡丹江市",
			Name: "爱民区",
			Id:   "231004000000",
		},
		{
			City: "牡丹江市",
			Name: "西安区",
			Id:   "231005000000",
		},
		{
			City: "牡丹江市",
			Name: "林口县",
			Id:   "231025000000",
		},
		{
			City: "牡丹江市",
			Name: "牡丹江经济技术开发区",
			Id:   "231071000000",
		},
		{
			City: "牡丹江市",
			Name: "绥芬河市",
			Id:   "231081000000",
		},
		{
			City: "牡丹江市",
			Name: "海林市",
			Id:   "231083000000",
		},
		{
			City: "牡丹江市",
			Name: "宁安市",
			Id:   "231084000000",
		},
		{
			City: "牡丹江市",
			Name: "穆棱市",
			Id:   "231085000000",
		},
		{
			City: "牡丹江市",
			Name: "东宁市",
			Id:   "231086000000",
		},
	},
	"231100000000": {
		{
			City: "黑河市",
			Name: "市辖区",
			Id:   "231101000000",
		},
		{
			City: "黑河市",
			Name: "爱辉区",
			Id:   "231102000000",
		},
		{
			City: "黑河市",
			Name: "逊克县",
			Id:   "231123000000",
		},
		{
			City: "黑河市",
			Name: "孙吴县",
			Id:   "231124000000",
		},
		{
			City: "黑河市",
			Name: "北安市",
			Id:   "231181000000",
		},
		{
			City: "黑河市",
			Name: "五大连池市",
			Id:   "231182000000",
		},
		{
			City: "黑河市",
			Name: "嫩江市",
			Id:   "231183000000",
		},
	},
	"231200000000": {
		{
			City: "绥化市",
			Name: "市辖区",
			Id:   "231201000000",
		},
		{
			City: "绥化市",
			Name: "北林区",
			Id:   "231202000000",
		},
		{
			City: "绥化市",
			Name: "望奎县",
			Id:   "231221000000",
		},
		{
			City: "绥化市",
			Name: "兰西县",
			Id:   "231222000000",
		},
		{
			City: "绥化市",
			Name: "青冈县",
			Id:   "231223000000",
		},
		{
			City: "绥化市",
			Name: "庆安县",
			Id:   "231224000000",
		},
		{
			City: "绥化市",
			Name: "明水县",
			Id:   "231225000000",
		},
		{
			City: "绥化市",
			Name: "绥棱县",
			Id:   "231226000000",
		},
		{
			City: "绥化市",
			Name: "安达市",
			Id:   "231281000000",
		},
		{
			City: "绥化市",
			Name: "肇东市",
			Id:   "231282000000",
		},
		{
			City: "绥化市",
			Name: "海伦市",
			Id:   "231283000000",
		},
	},
	"232700000000": {
		{
			City: "大兴安岭地区",
			Name: "漠河市",
			Id:   "232701000000",
		},
		{
			City: "大兴安岭地区",
			Name: "呼玛县",
			Id:   "232721000000",
		},
		{
			City: "大兴安岭地区",
			Name: "塔河县",
			Id:   "232722000000",
		},
		{
			City: "大兴安岭地区",
			Name: "加格达奇区",
			Id:   "232761000000",
		},
		{
			City: "大兴安岭地区",
			Name: "松岭区",
			Id:   "232762000000",
		},
		{
			City: "大兴安岭地区",
			Name: "新林区",
			Id:   "232763000000",
		},
		{
			City: "大兴安岭地区",
			Name: "呼中区",
			Id:   "232764000000",
		},
	},
	"310100000000": {
		{
			City: "市辖区",
			Name: "黄浦区",
			Id:   "310101000000",
		},
		{
			City: "市辖区",
			Name: "徐汇区",
			Id:   "310104000000",
		},
		{
			City: "市辖区",
			Name: "长宁区",
			Id:   "310105000000",
		},
		{
			City: "市辖区",
			Name: "静安区",
			Id:   "310106000000",
		},
		{
			City: "市辖区",
			Name: "普陀区",
			Id:   "310107000000",
		},
		{
			City: "市辖区",
			Name: "虹口区",
			Id:   "310109000000",
		},
		{
			City: "市辖区",
			Name: "杨浦区",
			Id:   "310110000000",
		},
		{
			City: "市辖区",
			Name: "闵行区",
			Id:   "310112000000",
		},
		{
			City: "市辖区",
			Name: "宝山区",
			Id:   "310113000000",
		},
		{
			City: "市辖区",
			Name: "嘉定区",
			Id:   "310114000000",
		},
		{
			City: "市辖区",
			Name: "浦东新区",
			Id:   "310115000000",
		},
		{
			City: "市辖区",
			Name: "金山区",
			Id:   "310116000000",
		},
		{
			City: "市辖区",
			Name: "松江区",
			Id:   "310117000000",
		},
		{
			City: "市辖区",
			Name: "青浦区",
			Id:   "310118000000",
		},
		{
			City: "市辖区",
			Name: "奉贤区",
			Id:   "310120000000",
		},
		{
			City: "市辖区",
			Name: "崇明区",
			Id:   "310151000000",
		},
	},
	"320100000000": {
		{
			City: "南京市",
			Name: "市辖区",
			Id:   "320101000000",
		},
		{
			City: "南京市",
			Name: "玄武区",
			Id:   "320102000000",
		},
		{
			City: "南京市",
			Name: "秦淮区",
			Id:   "320104000000",
		},
		{
			City: "南京市",
			Name: "建邺区",
			Id:   "320105000000",
		},
		{
			City: "南京市",
			Name: "鼓楼区",
			Id:   "320106000000",
		},
		{
			City: "南京市",
			Name: "浦口区",
			Id:   "320111000000",
		},
		{
			City: "南京市",
			Name: "栖霞区",
			Id:   "320113000000",
		},
		{
			City: "南京市",
			Name: "雨花台区",
			Id:   "320114000000",
		},
		{
			City: "南京市",
			Name: "江宁区",
			Id:   "320115000000",
		},
		{
			City: "南京市",
			Name: "六合区",
			Id:   "320116000000",
		},
		{
			City: "南京市",
			Name: "溧水区",
			Id:   "320117000000",
		},
		{
			City: "南京市",
			Name: "高淳区",
			Id:   "320118000000",
		},
	},
	"320200000000": {
		{
			City: "无锡市",
			Name: "市辖区",
			Id:   "320201000000",
		},
		{
			City: "无锡市",
			Name: "锡山区",
			Id:   "320205000000",
		},
		{
			City: "无锡市",
			Name: "惠山区",
			Id:   "320206000000",
		},
		{
			City: "无锡市",
			Name: "滨湖区",
			Id:   "320211000000",
		},
		{
			City: "无锡市",
			Name: "梁溪区",
			Id:   "320213000000",
		},
		{
			City: "无锡市",
			Name: "新吴区",
			Id:   "320214000000",
		},
		{
			City: "无锡市",
			Name: "江阴市",
			Id:   "320281000000",
		},
		{
			City: "无锡市",
			Name: "宜兴市",
			Id:   "320282000000",
		},
	},
	"320300000000": {
		{
			City: "徐州市",
			Name: "市辖区",
			Id:   "320301000000",
		},
		{
			City: "徐州市",
			Name: "鼓楼区",
			Id:   "320302000000",
		},
		{
			City: "徐州市",
			Name: "云龙区",
			Id:   "320303000000",
		},
		{
			City: "徐州市",
			Name: "贾汪区",
			Id:   "320305000000",
		},
		{
			City: "徐州市",
			Name: "泉山区",
			Id:   "320311000000",
		},
		{
			City: "徐州市",
			Name: "铜山区",
			Id:   "320312000000",
		},
		{
			City: "徐州市",
			Name: "丰县",
			Id:   "320321000000",
		},
		{
			City: "徐州市",
			Name: "沛县",
			Id:   "320322000000",
		},
		{
			City: "徐州市",
			Name: "睢宁县",
			Id:   "320324000000",
		},
		{
			City: "徐州市",
			Name: "徐州经济技术开发区",
			Id:   "320371000000",
		},
		{
			City: "徐州市",
			Name: "新沂市",
			Id:   "320381000000",
		},
		{
			City: "徐州市",
			Name: "邳州市",
			Id:   "320382000000",
		},
	},
	"320400000000": {
		{
			City: "常州市",
			Name: "市辖区",
			Id:   "320401000000",
		},
		{
			City: "常州市",
			Name: "天宁区",
			Id:   "320402000000",
		},
		{
			City: "常州市",
			Name: "钟楼区",
			Id:   "320404000000",
		},
		{
			City: "常州市",
			Name: "新北区",
			Id:   "320411000000",
		},
		{
			City: "常州市",
			Name: "武进区",
			Id:   "320412000000",
		},
		{
			City: "常州市",
			Name: "金坛区",
			Id:   "320413000000",
		},
		{
			City: "常州市",
			Name: "溧阳市",
			Id:   "320481000000",
		},
	},
	"320500000000": {
		{
			City: "苏州市",
			Name: "市辖区",
			Id:   "320501000000",
		},
		{
			City: "苏州市",
			Name: "虎丘区",
			Id:   "320505000000",
		},
		{
			City: "苏州市",
			Name: "吴中区",
			Id:   "320506000000",
		},
		{
			City: "苏州市",
			Name: "相城区",
			Id:   "320507000000",
		},
		{
			City: "苏州市",
			Name: "姑苏区",
			Id:   "320508000000",
		},
		{
			City: "苏州市",
			Name: "吴江区",
			Id:   "320509000000",
		},
		{
			City: "苏州市",
			Name: "苏州工业园区",
			Id:   "320571000000",
		},
		{
			City: "苏州市",
			Name: "常熟市",
			Id:   "320581000000",
		},
		{
			City: "苏州市",
			Name: "张家港市",
			Id:   "320582000000",
		},
		{
			City: "苏州市",
			Name: "昆山市",
			Id:   "320583000000",
		},
		{
			City: "苏州市",
			Name: "太仓市",
			Id:   "320585000000",
		},
	},
	"320600000000": {
		{
			City: "南通市",
			Name: "市辖区",
			Id:   "320601000000",
		},
		{
			City: "南通市",
			Name: "崇川区",
			Id:   "320602000000",
		},
		{
			City: "南通市",
			Name: "港闸区",
			Id:   "320611000000",
		},
		{
			City: "南通市",
			Name: "通州区",
			Id:   "320612000000",
		},
		{
			City: "南通市",
			Name: "如东县",
			Id:   "320623000000",
		},
		{
			City: "南通市",
			Name: "南通经济技术开发区",
			Id:   "320671000000",
		},
		{
			City: "南通市",
			Name: "启东市",
			Id:   "320681000000",
		},
		{
			City: "南通市",
			Name: "如皋市",
			Id:   "320682000000",
		},
		{
			City: "南通市",
			Name: "海门市",
			Id:   "320684000000",
		},
		{
			City: "南通市",
			Name: "海安市",
			Id:   "320685000000",
		},
	},
	"320700000000": {
		{
			City: "连云港市",
			Name: "市辖区",
			Id:   "320701000000",
		},
		{
			City: "连云港市",
			Name: "连云区",
			Id:   "320703000000",
		},
		{
			City: "连云港市",
			Name: "海州区",
			Id:   "320706000000",
		},
		{
			City: "连云港市",
			Name: "赣榆区",
			Id:   "320707000000",
		},
		{
			City: "连云港市",
			Name: "东海县",
			Id:   "320722000000",
		},
		{
			City: "连云港市",
			Name: "灌云县",
			Id:   "320723000000",
		},
		{
			City: "连云港市",
			Name: "灌南县",
			Id:   "320724000000",
		},
		{
			City: "连云港市",
			Name: "连云港经济技术开发区",
			Id:   "320771000000",
		},
		{
			City: "连云港市",
			Name: "连云港高新技术产业开发区",
			Id:   "320772000000",
		},
	},
	"320800000000": {
		{
			City: "淮安市",
			Name: "市辖区",
			Id:   "320801000000",
		},
		{
			City: "淮安市",
			Name: "淮安区",
			Id:   "320803000000",
		},
		{
			City: "淮安市",
			Name: "淮阴区",
			Id:   "320804000000",
		},
		{
			City: "淮安市",
			Name: "清江浦区",
			Id:   "320812000000",
		},
		{
			City: "淮安市",
			Name: "洪泽区",
			Id:   "320813000000",
		},
		{
			City: "淮安市",
			Name: "涟水县",
			Id:   "320826000000",
		},
		{
			City: "淮安市",
			Name: "盱眙县",
			Id:   "320830000000",
		},
		{
			City: "淮安市",
			Name: "金湖县",
			Id:   "320831000000",
		},
		{
			City: "淮安市",
			Name: "淮安经济技术开发区",
			Id:   "320871000000",
		},
	},
	"320900000000": {
		{
			City: "盐城市",
			Name: "市辖区",
			Id:   "320901000000",
		},
		{
			City: "盐城市",
			Name: "亭湖区",
			Id:   "320902000000",
		},
		{
			City: "盐城市",
			Name: "盐都区",
			Id:   "320903000000",
		},
		{
			City: "盐城市",
			Name: "大丰区",
			Id:   "320904000000",
		},
		{
			City: "盐城市",
			Name: "响水县",
			Id:   "320921000000",
		},
		{
			City: "盐城市",
			Name: "滨海县",
			Id:   "320922000000",
		},
		{
			City: "盐城市",
			Name: "阜宁县",
			Id:   "320923000000",
		},
		{
			City: "盐城市",
			Name: "射阳县",
			Id:   "320924000000",
		},
		{
			City: "盐城市",
			Name: "建湖县",
			Id:   "320925000000",
		},
		{
			City: "盐城市",
			Name: "盐城经济技术开发区",
			Id:   "320971000000",
		},
		{
			City: "盐城市",
			Name: "东台市",
			Id:   "320981000000",
		},
	},
	"321000000000": {
		{
			City: "扬州市",
			Name: "市辖区",
			Id:   "321001000000",
		},
		{
			City: "扬州市",
			Name: "广陵区",
			Id:   "321002000000",
		},
		{
			City: "扬州市",
			Name: "邗江区",
			Id:   "321003000000",
		},
		{
			City: "扬州市",
			Name: "江都区",
			Id:   "321012000000",
		},
		{
			City: "扬州市",
			Name: "宝应县",
			Id:   "321023000000",
		},
		{
			City: "扬州市",
			Name: "扬州经济技术开发区",
			Id:   "321071000000",
		},
		{
			City: "扬州市",
			Name: "仪征市",
			Id:   "321081000000",
		},
		{
			City: "扬州市",
			Name: "高邮市",
			Id:   "321084000000",
		},
	},
	"321100000000": {
		{
			City: "镇江市",
			Name: "市辖区",
			Id:   "321101000000",
		},
		{
			City: "镇江市",
			Name: "京口区",
			Id:   "321102000000",
		},
		{
			City: "镇江市",
			Name: "润州区",
			Id:   "321111000000",
		},
		{
			City: "镇江市",
			Name: "丹徒区",
			Id:   "321112000000",
		},
		{
			City: "镇江市",
			Name: "镇江新区",
			Id:   "321171000000",
		},
		{
			City: "镇江市",
			Name: "丹阳市",
			Id:   "321181000000",
		},
		{
			City: "镇江市",
			Name: "扬中市",
			Id:   "321182000000",
		},
		{
			City: "镇江市",
			Name: "句容市",
			Id:   "321183000000",
		},
	},
	"321200000000": {
		{
			City: "泰州市",
			Name: "市辖区",
			Id:   "321201000000",
		},
		{
			City: "泰州市",
			Name: "海陵区",
			Id:   "321202000000",
		},
		{
			City: "泰州市",
			Name: "高港区",
			Id:   "321203000000",
		},
		{
			City: "泰州市",
			Name: "姜堰区",
			Id:   "321204000000",
		},
		{
			City: "泰州市",
			Name: "泰州医药高新技术产业开发区",
			Id:   "321271000000",
		},
		{
			City: "泰州市",
			Name: "兴化市",
			Id:   "321281000000",
		},
		{
			City: "泰州市",
			Name: "靖江市",
			Id:   "321282000000",
		},
		{
			City: "泰州市",
			Name: "泰兴市",
			Id:   "321283000000",
		},
	},
	"321300000000": {
		{
			City: "宿迁市",
			Name: "市辖区",
			Id:   "321301000000",
		},
		{
			City: "宿迁市",
			Name: "宿城区",
			Id:   "321302000000",
		},
		{
			City: "宿迁市",
			Name: "宿豫区",
			Id:   "321311000000",
		},
		{
			City: "宿迁市",
			Name: "沭阳县",
			Id:   "321322000000",
		},
		{
			City: "宿迁市",
			Name: "泗阳县",
			Id:   "321323000000",
		},
		{
			City: "宿迁市",
			Name: "泗洪县",
			Id:   "321324000000",
		},
		{
			City: "宿迁市",
			Name: "宿迁经济技术开发区",
			Id:   "321371000000",
		},
	},
	"330100000000": {
		{
			City: "杭州市",
			Name: "市辖区",
			Id:   "330101000000",
		},
		{
			City: "杭州市",
			Name: "上城区",
			Id:   "330102000000",
		},
		{
			City: "杭州市",
			Name: "下城区",
			Id:   "330103000000",
		},
		{
			City: "杭州市",
			Name: "江干区",
			Id:   "330104000000",
		},
		{
			City: "杭州市",
			Name: "拱墅区",
			Id:   "330105000000",
		},
		{
			City: "杭州市",
			Name: "西湖区",
			Id:   "330106000000",
		},
		{
			City: "杭州市",
			Name: "滨江区",
			Id:   "330108000000",
		},
		{
			City: "杭州市",
			Name: "萧山区",
			Id:   "330109000000",
		},
		{
			City: "杭州市",
			Name: "余杭区",
			Id:   "330110000000",
		},
		{
			City: "杭州市",
			Name: "富阳区",
			Id:   "330111000000",
		},
		{
			City: "杭州市",
			Name: "临安区",
			Id:   "330112000000",
		},
		{
			City: "杭州市",
			Name: "桐庐县",
			Id:   "330122000000",
		},
		{
			City: "杭州市",
			Name: "淳安县",
			Id:   "330127000000",
		},
		{
			City: "杭州市",
			Name: "建德市",
			Id:   "330182000000",
		},
	},
	"330200000000": {
		{
			City: "宁波市",
			Name: "市辖区",
			Id:   "330201000000",
		},
		{
			City: "宁波市",
			Name: "海曙区",
			Id:   "330203000000",
		},
		{
			City: "宁波市",
			Name: "江北区",
			Id:   "330205000000",
		},
		{
			City: "宁波市",
			Name: "北仑区",
			Id:   "330206000000",
		},
		{
			City: "宁波市",
			Name: "镇海区",
			Id:   "330211000000",
		},
		{
			City: "宁波市",
			Name: "鄞州区",
			Id:   "330212000000",
		},
		{
			City: "宁波市",
			Name: "奉化区",
			Id:   "330213000000",
		},
		{
			City: "宁波市",
			Name: "象山县",
			Id:   "330225000000",
		},
		{
			City: "宁波市",
			Name: "宁海县",
			Id:   "330226000000",
		},
		{
			City: "宁波市",
			Name: "余姚市",
			Id:   "330281000000",
		},
		{
			City: "宁波市",
			Name: "慈溪市",
			Id:   "330282000000",
		},
	},
	"330300000000": {
		{
			City: "温州市",
			Name: "市辖区",
			Id:   "330301000000",
		},
		{
			City: "温州市",
			Name: "鹿城区",
			Id:   "330302000000",
		},
		{
			City: "温州市",
			Name: "龙湾区",
			Id:   "330303000000",
		},
		{
			City: "温州市",
			Name: "瓯海区",
			Id:   "330304000000",
		},
		{
			City: "温州市",
			Name: "洞头区",
			Id:   "330305000000",
		},
		{
			City: "温州市",
			Name: "永嘉县",
			Id:   "330324000000",
		},
		{
			City: "温州市",
			Name: "平阳县",
			Id:   "330326000000",
		},
		{
			City: "温州市",
			Name: "苍南县",
			Id:   "330327000000",
		},
		{
			City: "温州市",
			Name: "文成县",
			Id:   "330328000000",
		},
		{
			City: "温州市",
			Name: "泰顺县",
			Id:   "330329000000",
		},
		{
			City: "温州市",
			Name: "温州经济技术开发区",
			Id:   "330371000000",
		},
		{
			City: "温州市",
			Name: "瑞安市",
			Id:   "330381000000",
		},
		{
			City: "温州市",
			Name: "乐清市",
			Id:   "330382000000",
		},
		{
			City: "温州市",
			Name: "龙港市",
			Id:   "330383000000",
		},
	},
	"330400000000": {
		{
			City: "嘉兴市",
			Name: "市辖区",
			Id:   "330401000000",
		},
		{
			City: "嘉兴市",
			Name: "南湖区",
			Id:   "330402000000",
		},
		{
			City: "嘉兴市",
			Name: "秀洲区",
			Id:   "330411000000",
		},
		{
			City: "嘉兴市",
			Name: "嘉善县",
			Id:   "330421000000",
		},
		{
			City: "嘉兴市",
			Name: "海盐县",
			Id:   "330424000000",
		},
		{
			City: "嘉兴市",
			Name: "海宁市",
			Id:   "330481000000",
		},
		{
			City: "嘉兴市",
			Name: "平湖市",
			Id:   "330482000000",
		},
		{
			City: "嘉兴市",
			Name: "桐乡市",
			Id:   "330483000000",
		},
	},
	"330500000000": {
		{
			City: "湖州市",
			Name: "市辖区",
			Id:   "330501000000",
		},
		{
			City: "湖州市",
			Name: "吴兴区",
			Id:   "330502000000",
		},
		{
			City: "湖州市",
			Name: "南浔区",
			Id:   "330503000000",
		},
		{
			City: "湖州市",
			Name: "德清县",
			Id:   "330521000000",
		},
		{
			City: "湖州市",
			Name: "长兴县",
			Id:   "330522000000",
		},
		{
			City: "湖州市",
			Name: "安吉县",
			Id:   "330523000000",
		},
	},
	"330600000000": {
		{
			City: "绍兴市",
			Name: "市辖区",
			Id:   "330601000000",
		},
		{
			City: "绍兴市",
			Name: "越城区",
			Id:   "330602000000",
		},
		{
			City: "绍兴市",
			Name: "柯桥区",
			Id:   "330603000000",
		},
		{
			City: "绍兴市",
			Name: "上虞区",
			Id:   "330604000000",
		},
		{
			City: "绍兴市",
			Name: "新昌县",
			Id:   "330624000000",
		},
		{
			City: "绍兴市",
			Name: "诸暨市",
			Id:   "330681000000",
		},
		{
			City: "绍兴市",
			Name: "嵊州市",
			Id:   "330683000000",
		},
	},
	"330700000000": {
		{
			City: "金华市",
			Name: "市辖区",
			Id:   "330701000000",
		},
		{
			City: "金华市",
			Name: "婺城区",
			Id:   "330702000000",
		},
		{
			City: "金华市",
			Name: "金东区",
			Id:   "330703000000",
		},
		{
			City: "金华市",
			Name: "武义县",
			Id:   "330723000000",
		},
		{
			City: "金华市",
			Name: "浦江县",
			Id:   "330726000000",
		},
		{
			City: "金华市",
			Name: "磐安县",
			Id:   "330727000000",
		},
		{
			City: "金华市",
			Name: "兰溪市",
			Id:   "330781000000",
		},
		{
			City: "金华市",
			Name: "义乌市",
			Id:   "330782000000",
		},
		{
			City: "金华市",
			Name: "东阳市",
			Id:   "330783000000",
		},
		{
			City: "金华市",
			Name: "永康市",
			Id:   "330784000000",
		},
	},
	"330800000000": {
		{
			City: "衢州市",
			Name: "市辖区",
			Id:   "330801000000",
		},
		{
			City: "衢州市",
			Name: "柯城区",
			Id:   "330802000000",
		},
		{
			City: "衢州市",
			Name: "衢江区",
			Id:   "330803000000",
		},
		{
			City: "衢州市",
			Name: "常山县",
			Id:   "330822000000",
		},
		{
			City: "衢州市",
			Name: "开化县",
			Id:   "330824000000",
		},
		{
			City: "衢州市",
			Name: "龙游县",
			Id:   "330825000000",
		},
		{
			City: "衢州市",
			Name: "江山市",
			Id:   "330881000000",
		},
	},
	"330900000000": {
		{
			City: "舟山市",
			Name: "市辖区",
			Id:   "330901000000",
		},
		{
			City: "舟山市",
			Name: "定海区",
			Id:   "330902000000",
		},
		{
			City: "舟山市",
			Name: "普陀区",
			Id:   "330903000000",
		},
		{
			City: "舟山市",
			Name: "岱山县",
			Id:   "330921000000",
		},
		{
			City: "舟山市",
			Name: "嵊泗县",
			Id:   "330922000000",
		},
	},
	"331000000000": {
		{
			City: "台州市",
			Name: "市辖区",
			Id:   "331001000000",
		},
		{
			City: "台州市",
			Name: "椒江区",
			Id:   "331002000000",
		},
		{
			City: "台州市",
			Name: "黄岩区",
			Id:   "331003000000",
		},
		{
			City: "台州市",
			Name: "路桥区",
			Id:   "331004000000",
		},
		{
			City: "台州市",
			Name: "三门县",
			Id:   "331022000000",
		},
		{
			City: "台州市",
			Name: "天台县",
			Id:   "331023000000",
		},
		{
			City: "台州市",
			Name: "仙居县",
			Id:   "331024000000",
		},
		{
			City: "台州市",
			Name: "温岭市",
			Id:   "331081000000",
		},
		{
			City: "台州市",
			Name: "临海市",
			Id:   "331082000000",
		},
		{
			City: "台州市",
			Name: "玉环市",
			Id:   "331083000000",
		},
	},
	"331100000000": {
		{
			City: "丽水市",
			Name: "市辖区",
			Id:   "331101000000",
		},
		{
			City: "丽水市",
			Name: "莲都区",
			Id:   "331102000000",
		},
		{
			City: "丽水市",
			Name: "青田县",
			Id:   "331121000000",
		},
		{
			City: "丽水市",
			Name: "缙云县",
			Id:   "331122000000",
		},
		{
			City: "丽水市",
			Name: "遂昌县",
			Id:   "331123000000",
		},
		{
			City: "丽水市",
			Name: "松阳县",
			Id:   "331124000000",
		},
		{
			City: "丽水市",
			Name: "云和县",
			Id:   "331125000000",
		},
		{
			City: "丽水市",
			Name: "庆元县",
			Id:   "331126000000",
		},
		{
			City: "丽水市",
			Name: "景宁畲族自治县",
			Id:   "331127000000",
		},
		{
			City: "丽水市",
			Name: "龙泉市",
			Id:   "331181000000",
		},
	},
	"340100000000": {
		{
			City: "合肥市",
			Name: "市辖区",
			Id:   "340101000000",
		},
		{
			City: "合肥市",
			Name: "瑶海区",
			Id:   "340102000000",
		},
		{
			City: "合肥市",
			Name: "庐阳区",
			Id:   "340103000000",
		},
		{
			City: "合肥市",
			Name: "蜀山区",
			Id:   "340104000000",
		},
		{
			City: "合肥市",
			Name: "包河区",
			Id:   "340111000000",
		},
		{
			City: "合肥市",
			Name: "长丰县",
			Id:   "340121000000",
		},
		{
			City: "合肥市",
			Name: "肥东县",
			Id:   "340122000000",
		},
		{
			City: "合肥市",
			Name: "肥西县",
			Id:   "340123000000",
		},
		{
			City: "合肥市",
			Name: "庐江县",
			Id:   "340124000000",
		},
		{
			City: "合肥市",
			Name: "合肥高新技术产业开发区",
			Id:   "340171000000",
		},
		{
			City: "合肥市",
			Name: "合肥经济技术开发区",
			Id:   "340172000000",
		},
		{
			City: "合肥市",
			Name: "合肥新站高新技术产业开发区",
			Id:   "340173000000",
		},
		{
			City: "合肥市",
			Name: "巢湖市",
			Id:   "340181000000",
		},
	},
	"340200000000": {
		{
			City: "芜湖市",
			Name: "市辖区",
			Id:   "340201000000",
		},
		{
			City: "芜湖市",
			Name: "镜湖区",
			Id:   "340202000000",
		},
		{
			City: "芜湖市",
			Name: "弋江区",
			Id:   "340203000000",
		},
		{
			City: "芜湖市",
			Name: "鸠江区",
			Id:   "340207000000",
		},
		{
			City: "芜湖市",
			Name: "三山区",
			Id:   "340208000000",
		},
		{
			City: "芜湖市",
			Name: "芜湖县",
			Id:   "340221000000",
		},
		{
			City: "芜湖市",
			Name: "繁昌县",
			Id:   "340222000000",
		},
		{
			City: "芜湖市",
			Name: "南陵县",
			Id:   "340223000000",
		},
		{
			City: "芜湖市",
			Name: "芜湖经济技术开发区",
			Id:   "340271000000",
		},
		{
			City: "芜湖市",
			Name: "安徽芜湖长江大桥经济开发区",
			Id:   "340272000000",
		},
		{
			City: "芜湖市",
			Name: "无为市",
			Id:   "340281000000",
		},
	},
	"340300000000": {
		{
			City: "蚌埠市",
			Name: "市辖区",
			Id:   "340301000000",
		},
		{
			City: "蚌埠市",
			Name: "龙子湖区",
			Id:   "340302000000",
		},
		{
			City: "蚌埠市",
			Name: "蚌山区",
			Id:   "340303000000",
		},
		{
			City: "蚌埠市",
			Name: "禹会区",
			Id:   "340304000000",
		},
		{
			City: "蚌埠市",
			Name: "淮上区",
			Id:   "340311000000",
		},
		{
			City: "蚌埠市",
			Name: "怀远县",
			Id:   "340321000000",
		},
		{
			City: "蚌埠市",
			Name: "五河县",
			Id:   "340322000000",
		},
		{
			City: "蚌埠市",
			Name: "固镇县",
			Id:   "340323000000",
		},
		{
			City: "蚌埠市",
			Name: "蚌埠市高新技术开发区",
			Id:   "340371000000",
		},
		{
			City: "蚌埠市",
			Name: "蚌埠市经济开发区",
			Id:   "340372000000",
		},
	},
	"340400000000": {
		{
			City: "淮南市",
			Name: "市辖区",
			Id:   "340401000000",
		},
		{
			City: "淮南市",
			Name: "大通区",
			Id:   "340402000000",
		},
		{
			City: "淮南市",
			Name: "田家庵区",
			Id:   "340403000000",
		},
		{
			City: "淮南市",
			Name: "谢家集区",
			Id:   "340404000000",
		},
		{
			City: "淮南市",
			Name: "八公山区",
			Id:   "340405000000",
		},
		{
			City: "淮南市",
			Name: "潘集区",
			Id:   "340406000000",
		},
		{
			City: "淮南市",
			Name: "凤台县",
			Id:   "340421000000",
		},
		{
			City: "淮南市",
			Name: "寿县",
			Id:   "340422000000",
		},
	},
	"340500000000": {
		{
			City: "马鞍山市",
			Name: "市辖区",
			Id:   "340501000000",
		},
		{
			City: "马鞍山市",
			Name: "花山区",
			Id:   "340503000000",
		},
		{
			City: "马鞍山市",
			Name: "雨山区",
			Id:   "340504000000",
		},
		{
			City: "马鞍山市",
			Name: "博望区",
			Id:   "340506000000",
		},
		{
			City: "马鞍山市",
			Name: "当涂县",
			Id:   "340521000000",
		},
		{
			City: "马鞍山市",
			Name: "含山县",
			Id:   "340522000000",
		},
		{
			City: "马鞍山市",
			Name: "和县",
			Id:   "340523000000",
		},
	},
	"340600000000": {
		{
			City: "淮北市",
			Name: "市辖区",
			Id:   "340601000000",
		},
		{
			City: "淮北市",
			Name: "杜集区",
			Id:   "340602000000",
		},
		{
			City: "淮北市",
			Name: "相山区",
			Id:   "340603000000",
		},
		{
			City: "淮北市",
			Name: "烈山区",
			Id:   "340604000000",
		},
		{
			City: "淮北市",
			Name: "濉溪县",
			Id:   "340621000000",
		},
	},
	"340700000000": {
		{
			City: "铜陵市",
			Name: "市辖区",
			Id:   "340701000000",
		},
		{
			City: "铜陵市",
			Name: "铜官区",
			Id:   "340705000000",
		},
		{
			City: "铜陵市",
			Name: "义安区",
			Id:   "340706000000",
		},
		{
			City: "铜陵市",
			Name: "郊区",
			Id:   "340711000000",
		},
		{
			City: "铜陵市",
			Name: "枞阳县",
			Id:   "340722000000",
		},
	},
	"340800000000": {
		{
			City: "安庆市",
			Name: "市辖区",
			Id:   "340801000000",
		},
		{
			City: "安庆市",
			Name: "迎江区",
			Id:   "340802000000",
		},
		{
			City: "安庆市",
			Name: "大观区",
			Id:   "340803000000",
		},
		{
			City: "安庆市",
			Name: "宜秀区",
			Id:   "340811000000",
		},
		{
			City: "安庆市",
			Name: "怀宁县",
			Id:   "340822000000",
		},
		{
			City: "安庆市",
			Name: "太湖县",
			Id:   "340825000000",
		},
		{
			City: "安庆市",
			Name: "宿松县",
			Id:   "340826000000",
		},
		{
			City: "安庆市",
			Name: "望江县",
			Id:   "340827000000",
		},
		{
			City: "安庆市",
			Name: "岳西县",
			Id:   "340828000000",
		},
		{
			City: "安庆市",
			Name: "安徽安庆经济开发区",
			Id:   "340871000000",
		},
		{
			City: "安庆市",
			Name: "桐城市",
			Id:   "340881000000",
		},
		{
			City: "安庆市",
			Name: "潜山市",
			Id:   "340882000000",
		},
	},
	"341000000000": {
		{
			City: "黄山市",
			Name: "市辖区",
			Id:   "341001000000",
		},
		{
			City: "黄山市",
			Name: "屯溪区",
			Id:   "341002000000",
		},
		{
			City: "黄山市",
			Name: "黄山区",
			Id:   "341003000000",
		},
		{
			City: "黄山市",
			Name: "徽州区",
			Id:   "341004000000",
		},
		{
			City: "黄山市",
			Name: "歙县",
			Id:   "341021000000",
		},
		{
			City: "黄山市",
			Name: "休宁县",
			Id:   "341022000000",
		},
		{
			City: "黄山市",
			Name: "黟县",
			Id:   "341023000000",
		},
		{
			City: "黄山市",
			Name: "祁门县",
			Id:   "341024000000",
		},
	},
	"341100000000": {
		{
			City: "滁州市",
			Name: "市辖区",
			Id:   "341101000000",
		},
		{
			City: "滁州市",
			Name: "琅琊区",
			Id:   "341102000000",
		},
		{
			City: "滁州市",
			Name: "南谯区",
			Id:   "341103000000",
		},
		{
			City: "滁州市",
			Name: "来安县",
			Id:   "341122000000",
		},
		{
			City: "滁州市",
			Name: "全椒县",
			Id:   "341124000000",
		},
		{
			City: "滁州市",
			Name: "定远县",
			Id:   "341125000000",
		},
		{
			City: "滁州市",
			Name: "凤阳县",
			Id:   "341126000000",
		},
		{
			City: "滁州市",
			Name: "苏滁现代产业园",
			Id:   "341171000000",
		},
		{
			City: "滁州市",
			Name: "滁州经济技术开发区",
			Id:   "341172000000",
		},
		{
			City: "滁州市",
			Name: "天长市",
			Id:   "341181000000",
		},
		{
			City: "滁州市",
			Name: "明光市",
			Id:   "341182000000",
		},
	},
	"341200000000": {
		{
			City: "阜阳市",
			Name: "市辖区",
			Id:   "341201000000",
		},
		{
			City: "阜阳市",
			Name: "颍州区",
			Id:   "341202000000",
		},
		{
			City: "阜阳市",
			Name: "颍东区",
			Id:   "341203000000",
		},
		{
			City: "阜阳市",
			Name: "颍泉区",
			Id:   "341204000000",
		},
		{
			City: "阜阳市",
			Name: "临泉县",
			Id:   "341221000000",
		},
		{
			City: "阜阳市",
			Name: "太和县",
			Id:   "341222000000",
		},
		{
			City: "阜阳市",
			Name: "阜南县",
			Id:   "341225000000",
		},
		{
			City: "阜阳市",
			Name: "颍上县",
			Id:   "341226000000",
		},
		{
			City: "阜阳市",
			Name: "阜阳合肥现代产业园区",
			Id:   "341271000000",
		},
		{
			City: "阜阳市",
			Name: "阜阳经济技术开发区",
			Id:   "341272000000",
		},
		{
			City: "阜阳市",
			Name: "界首市",
			Id:   "341282000000",
		},
	},
	"341300000000": {
		{
			City: "宿州市",
			Name: "市辖区",
			Id:   "341301000000",
		},
		{
			City: "宿州市",
			Name: "埇桥区",
			Id:   "341302000000",
		},
		{
			City: "宿州市",
			Name: "砀山县",
			Id:   "341321000000",
		},
		{
			City: "宿州市",
			Name: "萧县",
			Id:   "341322000000",
		},
		{
			City: "宿州市",
			Name: "灵璧县",
			Id:   "341323000000",
		},
		{
			City: "宿州市",
			Name: "泗县",
			Id:   "341324000000",
		},
		{
			City: "宿州市",
			Name: "宿州马鞍山现代产业园区",
			Id:   "341371000000",
		},
		{
			City: "宿州市",
			Name: "宿州经济技术开发区",
			Id:   "341372000000",
		},
	},
	"341500000000": {
		{
			City: "六安市",
			Name: "市辖区",
			Id:   "341501000000",
		},
		{
			City: "六安市",
			Name: "金安区",
			Id:   "341502000000",
		},
		{
			City: "六安市",
			Name: "裕安区",
			Id:   "341503000000",
		},
		{
			City: "六安市",
			Name: "叶集区",
			Id:   "341504000000",
		},
		{
			City: "六安市",
			Name: "霍邱县",
			Id:   "341522000000",
		},
		{
			City: "六安市",
			Name: "舒城县",
			Id:   "341523000000",
		},
		{
			City: "六安市",
			Name: "金寨县",
			Id:   "341524000000",
		},
		{
			City: "六安市",
			Name: "霍山县",
			Id:   "341525000000",
		},
	},
	"341600000000": {
		{
			City: "亳州市",
			Name: "市辖区",
			Id:   "341601000000",
		},
		{
			City: "亳州市",
			Name: "谯城区",
			Id:   "341602000000",
		},
		{
			City: "亳州市",
			Name: "涡阳县",
			Id:   "341621000000",
		},
		{
			City: "亳州市",
			Name: "蒙城县",
			Id:   "341622000000",
		},
		{
			City: "亳州市",
			Name: "利辛县",
			Id:   "341623000000",
		},
	},
	"341700000000": {
		{
			City: "池州市",
			Name: "市辖区",
			Id:   "341701000000",
		},
		{
			City: "池州市",
			Name: "贵池区",
			Id:   "341702000000",
		},
		{
			City: "池州市",
			Name: "东至县",
			Id:   "341721000000",
		},
		{
			City: "池州市",
			Name: "石台县",
			Id:   "341722000000",
		},
		{
			City: "池州市",
			Name: "青阳县",
			Id:   "341723000000",
		},
	},
	"341800000000": {
		{
			City: "宣城市",
			Name: "市辖区",
			Id:   "341801000000",
		},
		{
			City: "宣城市",
			Name: "宣州区",
			Id:   "341802000000",
		},
		{
			City: "宣城市",
			Name: "郎溪县",
			Id:   "341821000000",
		},
		{
			City: "宣城市",
			Name: "泾县",
			Id:   "341823000000",
		},
		{
			City: "宣城市",
			Name: "绩溪县",
			Id:   "341824000000",
		},
		{
			City: "宣城市",
			Name: "旌德县",
			Id:   "341825000000",
		},
		{
			City: "宣城市",
			Name: "宣城市经济开发区",
			Id:   "341871000000",
		},
		{
			City: "宣城市",
			Name: "宁国市",
			Id:   "341881000000",
		},
		{
			City: "宣城市",
			Name: "广德市",
			Id:   "341882000000",
		},
	},
	"350100000000": {
		{
			City: "福州市",
			Name: "市辖区",
			Id:   "350101000000",
		},
		{
			City: "福州市",
			Name: "鼓楼区",
			Id:   "350102000000",
		},
		{
			City: "福州市",
			Name: "台江区",
			Id:   "350103000000",
		},
		{
			City: "福州市",
			Name: "仓山区",
			Id:   "350104000000",
		},
		{
			City: "福州市",
			Name: "马尾区",
			Id:   "350105000000",
		},
		{
			City: "福州市",
			Name: "晋安区",
			Id:   "350111000000",
		},
		{
			City: "福州市",
			Name: "长乐区",
			Id:   "350112000000",
		},
		{
			City: "福州市",
			Name: "闽侯县",
			Id:   "350121000000",
		},
		{
			City: "福州市",
			Name: "连江县",
			Id:   "350122000000",
		},
		{
			City: "福州市",
			Name: "罗源县",
			Id:   "350123000000",
		},
		{
			City: "福州市",
			Name: "闽清县",
			Id:   "350124000000",
		},
		{
			City: "福州市",
			Name: "永泰县",
			Id:   "350125000000",
		},
		{
			City: "福州市",
			Name: "平潭县",
			Id:   "350128000000",
		},
		{
			City: "福州市",
			Name: "福清市",
			Id:   "350181000000",
		},
	},
	"350200000000": {
		{
			City: "厦门市",
			Name: "市辖区",
			Id:   "350201000000",
		},
		{
			City: "厦门市",
			Name: "思明区",
			Id:   "350203000000",
		},
		{
			City: "厦门市",
			Name: "海沧区",
			Id:   "350205000000",
		},
		{
			City: "厦门市",
			Name: "湖里区",
			Id:   "350206000000",
		},
		{
			City: "厦门市",
			Name: "集美区",
			Id:   "350211000000",
		},
		{
			City: "厦门市",
			Name: "同安区",
			Id:   "350212000000",
		},
		{
			City: "厦门市",
			Name: "翔安区",
			Id:   "350213000000",
		},
	},
	"350300000000": {
		{
			City: "莆田市",
			Name: "市辖区",
			Id:   "350301000000",
		},
		{
			City: "莆田市",
			Name: "城厢区",
			Id:   "350302000000",
		},
		{
			City: "莆田市",
			Name: "涵江区",
			Id:   "350303000000",
		},
		{
			City: "莆田市",
			Name: "荔城区",
			Id:   "350304000000",
		},
		{
			City: "莆田市",
			Name: "秀屿区",
			Id:   "350305000000",
		},
		{
			City: "莆田市",
			Name: "仙游县",
			Id:   "350322000000",
		},
	},
	"350400000000": {
		{
			City: "三明市",
			Name: "市辖区",
			Id:   "350401000000",
		},
		{
			City: "三明市",
			Name: "梅列区",
			Id:   "350402000000",
		},
		{
			City: "三明市",
			Name: "三元区",
			Id:   "350403000000",
		},
		{
			City: "三明市",
			Name: "明溪县",
			Id:   "350421000000",
		},
		{
			City: "三明市",
			Name: "清流县",
			Id:   "350423000000",
		},
		{
			City: "三明市",
			Name: "宁化县",
			Id:   "350424000000",
		},
		{
			City: "三明市",
			Name: "大田县",
			Id:   "350425000000",
		},
		{
			City: "三明市",
			Name: "尤溪县",
			Id:   "350426000000",
		},
		{
			City: "三明市",
			Name: "沙县",
			Id:   "350427000000",
		},
		{
			City: "三明市",
			Name: "将乐县",
			Id:   "350428000000",
		},
		{
			City: "三明市",
			Name: "泰宁县",
			Id:   "350429000000",
		},
		{
			City: "三明市",
			Name: "建宁县",
			Id:   "350430000000",
		},
		{
			City: "三明市",
			Name: "永安市",
			Id:   "350481000000",
		},
	},
	"350500000000": {
		{
			City: "泉州市",
			Name: "市辖区",
			Id:   "350501000000",
		},
		{
			City: "泉州市",
			Name: "鲤城区",
			Id:   "350502000000",
		},
		{
			City: "泉州市",
			Name: "丰泽区",
			Id:   "350503000000",
		},
		{
			City: "泉州市",
			Name: "洛江区",
			Id:   "350504000000",
		},
		{
			City: "泉州市",
			Name: "泉港区",
			Id:   "350505000000",
		},
		{
			City: "泉州市",
			Name: "惠安县",
			Id:   "350521000000",
		},
		{
			City: "泉州市",
			Name: "安溪县",
			Id:   "350524000000",
		},
		{
			City: "泉州市",
			Name: "永春县",
			Id:   "350525000000",
		},
		{
			City: "泉州市",
			Name: "德化县",
			Id:   "350526000000",
		},
		{
			City: "泉州市",
			Name: "金门县",
			Id:   "350527000000",
		},
		{
			City: "泉州市",
			Name: "石狮市",
			Id:   "350581000000",
		},
		{
			City: "泉州市",
			Name: "晋江市",
			Id:   "350582000000",
		},
		{
			City: "泉州市",
			Name: "南安市",
			Id:   "350583000000",
		},
	},
	"350600000000": {
		{
			City: "漳州市",
			Name: "市辖区",
			Id:   "350601000000",
		},
		{
			City: "漳州市",
			Name: "芗城区",
			Id:   "350602000000",
		},
		{
			City: "漳州市",
			Name: "龙文区",
			Id:   "350603000000",
		},
		{
			City: "漳州市",
			Name: "云霄县",
			Id:   "350622000000",
		},
		{
			City: "漳州市",
			Name: "漳浦县",
			Id:   "350623000000",
		},
		{
			City: "漳州市",
			Name: "诏安县",
			Id:   "350624000000",
		},
		{
			City: "漳州市",
			Name: "长泰县",
			Id:   "350625000000",
		},
		{
			City: "漳州市",
			Name: "东山县",
			Id:   "350626000000",
		},
		{
			City: "漳州市",
			Name: "南靖县",
			Id:   "350627000000",
		},
		{
			City: "漳州市",
			Name: "平和县",
			Id:   "350628000000",
		},
		{
			City: "漳州市",
			Name: "华安县",
			Id:   "350629000000",
		},
		{
			City: "漳州市",
			Name: "龙海市",
			Id:   "350681000000",
		},
	},
	"350700000000": {
		{
			City: "南平市",
			Name: "市辖区",
			Id:   "350701000000",
		},
		{
			City: "南平市",
			Name: "延平区",
			Id:   "350702000000",
		},
		{
			City: "南平市",
			Name: "建阳区",
			Id:   "350703000000",
		},
		{
			City: "南平市",
			Name: "顺昌县",
			Id:   "350721000000",
		},
		{
			City: "南平市",
			Name: "浦城县",
			Id:   "350722000000",
		},
		{
			City: "南平市",
			Name: "光泽县",
			Id:   "350723000000",
		},
		{
			City: "南平市",
			Name: "松溪县",
			Id:   "350724000000",
		},
		{
			City: "南平市",
			Name: "政和县",
			Id:   "350725000000",
		},
		{
			City: "南平市",
			Name: "邵武市",
			Id:   "350781000000",
		},
		{
			City: "南平市",
			Name: "武夷山市",
			Id:   "350782000000",
		},
		{
			City: "南平市",
			Name: "建瓯市",
			Id:   "350783000000",
		},
	},
	"350800000000": {
		{
			City: "龙岩市",
			Name: "市辖区",
			Id:   "350801000000",
		},
		{
			City: "龙岩市",
			Name: "新罗区",
			Id:   "350802000000",
		},
		{
			City: "龙岩市",
			Name: "永定区",
			Id:   "350803000000",
		},
		{
			City: "龙岩市",
			Name: "长汀县",
			Id:   "350821000000",
		},
		{
			City: "龙岩市",
			Name: "上杭县",
			Id:   "350823000000",
		},
		{
			City: "龙岩市",
			Name: "武平县",
			Id:   "350824000000",
		},
		{
			City: "龙岩市",
			Name: "连城县",
			Id:   "350825000000",
		},
		{
			City: "龙岩市",
			Name: "漳平市",
			Id:   "350881000000",
		},
	},
	"350900000000": {
		{
			City: "宁德市",
			Name: "市辖区",
			Id:   "350901000000",
		},
		{
			City: "宁德市",
			Name: "蕉城区",
			Id:   "350902000000",
		},
		{
			City: "宁德市",
			Name: "霞浦县",
			Id:   "350921000000",
		},
		{
			City: "宁德市",
			Name: "古田县",
			Id:   "350922000000",
		},
		{
			City: "宁德市",
			Name: "屏南县",
			Id:   "350923000000",
		},
		{
			City: "宁德市",
			Name: "寿宁县",
			Id:   "350924000000",
		},
		{
			City: "宁德市",
			Name: "周宁县",
			Id:   "350925000000",
		},
		{
			City: "宁德市",
			Name: "柘荣县",
			Id:   "350926000000",
		},
		{
			City: "宁德市",
			Name: "福安市",
			Id:   "350981000000",
		},
		{
			City: "宁德市",
			Name: "福鼎市",
			Id:   "350982000000",
		},
	},
	"360100000000": {
		{
			City: "南昌市",
			Name: "市辖区",
			Id:   "360101000000",
		},
		{
			City: "南昌市",
			Name: "东湖区",
			Id:   "360102000000",
		},
		{
			City: "南昌市",
			Name: "西湖区",
			Id:   "360103000000",
		},
		{
			City: "南昌市",
			Name: "青云谱区",
			Id:   "360104000000",
		},
		{
			City: "南昌市",
			Name: "青山湖区",
			Id:   "360111000000",
		},
		{
			City: "南昌市",
			Name: "新建区",
			Id:   "360112000000",
		},
		{
			City: "南昌市",
			Name: "红谷滩区",
			Id:   "360113000000",
		},
		{
			City: "南昌市",
			Name: "南昌县",
			Id:   "360121000000",
		},
		{
			City: "南昌市",
			Name: "安义县",
			Id:   "360123000000",
		},
		{
			City: "南昌市",
			Name: "进贤县",
			Id:   "360124000000",
		},
	},
	"360200000000": {
		{
			City: "景德镇市",
			Name: "市辖区",
			Id:   "360201000000",
		},
		{
			City: "景德镇市",
			Name: "昌江区",
			Id:   "360202000000",
		},
		{
			City: "景德镇市",
			Name: "珠山区",
			Id:   "360203000000",
		},
		{
			City: "景德镇市",
			Name: "浮梁县",
			Id:   "360222000000",
		},
		{
			City: "景德镇市",
			Name: "乐平市",
			Id:   "360281000000",
		},
	},
	"360300000000": {
		{
			City: "萍乡市",
			Name: "市辖区",
			Id:   "360301000000",
		},
		{
			City: "萍乡市",
			Name: "安源区",
			Id:   "360302000000",
		},
		{
			City: "萍乡市",
			Name: "湘东区",
			Id:   "360313000000",
		},
		{
			City: "萍乡市",
			Name: "莲花县",
			Id:   "360321000000",
		},
		{
			City: "萍乡市",
			Name: "上栗县",
			Id:   "360322000000",
		},
		{
			City: "萍乡市",
			Name: "芦溪县",
			Id:   "360323000000",
		},
	},
	"360400000000": {
		{
			City: "九江市",
			Name: "市辖区",
			Id:   "360401000000",
		},
		{
			City: "九江市",
			Name: "濂溪区",
			Id:   "360402000000",
		},
		{
			City: "九江市",
			Name: "浔阳区",
			Id:   "360403000000",
		},
		{
			City: "九江市",
			Name: "柴桑区",
			Id:   "360404000000",
		},
		{
			City: "九江市",
			Name: "武宁县",
			Id:   "360423000000",
		},
		{
			City: "九江市",
			Name: "修水县",
			Id:   "360424000000",
		},
		{
			City: "九江市",
			Name: "永修县",
			Id:   "360425000000",
		},
		{
			City: "九江市",
			Name: "德安县",
			Id:   "360426000000",
		},
		{
			City: "九江市",
			Name: "都昌县",
			Id:   "360428000000",
		},
		{
			City: "九江市",
			Name: "湖口县",
			Id:   "360429000000",
		},
		{
			City: "九江市",
			Name: "彭泽县",
			Id:   "360430000000",
		},
		{
			City: "九江市",
			Name: "瑞昌市",
			Id:   "360481000000",
		},
		{
			City: "九江市",
			Name: "共青城市",
			Id:   "360482000000",
		},
		{
			City: "九江市",
			Name: "庐山市",
			Id:   "360483000000",
		},
	},
	"360500000000": {
		{
			City: "新余市",
			Name: "市辖区",
			Id:   "360501000000",
		},
		{
			City: "新余市",
			Name: "渝水区",
			Id:   "360502000000",
		},
		{
			City: "新余市",
			Name: "分宜县",
			Id:   "360521000000",
		},
	},
	"360600000000": {
		{
			City: "鹰潭市",
			Name: "市辖区",
			Id:   "360601000000",
		},
		{
			City: "鹰潭市",
			Name: "月湖区",
			Id:   "360602000000",
		},
		{
			City: "鹰潭市",
			Name: "余江区",
			Id:   "360603000000",
		},
		{
			City: "鹰潭市",
			Name: "贵溪市",
			Id:   "360681000000",
		},
	},
	"360700000000": {
		{
			City: "赣州市",
			Name: "市辖区",
			Id:   "360701000000",
		},
		{
			City: "赣州市",
			Name: "章贡区",
			Id:   "360702000000",
		},
		{
			City: "赣州市",
			Name: "南康区",
			Id:   "360703000000",
		},
		{
			City: "赣州市",
			Name: "赣县区",
			Id:   "360704000000",
		},
		{
			City: "赣州市",
			Name: "信丰县",
			Id:   "360722000000",
		},
		{
			City: "赣州市",
			Name: "大余县",
			Id:   "360723000000",
		},
		{
			City: "赣州市",
			Name: "上犹县",
			Id:   "360724000000",
		},
		{
			City: "赣州市",
			Name: "崇义县",
			Id:   "360725000000",
		},
		{
			City: "赣州市",
			Name: "安远县",
			Id:   "360726000000",
		},
		{
			City: "赣州市",
			Name: "定南县",
			Id:   "360728000000",
		},
		{
			City: "赣州市",
			Name: "全南县",
			Id:   "360729000000",
		},
		{
			City: "赣州市",
			Name: "宁都县",
			Id:   "360730000000",
		},
		{
			City: "赣州市",
			Name: "于都县",
			Id:   "360731000000",
		},
		{
			City: "赣州市",
			Name: "兴国县",
			Id:   "360732000000",
		},
		{
			City: "赣州市",
			Name: "会昌县",
			Id:   "360733000000",
		},
		{
			City: "赣州市",
			Name: "寻乌县",
			Id:   "360734000000",
		},
		{
			City: "赣州市",
			Name: "石城县",
			Id:   "360735000000",
		},
		{
			City: "赣州市",
			Name: "瑞金市",
			Id:   "360781000000",
		},
		{
			City: "赣州市",
			Name: "龙南市",
			Id:   "360783000000",
		},
	},
	"360800000000": {
		{
			City: "吉安市",
			Name: "市辖区",
			Id:   "360801000000",
		},
		{
			City: "吉安市",
			Name: "吉州区",
			Id:   "360802000000",
		},
		{
			City: "吉安市",
			Name: "青原区",
			Id:   "360803000000",
		},
		{
			City: "吉安市",
			Name: "吉安县",
			Id:   "360821000000",
		},
		{
			City: "吉安市",
			Name: "吉水县",
			Id:   "360822000000",
		},
		{
			City: "吉安市",
			Name: "峡江县",
			Id:   "360823000000",
		},
		{
			City: "吉安市",
			Name: "新干县",
			Id:   "360824000000",
		},
		{
			City: "吉安市",
			Name: "永丰县",
			Id:   "360825000000",
		},
		{
			City: "吉安市",
			Name: "泰和县",
			Id:   "360826000000",
		},
		{
			City: "吉安市",
			Name: "遂川县",
			Id:   "360827000000",
		},
		{
			City: "吉安市",
			Name: "万安县",
			Id:   "360828000000",
		},
		{
			City: "吉安市",
			Name: "安福县",
			Id:   "360829000000",
		},
		{
			City: "吉安市",
			Name: "永新县",
			Id:   "360830000000",
		},
		{
			City: "吉安市",
			Name: "井冈山市",
			Id:   "360881000000",
		},
	},
	"360900000000": {
		{
			City: "宜春市",
			Name: "市辖区",
			Id:   "360901000000",
		},
		{
			City: "宜春市",
			Name: "袁州区",
			Id:   "360902000000",
		},
		{
			City: "宜春市",
			Name: "奉新县",
			Id:   "360921000000",
		},
		{
			City: "宜春市",
			Name: "万载县",
			Id:   "360922000000",
		},
		{
			City: "宜春市",
			Name: "上高县",
			Id:   "360923000000",
		},
		{
			City: "宜春市",
			Name: "宜丰县",
			Id:   "360924000000",
		},
		{
			City: "宜春市",
			Name: "靖安县",
			Id:   "360925000000",
		},
		{
			City: "宜春市",
			Name: "铜鼓县",
			Id:   "360926000000",
		},
		{
			City: "宜春市",
			Name: "丰城市",
			Id:   "360981000000",
		},
		{
			City: "宜春市",
			Name: "樟树市",
			Id:   "360982000000",
		},
		{
			City: "宜春市",
			Name: "高安市",
			Id:   "360983000000",
		},
	},
	"361000000000": {
		{
			City: "抚州市",
			Name: "市辖区",
			Id:   "361001000000",
		},
		{
			City: "抚州市",
			Name: "临川区",
			Id:   "361002000000",
		},
		{
			City: "抚州市",
			Name: "东乡区",
			Id:   "361003000000",
		},
		{
			City: "抚州市",
			Name: "南城县",
			Id:   "361021000000",
		},
		{
			City: "抚州市",
			Name: "黎川县",
			Id:   "361022000000",
		},
		{
			City: "抚州市",
			Name: "南丰县",
			Id:   "361023000000",
		},
		{
			City: "抚州市",
			Name: "崇仁县",
			Id:   "361024000000",
		},
		{
			City: "抚州市",
			Name: "乐安县",
			Id:   "361025000000",
		},
		{
			City: "抚州市",
			Name: "宜黄县",
			Id:   "361026000000",
		},
		{
			City: "抚州市",
			Name: "金溪县",
			Id:   "361027000000",
		},
		{
			City: "抚州市",
			Name: "资溪县",
			Id:   "361028000000",
		},
		{
			City: "抚州市",
			Name: "广昌县",
			Id:   "361030000000",
		},
	},
	"361100000000": {
		{
			City: "上饶市",
			Name: "市辖区",
			Id:   "361101000000",
		},
		{
			City: "上饶市",
			Name: "信州区",
			Id:   "361102000000",
		},
		{
			City: "上饶市",
			Name: "广丰区",
			Id:   "361103000000",
		},
		{
			City: "上饶市",
			Name: "广信区",
			Id:   "361104000000",
		},
		{
			City: "上饶市",
			Name: "玉山县",
			Id:   "361123000000",
		},
		{
			City: "上饶市",
			Name: "铅山县",
			Id:   "361124000000",
		},
		{
			City: "上饶市",
			Name: "横峰县",
			Id:   "361125000000",
		},
		{
			City: "上饶市",
			Name: "弋阳县",
			Id:   "361126000000",
		},
		{
			City: "上饶市",
			Name: "余干县",
			Id:   "361127000000",
		},
		{
			City: "上饶市",
			Name: "鄱阳县",
			Id:   "361128000000",
		},
		{
			City: "上饶市",
			Name: "万年县",
			Id:   "361129000000",
		},
		{
			City: "上饶市",
			Name: "婺源县",
			Id:   "361130000000",
		},
		{
			City: "上饶市",
			Name: "德兴市",
			Id:   "361181000000",
		},
	},
	"370100000000": {
		{
			City: "济南市",
			Name: "市辖区",
			Id:   "370101000000",
		},
		{
			City: "济南市",
			Name: "历下区",
			Id:   "370102000000",
		},
		{
			City: "济南市",
			Name: "市中区",
			Id:   "370103000000",
		},
		{
			City: "济南市",
			Name: "槐荫区",
			Id:   "370104000000",
		},
		{
			City: "济南市",
			Name: "天桥区",
			Id:   "370105000000",
		},
		{
			City: "济南市",
			Name: "历城区",
			Id:   "370112000000",
		},
		{
			City: "济南市",
			Name: "长清区",
			Id:   "370113000000",
		},
		{
			City: "济南市",
			Name: "章丘区",
			Id:   "370114000000",
		},
		{
			City: "济南市",
			Name: "济阳区",
			Id:   "370115000000",
		},
		{
			City: "济南市",
			Name: "莱芜区",
			Id:   "370116000000",
		},
		{
			City: "济南市",
			Name: "钢城区",
			Id:   "370117000000",
		},
		{
			City: "济南市",
			Name: "平阴县",
			Id:   "370124000000",
		},
		{
			City: "济南市",
			Name: "商河县",
			Id:   "370126000000",
		},
		{
			City: "济南市",
			Name: "济南高新技术产业开发区",
			Id:   "370171000000",
		},
	},
	"370200000000": {
		{
			City: "青岛市",
			Name: "市辖区",
			Id:   "370201000000",
		},
		{
			City: "青岛市",
			Name: "市南区",
			Id:   "370202000000",
		},
		{
			City: "青岛市",
			Name: "市北区",
			Id:   "370203000000",
		},
		{
			City: "青岛市",
			Name: "黄岛区",
			Id:   "370211000000",
		},
		{
			City: "青岛市",
			Name: "崂山区",
			Id:   "370212000000",
		},
		{
			City: "青岛市",
			Name: "李沧区",
			Id:   "370213000000",
		},
		{
			City: "青岛市",
			Name: "城阳区",
			Id:   "370214000000",
		},
		{
			City: "青岛市",
			Name: "即墨区",
			Id:   "370215000000",
		},
		{
			City: "青岛市",
			Name: "青岛高新技术产业开发区",
			Id:   "370271000000",
		},
		{
			City: "青岛市",
			Name: "胶州市",
			Id:   "370281000000",
		},
		{
			City: "青岛市",
			Name: "平度市",
			Id:   "370283000000",
		},
		{
			City: "青岛市",
			Name: "莱西市",
			Id:   "370285000000",
		},
	},
	"370300000000": {
		{
			City: "淄博市",
			Name: "市辖区",
			Id:   "370301000000",
		},
		{
			City: "淄博市",
			Name: "淄川区",
			Id:   "370302000000",
		},
		{
			City: "淄博市",
			Name: "张店区",
			Id:   "370303000000",
		},
		{
			City: "淄博市",
			Name: "博山区",
			Id:   "370304000000",
		},
		{
			City: "淄博市",
			Name: "临淄区",
			Id:   "370305000000",
		},
		{
			City: "淄博市",
			Name: "周村区",
			Id:   "370306000000",
		},
		{
			City: "淄博市",
			Name: "桓台县",
			Id:   "370321000000",
		},
		{
			City: "淄博市",
			Name: "高青县",
			Id:   "370322000000",
		},
		{
			City: "淄博市",
			Name: "沂源县",
			Id:   "370323000000",
		},
	},
	"370400000000": {
		{
			City: "枣庄市",
			Name: "市辖区",
			Id:   "370401000000",
		},
		{
			City: "枣庄市",
			Name: "市中区",
			Id:   "370402000000",
		},
		{
			City: "枣庄市",
			Name: "薛城区",
			Id:   "370403000000",
		},
		{
			City: "枣庄市",
			Name: "峄城区",
			Id:   "370404000000",
		},
		{
			City: "枣庄市",
			Name: "台儿庄区",
			Id:   "370405000000",
		},
		{
			City: "枣庄市",
			Name: "山亭区",
			Id:   "370406000000",
		},
		{
			City: "枣庄市",
			Name: "滕州市",
			Id:   "370481000000",
		},
	},
	"370500000000": {
		{
			City: "东营市",
			Name: "市辖区",
			Id:   "370501000000",
		},
		{
			City: "东营市",
			Name: "东营区",
			Id:   "370502000000",
		},
		{
			City: "东营市",
			Name: "河口区",
			Id:   "370503000000",
		},
		{
			City: "东营市",
			Name: "垦利区",
			Id:   "370505000000",
		},
		{
			City: "东营市",
			Name: "利津县",
			Id:   "370522000000",
		},
		{
			City: "东营市",
			Name: "广饶县",
			Id:   "370523000000",
		},
		{
			City: "东营市",
			Name: "东营经济技术开发区",
			Id:   "370571000000",
		},
		{
			City: "东营市",
			Name: "东营港经济开发区",
			Id:   "370572000000",
		},
	},
	"370600000000": {
		{
			City: "烟台市",
			Name: "市辖区",
			Id:   "370601000000",
		},
		{
			City: "烟台市",
			Name: "芝罘区",
			Id:   "370602000000",
		},
		{
			City: "烟台市",
			Name: "福山区",
			Id:   "370611000000",
		},
		{
			City: "烟台市",
			Name: "牟平区",
			Id:   "370612000000",
		},
		{
			City: "烟台市",
			Name: "莱山区",
			Id:   "370613000000",
		},
		{
			City: "烟台市",
			Name: "蓬莱区",
			Id:   "370614000000",
		},
		{
			City: "烟台市",
			Name: "烟台高新技术产业开发区",
			Id:   "370671000000",
		},
		{
			City: "烟台市",
			Name: "烟台经济技术开发区",
			Id:   "370672000000",
		},
		{
			City: "烟台市",
			Name: "龙口市",
			Id:   "370681000000",
		},
		{
			City: "烟台市",
			Name: "莱阳市",
			Id:   "370682000000",
		},
		{
			City: "烟台市",
			Name: "莱州市",
			Id:   "370683000000",
		},
		{
			City: "烟台市",
			Name: "招远市",
			Id:   "370685000000",
		},
		{
			City: "烟台市",
			Name: "栖霞市",
			Id:   "370686000000",
		},
		{
			City: "烟台市",
			Name: "海阳市",
			Id:   "370687000000",
		},
	},
	"370700000000": {
		{
			City: "潍坊市",
			Name: "市辖区",
			Id:   "370701000000",
		},
		{
			City: "潍坊市",
			Name: "潍城区",
			Id:   "370702000000",
		},
		{
			City: "潍坊市",
			Name: "寒亭区",
			Id:   "370703000000",
		},
		{
			City: "潍坊市",
			Name: "坊子区",
			Id:   "370704000000",
		},
		{
			City: "潍坊市",
			Name: "奎文区",
			Id:   "370705000000",
		},
		{
			City: "潍坊市",
			Name: "临朐县",
			Id:   "370724000000",
		},
		{
			City: "潍坊市",
			Name: "昌乐县",
			Id:   "370725000000",
		},
		{
			City: "潍坊市",
			Name: "潍坊滨海经济技术开发区",
			Id:   "370772000000",
		},
		{
			City: "潍坊市",
			Name: "青州市",
			Id:   "370781000000",
		},
		{
			City: "潍坊市",
			Name: "诸城市",
			Id:   "370782000000",
		},
		{
			City: "潍坊市",
			Name: "寿光市",
			Id:   "370783000000",
		},
		{
			City: "潍坊市",
			Name: "安丘市",
			Id:   "370784000000",
		},
		{
			City: "潍坊市",
			Name: "高密市",
			Id:   "370785000000",
		},
		{
			City: "潍坊市",
			Name: "昌邑市",
			Id:   "370786000000",
		},
	},
	"370800000000": {
		{
			City: "济宁市",
			Name: "市辖区",
			Id:   "370801000000",
		},
		{
			City: "济宁市",
			Name: "任城区",
			Id:   "370811000000",
		},
		{
			City: "济宁市",
			Name: "兖州区",
			Id:   "370812000000",
		},
		{
			City: "济宁市",
			Name: "微山县",
			Id:   "370826000000",
		},
		{
			City: "济宁市",
			Name: "鱼台县",
			Id:   "370827000000",
		},
		{
			City: "济宁市",
			Name: "金乡县",
			Id:   "370828000000",
		},
		{
			City: "济宁市",
			Name: "嘉祥县",
			Id:   "370829000000",
		},
		{
			City: "济宁市",
			Name: "汶上县",
			Id:   "370830000000",
		},
		{
			City: "济宁市",
			Name: "泗水县",
			Id:   "370831000000",
		},
		{
			City: "济宁市",
			Name: "梁山县",
			Id:   "370832000000",
		},
		{
			City: "济宁市",
			Name: "济宁高新技术产业开发区",
			Id:   "370871000000",
		},
		{
			City: "济宁市",
			Name: "曲阜市",
			Id:   "370881000000",
		},
		{
			City: "济宁市",
			Name: "邹城市",
			Id:   "370883000000",
		},
	},
	"370900000000": {
		{
			City: "泰安市",
			Name: "市辖区",
			Id:   "370901000000",
		},
		{
			City: "泰安市",
			Name: "泰山区",
			Id:   "370902000000",
		},
		{
			City: "泰安市",
			Name: "岱岳区",
			Id:   "370911000000",
		},
		{
			City: "泰安市",
			Name: "宁阳县",
			Id:   "370921000000",
		},
		{
			City: "泰安市",
			Name: "东平县",
			Id:   "370923000000",
		},
		{
			City: "泰安市",
			Name: "新泰市",
			Id:   "370982000000",
		},
		{
			City: "泰安市",
			Name: "肥城市",
			Id:   "370983000000",
		},
	},
	"371000000000": {
		{
			City: "威海市",
			Name: "市辖区",
			Id:   "371001000000",
		},
		{
			City: "威海市",
			Name: "环翠区",
			Id:   "371002000000",
		},
		{
			City: "威海市",
			Name: "文登区",
			Id:   "371003000000",
		},
		{
			City: "威海市",
			Name: "威海火炬高技术产业开发区",
			Id:   "371071000000",
		},
		{
			City: "威海市",
			Name: "威海经济技术开发区",
			Id:   "371072000000",
		},
		{
			City: "威海市",
			Name: "威海临港经济技术开发区",
			Id:   "371073000000",
		},
		{
			City: "威海市",
			Name: "荣成市",
			Id:   "371082000000",
		},
		{
			City: "威海市",
			Name: "乳山市",
			Id:   "371083000000",
		},
	},
	"371100000000": {
		{
			City: "日照市",
			Name: "市辖区",
			Id:   "371101000000",
		},
		{
			City: "日照市",
			Name: "东港区",
			Id:   "371102000000",
		},
		{
			City: "日照市",
			Name: "岚山区",
			Id:   "371103000000",
		},
		{
			City: "日照市",
			Name: "五莲县",
			Id:   "371121000000",
		},
		{
			City: "日照市",
			Name: "莒县",
			Id:   "371122000000",
		},
		{
			City: "日照市",
			Name: "日照经济技术开发区",
			Id:   "371171000000",
		},
	},
	"371300000000": {
		{
			City: "临沂市",
			Name: "市辖区",
			Id:   "371301000000",
		},
		{
			City: "临沂市",
			Name: "兰山区",
			Id:   "371302000000",
		},
		{
			City: "临沂市",
			Name: "罗庄区",
			Id:   "371311000000",
		},
		{
			City: "临沂市",
			Name: "河东区",
			Id:   "371312000000",
		},
		{
			City: "临沂市",
			Name: "沂南县",
			Id:   "371321000000",
		},
		{
			City: "临沂市",
			Name: "郯城县",
			Id:   "371322000000",
		},
		{
			City: "临沂市",
			Name: "沂水县",
			Id:   "371323000000",
		},
		{
			City: "临沂市",
			Name: "兰陵县",
			Id:   "371324000000",
		},
		{
			City: "临沂市",
			Name: "费县",
			Id:   "371325000000",
		},
		{
			City: "临沂市",
			Name: "平邑县",
			Id:   "371326000000",
		},
		{
			City: "临沂市",
			Name: "莒南县",
			Id:   "371327000000",
		},
		{
			City: "临沂市",
			Name: "蒙阴县",
			Id:   "371328000000",
		},
		{
			City: "临沂市",
			Name: "临沭县",
			Id:   "371329000000",
		},
		{
			City: "临沂市",
			Name: "临沂高新技术产业开发区",
			Id:   "371371000000",
		},
	},
	"371400000000": {
		{
			City: "德州市",
			Name: "市辖区",
			Id:   "371401000000",
		},
		{
			City: "德州市",
			Name: "德城区",
			Id:   "371402000000",
		},
		{
			City: "德州市",
			Name: "陵城区",
			Id:   "371403000000",
		},
		{
			City: "德州市",
			Name: "宁津县",
			Id:   "371422000000",
		},
		{
			City: "德州市",
			Name: "庆云县",
			Id:   "371423000000",
		},
		{
			City: "德州市",
			Name: "临邑县",
			Id:   "371424000000",
		},
		{
			City: "德州市",
			Name: "齐河县",
			Id:   "371425000000",
		},
		{
			City: "德州市",
			Name: "平原县",
			Id:   "371426000000",
		},
		{
			City: "德州市",
			Name: "夏津县",
			Id:   "371427000000",
		},
		{
			City: "德州市",
			Name: "武城县",
			Id:   "371428000000",
		},
		{
			City: "德州市",
			Name: "德州经济技术开发区",
			Id:   "371471000000",
		},
		{
			City: "德州市",
			Name: "德州运河经济开发区",
			Id:   "371472000000",
		},
		{
			City: "德州市",
			Name: "乐陵市",
			Id:   "371481000000",
		},
		{
			City: "德州市",
			Name: "禹城市",
			Id:   "371482000000",
		},
	},
	"371500000000": {
		{
			City: "聊城市",
			Name: "市辖区",
			Id:   "371501000000",
		},
		{
			City: "聊城市",
			Name: "东昌府区",
			Id:   "371502000000",
		},
		{
			City: "聊城市",
			Name: "茌平区",
			Id:   "371503000000",
		},
		{
			City: "聊城市",
			Name: "阳谷县",
			Id:   "371521000000",
		},
		{
			City: "聊城市",
			Name: "莘县",
			Id:   "371522000000",
		},
		{
			City: "聊城市",
			Name: "东阿县",
			Id:   "371524000000",
		},
		{
			City: "聊城市",
			Name: "冠县",
			Id:   "371525000000",
		},
		{
			City: "聊城市",
			Name: "高唐县",
			Id:   "371526000000",
		},
		{
			City: "聊城市",
			Name: "临清市",
			Id:   "371581000000",
		},
	},
	"371600000000": {
		{
			City: "滨州市",
			Name: "市辖区",
			Id:   "371601000000",
		},
		{
			City: "滨州市",
			Name: "滨城区",
			Id:   "371602000000",
		},
		{
			City: "滨州市",
			Name: "沾化区",
			Id:   "371603000000",
		},
		{
			City: "滨州市",
			Name: "惠民县",
			Id:   "371621000000",
		},
		{
			City: "滨州市",
			Name: "阳信县",
			Id:   "371622000000",
		},
		{
			City: "滨州市",
			Name: "无棣县",
			Id:   "371623000000",
		},
		{
			City: "滨州市",
			Name: "博兴县",
			Id:   "371625000000",
		},
		{
			City: "滨州市",
			Name: "邹平市",
			Id:   "371681000000",
		},
	},
	"371700000000": {
		{
			City: "菏泽市",
			Name: "市辖区",
			Id:   "371701000000",
		},
		{
			City: "菏泽市",
			Name: "牡丹区",
			Id:   "371702000000",
		},
		{
			City: "菏泽市",
			Name: "定陶区",
			Id:   "371703000000",
		},
		{
			City: "菏泽市",
			Name: "曹县",
			Id:   "371721000000",
		},
		{
			City: "菏泽市",
			Name: "单县",
			Id:   "371722000000",
		},
		{
			City: "菏泽市",
			Name: "成武县",
			Id:   "371723000000",
		},
		{
			City: "菏泽市",
			Name: "巨野县",
			Id:   "371724000000",
		},
		{
			City: "菏泽市",
			Name: "郓城县",
			Id:   "371725000000",
		},
		{
			City: "菏泽市",
			Name: "鄄城县",
			Id:   "371726000000",
		},
		{
			City: "菏泽市",
			Name: "东明县",
			Id:   "371728000000",
		},
		{
			City: "菏泽市",
			Name: "菏泽经济技术开发区",
			Id:   "371771000000",
		},
		{
			City: "菏泽市",
			Name: "菏泽高新技术开发区",
			Id:   "371772000000",
		},
	},
	"410100000000": {
		{
			City: "郑州市",
			Name: "市辖区",
			Id:   "410101000000",
		},
		{
			City: "郑州市",
			Name: "中原区",
			Id:   "410102000000",
		},
		{
			City: "郑州市",
			Name: "二七区",
			Id:   "410103000000",
		},
		{
			City: "郑州市",
			Name: "管城回族区",
			Id:   "410104000000",
		},
		{
			City: "郑州市",
			Name: "金水区",
			Id:   "410105000000",
		},
		{
			City: "郑州市",
			Name: "上街区",
			Id:   "410106000000",
		},
		{
			City: "郑州市",
			Name: "惠济区",
			Id:   "410108000000",
		},
		{
			City: "郑州市",
			Name: "中牟县",
			Id:   "410122000000",
		},
		{
			City: "郑州市",
			Name: "郑州经济技术开发区",
			Id:   "410171000000",
		},
		{
			City: "郑州市",
			Name: "郑州高新技术产业开发区",
			Id:   "410172000000",
		},
		{
			City: "郑州市",
			Name: "郑州航空港经济综合实验区",
			Id:   "410173000000",
		},
		{
			City: "郑州市",
			Name: "巩义市",
			Id:   "410181000000",
		},
		{
			City: "郑州市",
			Name: "荥阳市",
			Id:   "410182000000",
		},
		{
			City: "郑州市",
			Name: "新密市",
			Id:   "410183000000",
		},
		{
			City: "郑州市",
			Name: "新郑市",
			Id:   "410184000000",
		},
		{
			City: "郑州市",
			Name: "登封市",
			Id:   "410185000000",
		},
	},
	"410200000000": {
		{
			City: "开封市",
			Name: "市辖区",
			Id:   "410201000000",
		},
		{
			City: "开封市",
			Name: "龙亭区",
			Id:   "410202000000",
		},
		{
			City: "开封市",
			Name: "顺河回族区",
			Id:   "410203000000",
		},
		{
			City: "开封市",
			Name: "鼓楼区",
			Id:   "410204000000",
		},
		{
			City: "开封市",
			Name: "禹王台区",
			Id:   "410205000000",
		},
		{
			City: "开封市",
			Name: "祥符区",
			Id:   "410212000000",
		},
		{
			City: "开封市",
			Name: "杞县",
			Id:   "410221000000",
		},
		{
			City: "开封市",
			Name: "通许县",
			Id:   "410222000000",
		},
		{
			City: "开封市",
			Name: "尉氏县",
			Id:   "410223000000",
		},
		{
			City: "开封市",
			Name: "兰考县",
			Id:   "410225000000",
		},
	},
	"410300000000": {
		{
			City: "洛阳市",
			Name: "市辖区",
			Id:   "410301000000",
		},
		{
			City: "洛阳市",
			Name: "老城区",
			Id:   "410302000000",
		},
		{
			City: "洛阳市",
			Name: "西工区",
			Id:   "410303000000",
		},
		{
			City: "洛阳市",
			Name: "瀍河回族区",
			Id:   "410304000000",
		},
		{
			City: "洛阳市",
			Name: "涧西区",
			Id:   "410305000000",
		},
		{
			City: "洛阳市",
			Name: "吉利区",
			Id:   "410306000000",
		},
		{
			City: "洛阳市",
			Name: "洛龙区",
			Id:   "410311000000",
		},
		{
			City: "洛阳市",
			Name: "孟津县",
			Id:   "410322000000",
		},
		{
			City: "洛阳市",
			Name: "新安县",
			Id:   "410323000000",
		},
		{
			City: "洛阳市",
			Name: "栾川县",
			Id:   "410324000000",
		},
		{
			City: "洛阳市",
			Name: "嵩县",
			Id:   "410325000000",
		},
		{
			City: "洛阳市",
			Name: "汝阳县",
			Id:   "410326000000",
		},
		{
			City: "洛阳市",
			Name: "宜阳县",
			Id:   "410327000000",
		},
		{
			City: "洛阳市",
			Name: "洛宁县",
			Id:   "410328000000",
		},
		{
			City: "洛阳市",
			Name: "伊川县",
			Id:   "410329000000",
		},
		{
			City: "洛阳市",
			Name: "洛阳高新技术产业开发区",
			Id:   "410371000000",
		},
		{
			City: "洛阳市",
			Name: "偃师市",
			Id:   "410381000000",
		},
	},
	"410400000000": {
		{
			City: "平顶山市",
			Name: "市辖区",
			Id:   "410401000000",
		},
		{
			City: "平顶山市",
			Name: "新华区",
			Id:   "410402000000",
		},
		{
			City: "平顶山市",
			Name: "卫东区",
			Id:   "410403000000",
		},
		{
			City: "平顶山市",
			Name: "石龙区",
			Id:   "410404000000",
		},
		{
			City: "平顶山市",
			Name: "湛河区",
			Id:   "410411000000",
		},
		{
			City: "平顶山市",
			Name: "宝丰县",
			Id:   "410421000000",
		},
		{
			City: "平顶山市",
			Name: "叶县",
			Id:   "410422000000",
		},
		{
			City: "平顶山市",
			Name: "鲁山县",
			Id:   "410423000000",
		},
		{
			City: "平顶山市",
			Name: "郏县",
			Id:   "410425000000",
		},
		{
			City: "平顶山市",
			Name: "平顶山高新技术产业开发区",
			Id:   "410471000000",
		},
		{
			City: "平顶山市",
			Name: "平顶山市城乡一体化示范区",
			Id:   "410472000000",
		},
		{
			City: "平顶山市",
			Name: "舞钢市",
			Id:   "410481000000",
		},
		{
			City: "平顶山市",
			Name: "汝州市",
			Id:   "410482000000",
		},
	},
	"410500000000": {
		{
			City: "安阳市",
			Name: "市辖区",
			Id:   "410501000000",
		},
		{
			City: "安阳市",
			Name: "文峰区",
			Id:   "410502000000",
		},
		{
			City: "安阳市",
			Name: "北关区",
			Id:   "410503000000",
		},
		{
			City: "安阳市",
			Name: "殷都区",
			Id:   "410505000000",
		},
		{
			City: "安阳市",
			Name: "龙安区",
			Id:   "410506000000",
		},
		{
			City: "安阳市",
			Name: "安阳县",
			Id:   "410522000000",
		},
		{
			City: "安阳市",
			Name: "汤阴县",
			Id:   "410523000000",
		},
		{
			City: "安阳市",
			Name: "滑县",
			Id:   "410526000000",
		},
		{
			City: "安阳市",
			Name: "内黄县",
			Id:   "410527000000",
		},
		{
			City: "安阳市",
			Name: "安阳高新技术产业开发区",
			Id:   "410571000000",
		},
		{
			City: "安阳市",
			Name: "林州市",
			Id:   "410581000000",
		},
	},
	"410600000000": {
		{
			City: "鹤壁市",
			Name: "市辖区",
			Id:   "410601000000",
		},
		{
			City: "鹤壁市",
			Name: "鹤山区",
			Id:   "410602000000",
		},
		{
			City: "鹤壁市",
			Name: "山城区",
			Id:   "410603000000",
		},
		{
			City: "鹤壁市",
			Name: "淇滨区",
			Id:   "410611000000",
		},
		{
			City: "鹤壁市",
			Name: "浚县",
			Id:   "410621000000",
		},
		{
			City: "鹤壁市",
			Name: "淇县",
			Id:   "410622000000",
		},
		{
			City: "鹤壁市",
			Name: "鹤壁经济技术开发区",
			Id:   "410671000000",
		},
	},
	"410700000000": {
		{
			City: "新乡市",
			Name: "市辖区",
			Id:   "410701000000",
		},
		{
			City: "新乡市",
			Name: "红旗区",
			Id:   "410702000000",
		},
		{
			City: "新乡市",
			Name: "卫滨区",
			Id:   "410703000000",
		},
		{
			City: "新乡市",
			Name: "凤泉区",
			Id:   "410704000000",
		},
		{
			City: "新乡市",
			Name: "牧野区",
			Id:   "410711000000",
		},
		{
			City: "新乡市",
			Name: "新乡县",
			Id:   "410721000000",
		},
		{
			City: "新乡市",
			Name: "获嘉县",
			Id:   "410724000000",
		},
		{
			City: "新乡市",
			Name: "原阳县",
			Id:   "410725000000",
		},
		{
			City: "新乡市",
			Name: "延津县",
			Id:   "410726000000",
		},
		{
			City: "新乡市",
			Name: "封丘县",
			Id:   "410727000000",
		},
		{
			City: "新乡市",
			Name: "新乡高新技术产业开发区",
			Id:   "410771000000",
		},
		{
			City: "新乡市",
			Name: "新乡经济技术开发区",
			Id:   "410772000000",
		},
		{
			City: "新乡市",
			Name: "新乡市平原城乡一体化示范区",
			Id:   "410773000000",
		},
		{
			City: "新乡市",
			Name: "卫辉市",
			Id:   "410781000000",
		},
		{
			City: "新乡市",
			Name: "辉县市",
			Id:   "410782000000",
		},
		{
			City: "新乡市",
			Name: "长垣市",
			Id:   "410783000000",
		},
	},
	"410800000000": {
		{
			City: "焦作市",
			Name: "市辖区",
			Id:   "410801000000",
		},
		{
			City: "焦作市",
			Name: "解放区",
			Id:   "410802000000",
		},
		{
			City: "焦作市",
			Name: "中站区",
			Id:   "410803000000",
		},
		{
			City: "焦作市",
			Name: "马村区",
			Id:   "410804000000",
		},
		{
			City: "焦作市",
			Name: "山阳区",
			Id:   "410811000000",
		},
		{
			City: "焦作市",
			Name: "修武县",
			Id:   "410821000000",
		},
		{
			City: "焦作市",
			Name: "博爱县",
			Id:   "410822000000",
		},
		{
			City: "焦作市",
			Name: "武陟县",
			Id:   "410823000000",
		},
		{
			City: "焦作市",
			Name: "温县",
			Id:   "410825000000",
		},
		{
			City: "焦作市",
			Name: "焦作城乡一体化示范区",
			Id:   "410871000000",
		},
		{
			City: "焦作市",
			Name: "沁阳市",
			Id:   "410882000000",
		},
		{
			City: "焦作市",
			Name: "孟州市",
			Id:   "410883000000",
		},
	},
	"410900000000": {
		{
			City: "濮阳市",
			Name: "市辖区",
			Id:   "410901000000",
		},
		{
			City: "濮阳市",
			Name: "华龙区",
			Id:   "410902000000",
		},
		{
			City: "濮阳市",
			Name: "清丰县",
			Id:   "410922000000",
		},
		{
			City: "濮阳市",
			Name: "南乐县",
			Id:   "410923000000",
		},
		{
			City: "濮阳市",
			Name: "范县",
			Id:   "410926000000",
		},
		{
			City: "濮阳市",
			Name: "台前县",
			Id:   "410927000000",
		},
		{
			City: "濮阳市",
			Name: "濮阳县",
			Id:   "410928000000",
		},
		{
			City: "濮阳市",
			Name: "河南濮阳工业园区",
			Id:   "410971000000",
		},
		{
			City: "濮阳市",
			Name: "濮阳经济技术开发区",
			Id:   "410972000000",
		},
	},
	"411000000000": {
		{
			City: "许昌市",
			Name: "市辖区",
			Id:   "411001000000",
		},
		{
			City: "许昌市",
			Name: "魏都区",
			Id:   "411002000000",
		},
		{
			City: "许昌市",
			Name: "建安区",
			Id:   "411003000000",
		},
		{
			City: "许昌市",
			Name: "鄢陵县",
			Id:   "411024000000",
		},
		{
			City: "许昌市",
			Name: "襄城县",
			Id:   "411025000000",
		},
		{
			City: "许昌市",
			Name: "许昌经济技术开发区",
			Id:   "411071000000",
		},
		{
			City: "许昌市",
			Name: "禹州市",
			Id:   "411081000000",
		},
		{
			City: "许昌市",
			Name: "长葛市",
			Id:   "411082000000",
		},
	},
	"411100000000": {
		{
			City: "漯河市",
			Name: "市辖区",
			Id:   "411101000000",
		},
		{
			City: "漯河市",
			Name: "源汇区",
			Id:   "411102000000",
		},
		{
			City: "漯河市",
			Name: "郾城区",
			Id:   "411103000000",
		},
		{
			City: "漯河市",
			Name: "召陵区",
			Id:   "411104000000",
		},
		{
			City: "漯河市",
			Name: "舞阳县",
			Id:   "411121000000",
		},
		{
			City: "漯河市",
			Name: "临颍县",
			Id:   "411122000000",
		},
		{
			City: "漯河市",
			Name: "漯河经济技术开发区",
			Id:   "411171000000",
		},
	},
	"411200000000": {
		{
			City: "三门峡市",
			Name: "市辖区",
			Id:   "411201000000",
		},
		{
			City: "三门峡市",
			Name: "湖滨区",
			Id:   "411202000000",
		},
		{
			City: "三门峡市",
			Name: "陕州区",
			Id:   "411203000000",
		},
		{
			City: "三门峡市",
			Name: "渑池县",
			Id:   "411221000000",
		},
		{
			City: "三门峡市",
			Name: "卢氏县",
			Id:   "411224000000",
		},
		{
			City: "三门峡市",
			Name: "河南三门峡经济开发区",
			Id:   "411271000000",
		},
		{
			City: "三门峡市",
			Name: "义马市",
			Id:   "411281000000",
		},
		{
			City: "三门峡市",
			Name: "灵宝市",
			Id:   "411282000000",
		},
	},
	"411300000000": {
		{
			City: "南阳市",
			Name: "市辖区",
			Id:   "411301000000",
		},
		{
			City: "南阳市",
			Name: "宛城区",
			Id:   "411302000000",
		},
		{
			City: "南阳市",
			Name: "卧龙区",
			Id:   "411303000000",
		},
		{
			City: "南阳市",
			Name: "南召县",
			Id:   "411321000000",
		},
		{
			City: "南阳市",
			Name: "方城县",
			Id:   "411322000000",
		},
		{
			City: "南阳市",
			Name: "西峡县",
			Id:   "411323000000",
		},
		{
			City: "南阳市",
			Name: "镇平县",
			Id:   "411324000000",
		},
		{
			City: "南阳市",
			Name: "内乡县",
			Id:   "411325000000",
		},
		{
			City: "南阳市",
			Name: "淅川县",
			Id:   "411326000000",
		},
		{
			City: "南阳市",
			Name: "社旗县",
			Id:   "411327000000",
		},
		{
			City: "南阳市",
			Name: "唐河县",
			Id:   "411328000000",
		},
		{
			City: "南阳市",
			Name: "新野县",
			Id:   "411329000000",
		},
		{
			City: "南阳市",
			Name: "桐柏县",
			Id:   "411330000000",
		},
		{
			City: "南阳市",
			Name: "南阳高新技术产业开发区",
			Id:   "411371000000",
		},
		{
			City: "南阳市",
			Name: "南阳市城乡一体化示范区",
			Id:   "411372000000",
		},
		{
			City: "南阳市",
			Name: "邓州市",
			Id:   "411381000000",
		},
	},
	"411400000000": {
		{
			City: "商丘市",
			Name: "市辖区",
			Id:   "411401000000",
		},
		{
			City: "商丘市",
			Name: "梁园区",
			Id:   "411402000000",
		},
		{
			City: "商丘市",
			Name: "睢阳区",
			Id:   "411403000000",
		},
		{
			City: "商丘市",
			Name: "民权县",
			Id:   "411421000000",
		},
		{
			City: "商丘市",
			Name: "睢县",
			Id:   "411422000000",
		},
		{
			City: "商丘市",
			Name: "宁陵县",
			Id:   "411423000000",
		},
		{
			City: "商丘市",
			Name: "柘城县",
			Id:   "411424000000",
		},
		{
			City: "商丘市",
			Name: "虞城县",
			Id:   "411425000000",
		},
		{
			City: "商丘市",
			Name: "夏邑县",
			Id:   "411426000000",
		},
		{
			City: "商丘市",
			Name: "豫东综合物流产业聚集区",
			Id:   "411471000000",
		},
		{
			City: "商丘市",
			Name: "河南商丘经济开发区",
			Id:   "411472000000",
		},
		{
			City: "商丘市",
			Name: "永城市",
			Id:   "411481000000",
		},
	},
	"411500000000": {
		{
			City: "信阳市",
			Name: "市辖区",
			Id:   "411501000000",
		},
		{
			City: "信阳市",
			Name: "浉河区",
			Id:   "411502000000",
		},
		{
			City: "信阳市",
			Name: "平桥区",
			Id:   "411503000000",
		},
		{
			City: "信阳市",
			Name: "罗山县",
			Id:   "411521000000",
		},
		{
			City: "信阳市",
			Name: "光山县",
			Id:   "411522000000",
		},
		{
			City: "信阳市",
			Name: "新县",
			Id:   "411523000000",
		},
		{
			City: "信阳市",
			Name: "商城县",
			Id:   "411524000000",
		},
		{
			City: "信阳市",
			Name: "固始县",
			Id:   "411525000000",
		},
		{
			City: "信阳市",
			Name: "潢川县",
			Id:   "411526000000",
		},
		{
			City: "信阳市",
			Name: "淮滨县",
			Id:   "411527000000",
		},
		{
			City: "信阳市",
			Name: "息县",
			Id:   "411528000000",
		},
		{
			City: "信阳市",
			Name: "信阳高新技术产业开发区",
			Id:   "411571000000",
		},
	},
	"411600000000": {
		{
			City: "周口市",
			Name: "市辖区",
			Id:   "411601000000",
		},
		{
			City: "周口市",
			Name: "川汇区",
			Id:   "411602000000",
		},
		{
			City: "周口市",
			Name: "淮阳区",
			Id:   "411603000000",
		},
		{
			City: "周口市",
			Name: "扶沟县",
			Id:   "411621000000",
		},
		{
			City: "周口市",
			Name: "西华县",
			Id:   "411622000000",
		},
		{
			City: "周口市",
			Name: "商水县",
			Id:   "411623000000",
		},
		{
			City: "周口市",
			Name: "沈丘县",
			Id:   "411624000000",
		},
		{
			City: "周口市",
			Name: "郸城县",
			Id:   "411625000000",
		},
		{
			City: "周口市",
			Name: "太康县",
			Id:   "411627000000",
		},
		{
			City: "周口市",
			Name: "鹿邑县",
			Id:   "411628000000",
		},
		{
			City: "周口市",
			Name: "河南周口经济开发区",
			Id:   "411671000000",
		},
		{
			City: "周口市",
			Name: "项城市",
			Id:   "411681000000",
		},
	},
	"411700000000": {
		{
			City: "驻马店市",
			Name: "市辖区",
			Id:   "411701000000",
		},
		{
			City: "驻马店市",
			Name: "驿城区",
			Id:   "411702000000",
		},
		{
			City: "驻马店市",
			Name: "西平县",
			Id:   "411721000000",
		},
		{
			City: "驻马店市",
			Name: "上蔡县",
			Id:   "411722000000",
		},
		{
			City: "驻马店市",
			Name: "平舆县",
			Id:   "411723000000",
		},
		{
			City: "驻马店市",
			Name: "正阳县",
			Id:   "411724000000",
		},
		{
			City: "驻马店市",
			Name: "确山县",
			Id:   "411725000000",
		},
		{
			City: "驻马店市",
			Name: "泌阳县",
			Id:   "411726000000",
		},
		{
			City: "驻马店市",
			Name: "汝南县",
			Id:   "411727000000",
		},
		{
			City: "驻马店市",
			Name: "遂平县",
			Id:   "411728000000",
		},
		{
			City: "驻马店市",
			Name: "新蔡县",
			Id:   "411729000000",
		},
		{
			City: "驻马店市",
			Name: "河南驻马店经济开发区",
			Id:   "411771000000",
		},
	},
	"419000000000": {
		{
			City: "省直辖县级行政区划",
			Name: "济源市",
			Id:   "419001000000",
		},
	},
	"420100000000": {
		{
			City: "武汉市",
			Name: "市辖区",
			Id:   "420101000000",
		},
		{
			City: "武汉市",
			Name: "江岸区",
			Id:   "420102000000",
		},
		{
			City: "武汉市",
			Name: "江汉区",
			Id:   "420103000000",
		},
		{
			City: "武汉市",
			Name: "硚口区",
			Id:   "420104000000",
		},
		{
			City: "武汉市",
			Name: "汉阳区",
			Id:   "420105000000",
		},
		{
			City: "武汉市",
			Name: "武昌区",
			Id:   "420106000000",
		},
		{
			City: "武汉市",
			Name: "青山区",
			Id:   "420107000000",
		},
		{
			City: "武汉市",
			Name: "洪山区",
			Id:   "420111000000",
		},
		{
			City: "武汉市",
			Name: "东西湖区",
			Id:   "420112000000",
		},
		{
			City: "武汉市",
			Name: "汉南区",
			Id:   "420113000000",
		},
		{
			City: "武汉市",
			Name: "蔡甸区",
			Id:   "420114000000",
		},
		{
			City: "武汉市",
			Name: "江夏区",
			Id:   "420115000000",
		},
		{
			City: "武汉市",
			Name: "黄陂区",
			Id:   "420116000000",
		},
		{
			City: "武汉市",
			Name: "新洲区",
			Id:   "420117000000",
		},
	},
	"420200000000": {
		{
			City: "黄石市",
			Name: "市辖区",
			Id:   "420201000000",
		},
		{
			City: "黄石市",
			Name: "黄石港区",
			Id:   "420202000000",
		},
		{
			City: "黄石市",
			Name: "西塞山区",
			Id:   "420203000000",
		},
		{
			City: "黄石市",
			Name: "下陆区",
			Id:   "420204000000",
		},
		{
			City: "黄石市",
			Name: "铁山区",
			Id:   "420205000000",
		},
		{
			City: "黄石市",
			Name: "阳新县",
			Id:   "420222000000",
		},
		{
			City: "黄石市",
			Name: "大冶市",
			Id:   "420281000000",
		},
	},
	"420300000000": {
		{
			City: "十堰市",
			Name: "市辖区",
			Id:   "420301000000",
		},
		{
			City: "十堰市",
			Name: "茅箭区",
			Id:   "420302000000",
		},
		{
			City: "十堰市",
			Name: "张湾区",
			Id:   "420303000000",
		},
		{
			City: "十堰市",
			Name: "郧阳区",
			Id:   "420304000000",
		},
		{
			City: "十堰市",
			Name: "郧西县",
			Id:   "420322000000",
		},
		{
			City: "十堰市",
			Name: "竹山县",
			Id:   "420323000000",
		},
		{
			City: "十堰市",
			Name: "竹溪县",
			Id:   "420324000000",
		},
		{
			City: "十堰市",
			Name: "房县",
			Id:   "420325000000",
		},
		{
			City: "十堰市",
			Name: "丹江口市",
			Id:   "420381000000",
		},
	},
	"420500000000": {
		{
			City: "宜昌市",
			Name: "市辖区",
			Id:   "420501000000",
		},
		{
			City: "宜昌市",
			Name: "西陵区",
			Id:   "420502000000",
		},
		{
			City: "宜昌市",
			Name: "伍家岗区",
			Id:   "420503000000",
		},
		{
			City: "宜昌市",
			Name: "点军区",
			Id:   "420504000000",
		},
		{
			City: "宜昌市",
			Name: "猇亭区",
			Id:   "420505000000",
		},
		{
			City: "宜昌市",
			Name: "夷陵区",
			Id:   "420506000000",
		},
		{
			City: "宜昌市",
			Name: "远安县",
			Id:   "420525000000",
		},
		{
			City: "宜昌市",
			Name: "兴山县",
			Id:   "420526000000",
		},
		{
			City: "宜昌市",
			Name: "秭归县",
			Id:   "420527000000",
		},
		{
			City: "宜昌市",
			Name: "长阳土家族自治县",
			Id:   "420528000000",
		},
		{
			City: "宜昌市",
			Name: "五峰土家族自治县",
			Id:   "420529000000",
		},
		{
			City: "宜昌市",
			Name: "宜都市",
			Id:   "420581000000",
		},
		{
			City: "宜昌市",
			Name: "当阳市",
			Id:   "420582000000",
		},
		{
			City: "宜昌市",
			Name: "枝江市",
			Id:   "420583000000",
		},
	},
	"420600000000": {
		{
			City: "襄阳市",
			Name: "市辖区",
			Id:   "420601000000",
		},
		{
			City: "襄阳市",
			Name: "襄城区",
			Id:   "420602000000",
		},
		{
			City: "襄阳市",
			Name: "樊城区",
			Id:   "420606000000",
		},
		{
			City: "襄阳市",
			Name: "襄州区",
			Id:   "420607000000",
		},
		{
			City: "襄阳市",
			Name: "南漳县",
			Id:   "420624000000",
		},
		{
			City: "襄阳市",
			Name: "谷城县",
			Id:   "420625000000",
		},
		{
			City: "襄阳市",
			Name: "保康县",
			Id:   "420626000000",
		},
		{
			City: "襄阳市",
			Name: "老河口市",
			Id:   "420682000000",
		},
		{
			City: "襄阳市",
			Name: "枣阳市",
			Id:   "420683000000",
		},
		{
			City: "襄阳市",
			Name: "宜城市",
			Id:   "420684000000",
		},
	},
	"420700000000": {
		{
			City: "鄂州市",
			Name: "市辖区",
			Id:   "420701000000",
		},
		{
			City: "鄂州市",
			Name: "梁子湖区",
			Id:   "420702000000",
		},
		{
			City: "鄂州市",
			Name: "华容区",
			Id:   "420703000000",
		},
		{
			City: "鄂州市",
			Name: "鄂城区",
			Id:   "420704000000",
		},
	},
	"420800000000": {
		{
			City: "荆门市",
			Name: "市辖区",
			Id:   "420801000000",
		},
		{
			City: "荆门市",
			Name: "东宝区",
			Id:   "420802000000",
		},
		{
			City: "荆门市",
			Name: "掇刀区",
			Id:   "420804000000",
		},
		{
			City: "荆门市",
			Name: "沙洋县",
			Id:   "420822000000",
		},
		{
			City: "荆门市",
			Name: "钟祥市",
			Id:   "420881000000",
		},
		{
			City: "荆门市",
			Name: "京山市",
			Id:   "420882000000",
		},
	},
	"420900000000": {
		{
			City: "孝感市",
			Name: "市辖区",
			Id:   "420901000000",
		},
		{
			City: "孝感市",
			Name: "孝南区",
			Id:   "420902000000",
		},
		{
			City: "孝感市",
			Name: "孝昌县",
			Id:   "420921000000",
		},
		{
			City: "孝感市",
			Name: "大悟县",
			Id:   "420922000000",
		},
		{
			City: "孝感市",
			Name: "云梦县",
			Id:   "420923000000",
		},
		{
			City: "孝感市",
			Name: "应城市",
			Id:   "420981000000",
		},
		{
			City: "孝感市",
			Name: "安陆市",
			Id:   "420982000000",
		},
		{
			City: "孝感市",
			Name: "汉川市",
			Id:   "420984000000",
		},
	},
	"421000000000": {
		{
			City: "荆州市",
			Name: "市辖区",
			Id:   "421001000000",
		},
		{
			City: "荆州市",
			Name: "沙市区",
			Id:   "421002000000",
		},
		{
			City: "荆州市",
			Name: "荆州区",
			Id:   "421003000000",
		},
		{
			City: "荆州市",
			Name: "公安县",
			Id:   "421022000000",
		},
		{
			City: "荆州市",
			Name: "监利县",
			Id:   "421023000000",
		},
		{
			City: "荆州市",
			Name: "江陵县",
			Id:   "421024000000",
		},
		{
			City: "荆州市",
			Name: "荆州经济技术开发区",
			Id:   "421071000000",
		},
		{
			City: "荆州市",
			Name: "石首市",
			Id:   "421081000000",
		},
		{
			City: "荆州市",
			Name: "洪湖市",
			Id:   "421083000000",
		},
		{
			City: "荆州市",
			Name: "松滋市",
			Id:   "421087000000",
		},
	},
	"421100000000": {
		{
			City: "黄冈市",
			Name: "市辖区",
			Id:   "421101000000",
		},
		{
			City: "黄冈市",
			Name: "黄州区",
			Id:   "421102000000",
		},
		{
			City: "黄冈市",
			Name: "团风县",
			Id:   "421121000000",
		},
		{
			City: "黄冈市",
			Name: "红安县",
			Id:   "421122000000",
		},
		{
			City: "黄冈市",
			Name: "罗田县",
			Id:   "421123000000",
		},
		{
			City: "黄冈市",
			Name: "英山县",
			Id:   "421124000000",
		},
		{
			City: "黄冈市",
			Name: "浠水县",
			Id:   "421125000000",
		},
		{
			City: "黄冈市",
			Name: "蕲春县",
			Id:   "421126000000",
		},
		{
			City: "黄冈市",
			Name: "黄梅县",
			Id:   "421127000000",
		},
		{
			City: "黄冈市",
			Name: "龙感湖管理区",
			Id:   "421171000000",
		},
		{
			City: "黄冈市",
			Name: "麻城市",
			Id:   "421181000000",
		},
		{
			City: "黄冈市",
			Name: "武穴市",
			Id:   "421182000000",
		},
	},
	"421200000000": {
		{
			City: "咸宁市",
			Name: "市辖区",
			Id:   "421201000000",
		},
		{
			City: "咸宁市",
			Name: "咸安区",
			Id:   "421202000000",
		},
		{
			City: "咸宁市",
			Name: "嘉鱼县",
			Id:   "421221000000",
		},
		{
			City: "咸宁市",
			Name: "通城县",
			Id:   "421222000000",
		},
		{
			City: "咸宁市",
			Name: "崇阳县",
			Id:   "421223000000",
		},
		{
			City: "咸宁市",
			Name: "通山县",
			Id:   "421224000000",
		},
		{
			City: "咸宁市",
			Name: "赤壁市",
			Id:   "421281000000",
		},
	},
	"421300000000": {
		{
			City: "随州市",
			Name: "市辖区",
			Id:   "421301000000",
		},
		{
			City: "随州市",
			Name: "曾都区",
			Id:   "421303000000",
		},
		{
			City: "随州市",
			Name: "随县",
			Id:   "421321000000",
		},
		{
			City: "随州市",
			Name: "广水市",
			Id:   "421381000000",
		},
	},
	"422800000000": {
		{
			City: "恩施土家族苗族自治州",
			Name: "恩施市",
			Id:   "422801000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "利川市",
			Id:   "422802000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "建始县",
			Id:   "422822000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "巴东县",
			Id:   "422823000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "宣恩县",
			Id:   "422825000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "咸丰县",
			Id:   "422826000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "来凤县",
			Id:   "422827000000",
		},
		{
			City: "恩施土家族苗族自治州",
			Name: "鹤峰县",
			Id:   "422828000000",
		},
	},
	"429000000000": {
		{
			City: "省直辖县级行政区划",
			Name: "仙桃市",
			Id:   "429004000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "潜江市",
			Id:   "429005000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "天门市",
			Id:   "429006000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "神农架林区",
			Id:   "429021000000",
		},
	},
	"430100000000": {
		{
			City: "长沙市",
			Name: "市辖区",
			Id:   "430101000000",
		},
		{
			City: "长沙市",
			Name: "芙蓉区",
			Id:   "430102000000",
		},
		{
			City: "长沙市",
			Name: "天心区",
			Id:   "430103000000",
		},
		{
			City: "长沙市",
			Name: "岳麓区",
			Id:   "430104000000",
		},
		{
			City: "长沙市",
			Name: "开福区",
			Id:   "430105000000",
		},
		{
			City: "长沙市",
			Name: "雨花区",
			Id:   "430111000000",
		},
		{
			City: "长沙市",
			Name: "望城区",
			Id:   "430112000000",
		},
		{
			City: "长沙市",
			Name: "长沙县",
			Id:   "430121000000",
		},
		{
			City: "长沙市",
			Name: "浏阳市",
			Id:   "430181000000",
		},
		{
			City: "长沙市",
			Name: "宁乡市",
			Id:   "430182000000",
		},
	},
	"430200000000": {
		{
			City: "株洲市",
			Name: "市辖区",
			Id:   "430201000000",
		},
		{
			City: "株洲市",
			Name: "荷塘区",
			Id:   "430202000000",
		},
		{
			City: "株洲市",
			Name: "芦淞区",
			Id:   "430203000000",
		},
		{
			City: "株洲市",
			Name: "石峰区",
			Id:   "430204000000",
		},
		{
			City: "株洲市",
			Name: "天元区",
			Id:   "430211000000",
		},
		{
			City: "株洲市",
			Name: "渌口区",
			Id:   "430212000000",
		},
		{
			City: "株洲市",
			Name: "攸县",
			Id:   "430223000000",
		},
		{
			City: "株洲市",
			Name: "茶陵县",
			Id:   "430224000000",
		},
		{
			City: "株洲市",
			Name: "炎陵县",
			Id:   "430225000000",
		},
		{
			City: "株洲市",
			Name: "云龙示范区",
			Id:   "430271000000",
		},
		{
			City: "株洲市",
			Name: "醴陵市",
			Id:   "430281000000",
		},
	},
	"430300000000": {
		{
			City: "湘潭市",
			Name: "市辖区",
			Id:   "430301000000",
		},
		{
			City: "湘潭市",
			Name: "雨湖区",
			Id:   "430302000000",
		},
		{
			City: "湘潭市",
			Name: "岳塘区",
			Id:   "430304000000",
		},
		{
			City: "湘潭市",
			Name: "湘潭县",
			Id:   "430321000000",
		},
		{
			City: "湘潭市",
			Name: "湖南湘潭高新技术产业园区",
			Id:   "430371000000",
		},
		{
			City: "湘潭市",
			Name: "湘潭昭山示范区",
			Id:   "430372000000",
		},
		{
			City: "湘潭市",
			Name: "湘潭九华示范区",
			Id:   "430373000000",
		},
		{
			City: "湘潭市",
			Name: "湘乡市",
			Id:   "430381000000",
		},
		{
			City: "湘潭市",
			Name: "韶山市",
			Id:   "430382000000",
		},
	},
	"430400000000": {
		{
			City: "衡阳市",
			Name: "市辖区",
			Id:   "430401000000",
		},
		{
			City: "衡阳市",
			Name: "珠晖区",
			Id:   "430405000000",
		},
		{
			City: "衡阳市",
			Name: "雁峰区",
			Id:   "430406000000",
		},
		{
			City: "衡阳市",
			Name: "石鼓区",
			Id:   "430407000000",
		},
		{
			City: "衡阳市",
			Name: "蒸湘区",
			Id:   "430408000000",
		},
		{
			City: "衡阳市",
			Name: "南岳区",
			Id:   "430412000000",
		},
		{
			City: "衡阳市",
			Name: "衡阳县",
			Id:   "430421000000",
		},
		{
			City: "衡阳市",
			Name: "衡南县",
			Id:   "430422000000",
		},
		{
			City: "衡阳市",
			Name: "衡山县",
			Id:   "430423000000",
		},
		{
			City: "衡阳市",
			Name: "衡东县",
			Id:   "430424000000",
		},
		{
			City: "衡阳市",
			Name: "祁东县",
			Id:   "430426000000",
		},
		{
			City: "衡阳市",
			Name: "衡阳综合保税区",
			Id:   "430471000000",
		},
		{
			City: "衡阳市",
			Name: "湖南衡阳高新技术产业园区",
			Id:   "430472000000",
		},
		{
			City: "衡阳市",
			Name: "湖南衡阳松木经济开发区",
			Id:   "430473000000",
		},
		{
			City: "衡阳市",
			Name: "耒阳市",
			Id:   "430481000000",
		},
		{
			City: "衡阳市",
			Name: "常宁市",
			Id:   "430482000000",
		},
	},
	"430500000000": {
		{
			City: "邵阳市",
			Name: "市辖区",
			Id:   "430501000000",
		},
		{
			City: "邵阳市",
			Name: "双清区",
			Id:   "430502000000",
		},
		{
			City: "邵阳市",
			Name: "大祥区",
			Id:   "430503000000",
		},
		{
			City: "邵阳市",
			Name: "北塔区",
			Id:   "430511000000",
		},
		{
			City: "邵阳市",
			Name: "新邵县",
			Id:   "430522000000",
		},
		{
			City: "邵阳市",
			Name: "邵阳县",
			Id:   "430523000000",
		},
		{
			City: "邵阳市",
			Name: "隆回县",
			Id:   "430524000000",
		},
		{
			City: "邵阳市",
			Name: "洞口县",
			Id:   "430525000000",
		},
		{
			City: "邵阳市",
			Name: "绥宁县",
			Id:   "430527000000",
		},
		{
			City: "邵阳市",
			Name: "新宁县",
			Id:   "430528000000",
		},
		{
			City: "邵阳市",
			Name: "城步苗族自治县",
			Id:   "430529000000",
		},
		{
			City: "邵阳市",
			Name: "武冈市",
			Id:   "430581000000",
		},
		{
			City: "邵阳市",
			Name: "邵东市",
			Id:   "430582000000",
		},
	},
	"430600000000": {
		{
			City: "岳阳市",
			Name: "市辖区",
			Id:   "430601000000",
		},
		{
			City: "岳阳市",
			Name: "岳阳楼区",
			Id:   "430602000000",
		},
		{
			City: "岳阳市",
			Name: "云溪区",
			Id:   "430603000000",
		},
		{
			City: "岳阳市",
			Name: "君山区",
			Id:   "430611000000",
		},
		{
			City: "岳阳市",
			Name: "岳阳县",
			Id:   "430621000000",
		},
		{
			City: "岳阳市",
			Name: "华容县",
			Id:   "430623000000",
		},
		{
			City: "岳阳市",
			Name: "湘阴县",
			Id:   "430624000000",
		},
		{
			City: "岳阳市",
			Name: "平江县",
			Id:   "430626000000",
		},
		{
			City: "岳阳市",
			Name: "岳阳市屈原管理区",
			Id:   "430671000000",
		},
		{
			City: "岳阳市",
			Name: "汨罗市",
			Id:   "430681000000",
		},
		{
			City: "岳阳市",
			Name: "临湘市",
			Id:   "430682000000",
		},
	},
	"430700000000": {
		{
			City: "常德市",
			Name: "市辖区",
			Id:   "430701000000",
		},
		{
			City: "常德市",
			Name: "武陵区",
			Id:   "430702000000",
		},
		{
			City: "常德市",
			Name: "鼎城区",
			Id:   "430703000000",
		},
		{
			City: "常德市",
			Name: "安乡县",
			Id:   "430721000000",
		},
		{
			City: "常德市",
			Name: "汉寿县",
			Id:   "430722000000",
		},
		{
			City: "常德市",
			Name: "澧县",
			Id:   "430723000000",
		},
		{
			City: "常德市",
			Name: "临澧县",
			Id:   "430724000000",
		},
		{
			City: "常德市",
			Name: "桃源县",
			Id:   "430725000000",
		},
		{
			City: "常德市",
			Name: "石门县",
			Id:   "430726000000",
		},
		{
			City: "常德市",
			Name: "常德市西洞庭管理区",
			Id:   "430771000000",
		},
		{
			City: "常德市",
			Name: "津市市",
			Id:   "430781000000",
		},
	},
	"430800000000": {
		{
			City: "张家界市",
			Name: "市辖区",
			Id:   "430801000000",
		},
		{
			City: "张家界市",
			Name: "永定区",
			Id:   "430802000000",
		},
		{
			City: "张家界市",
			Name: "武陵源区",
			Id:   "430811000000",
		},
		{
			City: "张家界市",
			Name: "慈利县",
			Id:   "430821000000",
		},
		{
			City: "张家界市",
			Name: "桑植县",
			Id:   "430822000000",
		},
	},
	"430900000000": {
		{
			City: "益阳市",
			Name: "市辖区",
			Id:   "430901000000",
		},
		{
			City: "益阳市",
			Name: "资阳区",
			Id:   "430902000000",
		},
		{
			City: "益阳市",
			Name: "赫山区",
			Id:   "430903000000",
		},
		{
			City: "益阳市",
			Name: "南县",
			Id:   "430921000000",
		},
		{
			City: "益阳市",
			Name: "桃江县",
			Id:   "430922000000",
		},
		{
			City: "益阳市",
			Name: "安化县",
			Id:   "430923000000",
		},
		{
			City: "益阳市",
			Name: "益阳市大通湖管理区",
			Id:   "430971000000",
		},
		{
			City: "益阳市",
			Name: "湖南益阳高新技术产业园区",
			Id:   "430972000000",
		},
		{
			City: "益阳市",
			Name: "沅江市",
			Id:   "430981000000",
		},
	},
	"431000000000": {
		{
			City: "郴州市",
			Name: "市辖区",
			Id:   "431001000000",
		},
		{
			City: "郴州市",
			Name: "北湖区",
			Id:   "431002000000",
		},
		{
			City: "郴州市",
			Name: "苏仙区",
			Id:   "431003000000",
		},
		{
			City: "郴州市",
			Name: "桂阳县",
			Id:   "431021000000",
		},
		{
			City: "郴州市",
			Name: "宜章县",
			Id:   "431022000000",
		},
		{
			City: "郴州市",
			Name: "永兴县",
			Id:   "431023000000",
		},
		{
			City: "郴州市",
			Name: "嘉禾县",
			Id:   "431024000000",
		},
		{
			City: "郴州市",
			Name: "临武县",
			Id:   "431025000000",
		},
		{
			City: "郴州市",
			Name: "汝城县",
			Id:   "431026000000",
		},
		{
			City: "郴州市",
			Name: "桂东县",
			Id:   "431027000000",
		},
		{
			City: "郴州市",
			Name: "安仁县",
			Id:   "431028000000",
		},
		{
			City: "郴州市",
			Name: "资兴市",
			Id:   "431081000000",
		},
	},
	"431100000000": {
		{
			City: "永州市",
			Name: "市辖区",
			Id:   "431101000000",
		},
		{
			City: "永州市",
			Name: "零陵区",
			Id:   "431102000000",
		},
		{
			City: "永州市",
			Name: "冷水滩区",
			Id:   "431103000000",
		},
		{
			City: "永州市",
			Name: "祁阳县",
			Id:   "431121000000",
		},
		{
			City: "永州市",
			Name: "东安县",
			Id:   "431122000000",
		},
		{
			City: "永州市",
			Name: "双牌县",
			Id:   "431123000000",
		},
		{
			City: "永州市",
			Name: "道县",
			Id:   "431124000000",
		},
		{
			City: "永州市",
			Name: "江永县",
			Id:   "431125000000",
		},
		{
			City: "永州市",
			Name: "宁远县",
			Id:   "431126000000",
		},
		{
			City: "永州市",
			Name: "蓝山县",
			Id:   "431127000000",
		},
		{
			City: "永州市",
			Name: "新田县",
			Id:   "431128000000",
		},
		{
			City: "永州市",
			Name: "江华瑶族自治县",
			Id:   "431129000000",
		},
		{
			City: "永州市",
			Name: "永州经济技术开发区",
			Id:   "431171000000",
		},
		{
			City: "永州市",
			Name: "永州市金洞管理区",
			Id:   "431172000000",
		},
		{
			City: "永州市",
			Name: "永州市回龙圩管理区",
			Id:   "431173000000",
		},
	},
	"431200000000": {
		{
			City: "怀化市",
			Name: "市辖区",
			Id:   "431201000000",
		},
		{
			City: "怀化市",
			Name: "鹤城区",
			Id:   "431202000000",
		},
		{
			City: "怀化市",
			Name: "中方县",
			Id:   "431221000000",
		},
		{
			City: "怀化市",
			Name: "沅陵县",
			Id:   "431222000000",
		},
		{
			City: "怀化市",
			Name: "辰溪县",
			Id:   "431223000000",
		},
		{
			City: "怀化市",
			Name: "溆浦县",
			Id:   "431224000000",
		},
		{
			City: "怀化市",
			Name: "会同县",
			Id:   "431225000000",
		},
		{
			City: "怀化市",
			Name: "麻阳苗族自治县",
			Id:   "431226000000",
		},
		{
			City: "怀化市",
			Name: "新晃侗族自治县",
			Id:   "431227000000",
		},
		{
			City: "怀化市",
			Name: "芷江侗族自治县",
			Id:   "431228000000",
		},
		{
			City: "怀化市",
			Name: "靖州苗族侗族自治县",
			Id:   "431229000000",
		},
		{
			City: "怀化市",
			Name: "通道侗族自治县",
			Id:   "431230000000",
		},
		{
			City: "怀化市",
			Name: "怀化市洪江管理区",
			Id:   "431271000000",
		},
		{
			City: "怀化市",
			Name: "洪江市",
			Id:   "431281000000",
		},
	},
	"431300000000": {
		{
			City: "娄底市",
			Name: "市辖区",
			Id:   "431301000000",
		},
		{
			City: "娄底市",
			Name: "娄星区",
			Id:   "431302000000",
		},
		{
			City: "娄底市",
			Name: "双峰县",
			Id:   "431321000000",
		},
		{
			City: "娄底市",
			Name: "新化县",
			Id:   "431322000000",
		},
		{
			City: "娄底市",
			Name: "冷水江市",
			Id:   "431381000000",
		},
		{
			City: "娄底市",
			Name: "涟源市",
			Id:   "431382000000",
		},
	},
	"433100000000": {
		{
			City: "湘西土家族苗族自治州",
			Name: "吉首市",
			Id:   "433101000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "泸溪县",
			Id:   "433122000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "凤凰县",
			Id:   "433123000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "花垣县",
			Id:   "433124000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "保靖县",
			Id:   "433125000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "古丈县",
			Id:   "433126000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "永顺县",
			Id:   "433127000000",
		},
		{
			City: "湘西土家族苗族自治州",
			Name: "龙山县",
			Id:   "433130000000",
		},
	},
	"440100000000": {
		{
			City: "广州市",
			Name: "市辖区",
			Id:   "440101000000",
		},
		{
			City: "广州市",
			Name: "荔湾区",
			Id:   "440103000000",
		},
		{
			City: "广州市",
			Name: "越秀区",
			Id:   "440104000000",
		},
		{
			City: "广州市",
			Name: "海珠区",
			Id:   "440105000000",
		},
		{
			City: "广州市",
			Name: "天河区",
			Id:   "440106000000",
		},
		{
			City: "广州市",
			Name: "白云区",
			Id:   "440111000000",
		},
		{
			City: "广州市",
			Name: "黄埔区",
			Id:   "440112000000",
		},
		{
			City: "广州市",
			Name: "番禺区",
			Id:   "440113000000",
		},
		{
			City: "广州市",
			Name: "花都区",
			Id:   "440114000000",
		},
		{
			City: "广州市",
			Name: "南沙区",
			Id:   "440115000000",
		},
		{
			City: "广州市",
			Name: "从化区",
			Id:   "440117000000",
		},
		{
			City: "广州市",
			Name: "增城区",
			Id:   "440118000000",
		},
	},
	"440200000000": {
		{
			City: "韶关市",
			Name: "市辖区",
			Id:   "440201000000",
		},
		{
			City: "韶关市",
			Name: "武江区",
			Id:   "440203000000",
		},
		{
			City: "韶关市",
			Name: "浈江区",
			Id:   "440204000000",
		},
		{
			City: "韶关市",
			Name: "曲江区",
			Id:   "440205000000",
		},
		{
			City: "韶关市",
			Name: "始兴县",
			Id:   "440222000000",
		},
		{
			City: "韶关市",
			Name: "仁化县",
			Id:   "440224000000",
		},
		{
			City: "韶关市",
			Name: "翁源县",
			Id:   "440229000000",
		},
		{
			City: "韶关市",
			Name: "乳源瑶族自治县",
			Id:   "440232000000",
		},
		{
			City: "韶关市",
			Name: "新丰县",
			Id:   "440233000000",
		},
		{
			City: "韶关市",
			Name: "乐昌市",
			Id:   "440281000000",
		},
		{
			City: "韶关市",
			Name: "南雄市",
			Id:   "440282000000",
		},
	},
	"440300000000": {
		{
			City: "深圳市",
			Name: "市辖区",
			Id:   "440301000000",
		},
		{
			City: "深圳市",
			Name: "罗湖区",
			Id:   "440303000000",
		},
		{
			City: "深圳市",
			Name: "福田区",
			Id:   "440304000000",
		},
		{
			City: "深圳市",
			Name: "南山区",
			Id:   "440305000000",
		},
		{
			City: "深圳市",
			Name: "宝安区",
			Id:   "440306000000",
		},
		{
			City: "深圳市",
			Name: "龙岗区",
			Id:   "440307000000",
		},
		{
			City: "深圳市",
			Name: "盐田区",
			Id:   "440308000000",
		},
		{
			City: "深圳市",
			Name: "龙华区",
			Id:   "440309000000",
		},
		{
			City: "深圳市",
			Name: "坪山区",
			Id:   "440310000000",
		},
		{
			City: "深圳市",
			Name: "光明区",
			Id:   "440311000000",
		},
	},
	"440400000000": {
		{
			City: "珠海市",
			Name: "市辖区",
			Id:   "440401000000",
		},
		{
			City: "珠海市",
			Name: "香洲区",
			Id:   "440402000000",
		},
		{
			City: "珠海市",
			Name: "斗门区",
			Id:   "440403000000",
		},
		{
			City: "珠海市",
			Name: "金湾区",
			Id:   "440404000000",
		},
	},
	"440500000000": {
		{
			City: "汕头市",
			Name: "市辖区",
			Id:   "440501000000",
		},
		{
			City: "汕头市",
			Name: "龙湖区",
			Id:   "440507000000",
		},
		{
			City: "汕头市",
			Name: "金平区",
			Id:   "440511000000",
		},
		{
			City: "汕头市",
			Name: "濠江区",
			Id:   "440512000000",
		},
		{
			City: "汕头市",
			Name: "潮阳区",
			Id:   "440513000000",
		},
		{
			City: "汕头市",
			Name: "潮南区",
			Id:   "440514000000",
		},
		{
			City: "汕头市",
			Name: "澄海区",
			Id:   "440515000000",
		},
		{
			City: "汕头市",
			Name: "南澳县",
			Id:   "440523000000",
		},
	},
	"440600000000": {
		{
			City: "佛山市",
			Name: "市辖区",
			Id:   "440601000000",
		},
		{
			City: "佛山市",
			Name: "禅城区",
			Id:   "440604000000",
		},
		{
			City: "佛山市",
			Name: "南海区",
			Id:   "440605000000",
		},
		{
			City: "佛山市",
			Name: "顺德区",
			Id:   "440606000000",
		},
		{
			City: "佛山市",
			Name: "三水区",
			Id:   "440607000000",
		},
		{
			City: "佛山市",
			Name: "高明区",
			Id:   "440608000000",
		},
	},
	"440700000000": {
		{
			City: "江门市",
			Name: "市辖区",
			Id:   "440701000000",
		},
		{
			City: "江门市",
			Name: "蓬江区",
			Id:   "440703000000",
		},
		{
			City: "江门市",
			Name: "江海区",
			Id:   "440704000000",
		},
		{
			City: "江门市",
			Name: "新会区",
			Id:   "440705000000",
		},
		{
			City: "江门市",
			Name: "台山市",
			Id:   "440781000000",
		},
		{
			City: "江门市",
			Name: "开平市",
			Id:   "440783000000",
		},
		{
			City: "江门市",
			Name: "鹤山市",
			Id:   "440784000000",
		},
		{
			City: "江门市",
			Name: "恩平市",
			Id:   "440785000000",
		},
	},
	"440800000000": {
		{
			City: "湛江市",
			Name: "市辖区",
			Id:   "440801000000",
		},
		{
			City: "湛江市",
			Name: "赤坎区",
			Id:   "440802000000",
		},
		{
			City: "湛江市",
			Name: "霞山区",
			Id:   "440803000000",
		},
		{
			City: "湛江市",
			Name: "坡头区",
			Id:   "440804000000",
		},
		{
			City: "湛江市",
			Name: "麻章区",
			Id:   "440811000000",
		},
		{
			City: "湛江市",
			Name: "遂溪县",
			Id:   "440823000000",
		},
		{
			City: "湛江市",
			Name: "徐闻县",
			Id:   "440825000000",
		},
		{
			City: "湛江市",
			Name: "廉江市",
			Id:   "440881000000",
		},
		{
			City: "湛江市",
			Name: "雷州市",
			Id:   "440882000000",
		},
		{
			City: "湛江市",
			Name: "吴川市",
			Id:   "440883000000",
		},
	},
	"440900000000": {
		{
			City: "茂名市",
			Name: "市辖区",
			Id:   "440901000000",
		},
		{
			City: "茂名市",
			Name: "茂南区",
			Id:   "440902000000",
		},
		{
			City: "茂名市",
			Name: "电白区",
			Id:   "440904000000",
		},
		{
			City: "茂名市",
			Name: "高州市",
			Id:   "440981000000",
		},
		{
			City: "茂名市",
			Name: "化州市",
			Id:   "440982000000",
		},
		{
			City: "茂名市",
			Name: "信宜市",
			Id:   "440983000000",
		},
	},
	"441200000000": {
		{
			City: "肇庆市",
			Name: "市辖区",
			Id:   "441201000000",
		},
		{
			City: "肇庆市",
			Name: "端州区",
			Id:   "441202000000",
		},
		{
			City: "肇庆市",
			Name: "鼎湖区",
			Id:   "441203000000",
		},
		{
			City: "肇庆市",
			Name: "高要区",
			Id:   "441204000000",
		},
		{
			City: "肇庆市",
			Name: "广宁县",
			Id:   "441223000000",
		},
		{
			City: "肇庆市",
			Name: "怀集县",
			Id:   "441224000000",
		},
		{
			City: "肇庆市",
			Name: "封开县",
			Id:   "441225000000",
		},
		{
			City: "肇庆市",
			Name: "德庆县",
			Id:   "441226000000",
		},
		{
			City: "肇庆市",
			Name: "四会市",
			Id:   "441284000000",
		},
	},
	"441300000000": {
		{
			City: "惠州市",
			Name: "市辖区",
			Id:   "441301000000",
		},
		{
			City: "惠州市",
			Name: "惠城区",
			Id:   "441302000000",
		},
		{
			City: "惠州市",
			Name: "惠阳区",
			Id:   "441303000000",
		},
		{
			City: "惠州市",
			Name: "博罗县",
			Id:   "441322000000",
		},
		{
			City: "惠州市",
			Name: "惠东县",
			Id:   "441323000000",
		},
		{
			City: "惠州市",
			Name: "龙门县",
			Id:   "441324000000",
		},
	},
	"441400000000": {
		{
			City: "梅州市",
			Name: "市辖区",
			Id:   "441401000000",
		},
		{
			City: "梅州市",
			Name: "梅江区",
			Id:   "441402000000",
		},
		{
			City: "梅州市",
			Name: "梅县区",
			Id:   "441403000000",
		},
		{
			City: "梅州市",
			Name: "大埔县",
			Id:   "441422000000",
		},
		{
			City: "梅州市",
			Name: "丰顺县",
			Id:   "441423000000",
		},
		{
			City: "梅州市",
			Name: "五华县",
			Id:   "441424000000",
		},
		{
			City: "梅州市",
			Name: "平远县",
			Id:   "441426000000",
		},
		{
			City: "梅州市",
			Name: "蕉岭县",
			Id:   "441427000000",
		},
		{
			City: "梅州市",
			Name: "兴宁市",
			Id:   "441481000000",
		},
	},
	"441500000000": {
		{
			City: "汕尾市",
			Name: "市辖区",
			Id:   "441501000000",
		},
		{
			City: "汕尾市",
			Name: "城区",
			Id:   "441502000000",
		},
		{
			City: "汕尾市",
			Name: "海丰县",
			Id:   "441521000000",
		},
		{
			City: "汕尾市",
			Name: "陆河县",
			Id:   "441523000000",
		},
		{
			City: "汕尾市",
			Name: "陆丰市",
			Id:   "441581000000",
		},
	},
	"441600000000": {
		{
			City: "河源市",
			Name: "市辖区",
			Id:   "441601000000",
		},
		{
			City: "河源市",
			Name: "源城区",
			Id:   "441602000000",
		},
		{
			City: "河源市",
			Name: "紫金县",
			Id:   "441621000000",
		},
		{
			City: "河源市",
			Name: "龙川县",
			Id:   "441622000000",
		},
		{
			City: "河源市",
			Name: "连平县",
			Id:   "441623000000",
		},
		{
			City: "河源市",
			Name: "和平县",
			Id:   "441624000000",
		},
		{
			City: "河源市",
			Name: "东源县",
			Id:   "441625000000",
		},
	},
	"441700000000": {
		{
			City: "阳江市",
			Name: "市辖区",
			Id:   "441701000000",
		},
		{
			City: "阳江市",
			Name: "江城区",
			Id:   "441702000000",
		},
		{
			City: "阳江市",
			Name: "阳东区",
			Id:   "441704000000",
		},
		{
			City: "阳江市",
			Name: "阳西县",
			Id:   "441721000000",
		},
		{
			City: "阳江市",
			Name: "阳春市",
			Id:   "441781000000",
		},
	},
	"441800000000": {
		{
			City: "清远市",
			Name: "市辖区",
			Id:   "441801000000",
		},
		{
			City: "清远市",
			Name: "清城区",
			Id:   "441802000000",
		},
		{
			City: "清远市",
			Name: "清新区",
			Id:   "441803000000",
		},
		{
			City: "清远市",
			Name: "佛冈县",
			Id:   "441821000000",
		},
		{
			City: "清远市",
			Name: "阳山县",
			Id:   "441823000000",
		},
		{
			City: "清远市",
			Name: "连山壮族瑶族自治县",
			Id:   "441825000000",
		},
		{
			City: "清远市",
			Name: "连南瑶族自治县",
			Id:   "441826000000",
		},
		{
			City: "清远市",
			Name: "英德市",
			Id:   "441881000000",
		},
		{
			City: "清远市",
			Name: "连州市",
			Id:   "441882000000",
		},
	},
	"445100000000": {
		{
			City: "潮州市",
			Name: "市辖区",
			Id:   "445101000000",
		},
		{
			City: "潮州市",
			Name: "湘桥区",
			Id:   "445102000000",
		},
		{
			City: "潮州市",
			Name: "潮安区",
			Id:   "445103000000",
		},
		{
			City: "潮州市",
			Name: "饶平县",
			Id:   "445122000000",
		},
	},
	"445200000000": {
		{
			City: "揭阳市",
			Name: "市辖区",
			Id:   "445201000000",
		},
		{
			City: "揭阳市",
			Name: "榕城区",
			Id:   "445202000000",
		},
		{
			City: "揭阳市",
			Name: "揭东区",
			Id:   "445203000000",
		},
		{
			City: "揭阳市",
			Name: "揭西县",
			Id:   "445222000000",
		},
		{
			City: "揭阳市",
			Name: "惠来县",
			Id:   "445224000000",
		},
		{
			City: "揭阳市",
			Name: "普宁市",
			Id:   "445281000000",
		},
	},
	"445300000000": {
		{
			City: "云浮市",
			Name: "市辖区",
			Id:   "445301000000",
		},
		{
			City: "云浮市",
			Name: "云城区",
			Id:   "445302000000",
		},
		{
			City: "云浮市",
			Name: "云安区",
			Id:   "445303000000",
		},
		{
			City: "云浮市",
			Name: "新兴县",
			Id:   "445321000000",
		},
		{
			City: "云浮市",
			Name: "郁南县",
			Id:   "445322000000",
		},
		{
			City: "云浮市",
			Name: "罗定市",
			Id:   "445381000000",
		},
	},
	"450100000000": {
		{
			City: "南宁市",
			Name: "市辖区",
			Id:   "450101000000",
		},
		{
			City: "南宁市",
			Name: "兴宁区",
			Id:   "450102000000",
		},
		{
			City: "南宁市",
			Name: "青秀区",
			Id:   "450103000000",
		},
		{
			City: "南宁市",
			Name: "江南区",
			Id:   "450105000000",
		},
		{
			City: "南宁市",
			Name: "西乡塘区",
			Id:   "450107000000",
		},
		{
			City: "南宁市",
			Name: "良庆区",
			Id:   "450108000000",
		},
		{
			City: "南宁市",
			Name: "邕宁区",
			Id:   "450109000000",
		},
		{
			City: "南宁市",
			Name: "武鸣区",
			Id:   "450110000000",
		},
		{
			City: "南宁市",
			Name: "隆安县",
			Id:   "450123000000",
		},
		{
			City: "南宁市",
			Name: "马山县",
			Id:   "450124000000",
		},
		{
			City: "南宁市",
			Name: "上林县",
			Id:   "450125000000",
		},
		{
			City: "南宁市",
			Name: "宾阳县",
			Id:   "450126000000",
		},
		{
			City: "南宁市",
			Name: "横县",
			Id:   "450127000000",
		},
	},
	"450200000000": {
		{
			City: "柳州市",
			Name: "市辖区",
			Id:   "450201000000",
		},
		{
			City: "柳州市",
			Name: "城中区",
			Id:   "450202000000",
		},
		{
			City: "柳州市",
			Name: "鱼峰区",
			Id:   "450203000000",
		},
		{
			City: "柳州市",
			Name: "柳南区",
			Id:   "450204000000",
		},
		{
			City: "柳州市",
			Name: "柳北区",
			Id:   "450205000000",
		},
		{
			City: "柳州市",
			Name: "柳江区",
			Id:   "450206000000",
		},
		{
			City: "柳州市",
			Name: "柳城县",
			Id:   "450222000000",
		},
		{
			City: "柳州市",
			Name: "鹿寨县",
			Id:   "450223000000",
		},
		{
			City: "柳州市",
			Name: "融安县",
			Id:   "450224000000",
		},
		{
			City: "柳州市",
			Name: "融水苗族自治县",
			Id:   "450225000000",
		},
		{
			City: "柳州市",
			Name: "三江侗族自治县",
			Id:   "450226000000",
		},
	},
	"450300000000": {
		{
			City: "桂林市",
			Name: "市辖区",
			Id:   "450301000000",
		},
		{
			City: "桂林市",
			Name: "秀峰区",
			Id:   "450302000000",
		},
		{
			City: "桂林市",
			Name: "叠彩区",
			Id:   "450303000000",
		},
		{
			City: "桂林市",
			Name: "象山区",
			Id:   "450304000000",
		},
		{
			City: "桂林市",
			Name: "七星区",
			Id:   "450305000000",
		},
		{
			City: "桂林市",
			Name: "雁山区",
			Id:   "450311000000",
		},
		{
			City: "桂林市",
			Name: "临桂区",
			Id:   "450312000000",
		},
		{
			City: "桂林市",
			Name: "阳朔县",
			Id:   "450321000000",
		},
		{
			City: "桂林市",
			Name: "灵川县",
			Id:   "450323000000",
		},
		{
			City: "桂林市",
			Name: "全州县",
			Id:   "450324000000",
		},
		{
			City: "桂林市",
			Name: "兴安县",
			Id:   "450325000000",
		},
		{
			City: "桂林市",
			Name: "永福县",
			Id:   "450326000000",
		},
		{
			City: "桂林市",
			Name: "灌阳县",
			Id:   "450327000000",
		},
		{
			City: "桂林市",
			Name: "龙胜各族自治县",
			Id:   "450328000000",
		},
		{
			City: "桂林市",
			Name: "资源县",
			Id:   "450329000000",
		},
		{
			City: "桂林市",
			Name: "平乐县",
			Id:   "450330000000",
		},
		{
			City: "桂林市",
			Name: "恭城瑶族自治县",
			Id:   "450332000000",
		},
		{
			City: "桂林市",
			Name: "荔浦市",
			Id:   "450381000000",
		},
	},
	"450400000000": {
		{
			City: "梧州市",
			Name: "市辖区",
			Id:   "450401000000",
		},
		{
			City: "梧州市",
			Name: "万秀区",
			Id:   "450403000000",
		},
		{
			City: "梧州市",
			Name: "长洲区",
			Id:   "450405000000",
		},
		{
			City: "梧州市",
			Name: "龙圩区",
			Id:   "450406000000",
		},
		{
			City: "梧州市",
			Name: "苍梧县",
			Id:   "450421000000",
		},
		{
			City: "梧州市",
			Name: "藤县",
			Id:   "450422000000",
		},
		{
			City: "梧州市",
			Name: "蒙山县",
			Id:   "450423000000",
		},
		{
			City: "梧州市",
			Name: "岑溪市",
			Id:   "450481000000",
		},
	},
	"450500000000": {
		{
			City: "北海市",
			Name: "市辖区",
			Id:   "450501000000",
		},
		{
			City: "北海市",
			Name: "海城区",
			Id:   "450502000000",
		},
		{
			City: "北海市",
			Name: "银海区",
			Id:   "450503000000",
		},
		{
			City: "北海市",
			Name: "铁山港区",
			Id:   "450512000000",
		},
		{
			City: "北海市",
			Name: "合浦县",
			Id:   "450521000000",
		},
	},
	"450600000000": {
		{
			City: "防城港市",
			Name: "市辖区",
			Id:   "450601000000",
		},
		{
			City: "防城港市",
			Name: "港口区",
			Id:   "450602000000",
		},
		{
			City: "防城港市",
			Name: "防城区",
			Id:   "450603000000",
		},
		{
			City: "防城港市",
			Name: "上思县",
			Id:   "450621000000",
		},
		{
			City: "防城港市",
			Name: "东兴市",
			Id:   "450681000000",
		},
	},
	"450700000000": {
		{
			City: "钦州市",
			Name: "市辖区",
			Id:   "450701000000",
		},
		{
			City: "钦州市",
			Name: "钦南区",
			Id:   "450702000000",
		},
		{
			City: "钦州市",
			Name: "钦北区",
			Id:   "450703000000",
		},
		{
			City: "钦州市",
			Name: "灵山县",
			Id:   "450721000000",
		},
		{
			City: "钦州市",
			Name: "浦北县",
			Id:   "450722000000",
		},
	},
	"450800000000": {
		{
			City: "贵港市",
			Name: "市辖区",
			Id:   "450801000000",
		},
		{
			City: "贵港市",
			Name: "港北区",
			Id:   "450802000000",
		},
		{
			City: "贵港市",
			Name: "港南区",
			Id:   "450803000000",
		},
		{
			City: "贵港市",
			Name: "覃塘区",
			Id:   "450804000000",
		},
		{
			City: "贵港市",
			Name: "平南县",
			Id:   "450821000000",
		},
		{
			City: "贵港市",
			Name: "桂平市",
			Id:   "450881000000",
		},
	},
	"450900000000": {
		{
			City: "玉林市",
			Name: "市辖区",
			Id:   "450901000000",
		},
		{
			City: "玉林市",
			Name: "玉州区",
			Id:   "450902000000",
		},
		{
			City: "玉林市",
			Name: "福绵区",
			Id:   "450903000000",
		},
		{
			City: "玉林市",
			Name: "容县",
			Id:   "450921000000",
		},
		{
			City: "玉林市",
			Name: "陆川县",
			Id:   "450922000000",
		},
		{
			City: "玉林市",
			Name: "博白县",
			Id:   "450923000000",
		},
		{
			City: "玉林市",
			Name: "兴业县",
			Id:   "450924000000",
		},
		{
			City: "玉林市",
			Name: "北流市",
			Id:   "450981000000",
		},
	},
	"451000000000": {
		{
			City: "百色市",
			Name: "市辖区",
			Id:   "451001000000",
		},
		{
			City: "百色市",
			Name: "右江区",
			Id:   "451002000000",
		},
		{
			City: "百色市",
			Name: "田阳区",
			Id:   "451003000000",
		},
		{
			City: "百色市",
			Name: "田东县",
			Id:   "451022000000",
		},
		{
			City: "百色市",
			Name: "德保县",
			Id:   "451024000000",
		},
		{
			City: "百色市",
			Name: "那坡县",
			Id:   "451026000000",
		},
		{
			City: "百色市",
			Name: "凌云县",
			Id:   "451027000000",
		},
		{
			City: "百色市",
			Name: "乐业县",
			Id:   "451028000000",
		},
		{
			City: "百色市",
			Name: "田林县",
			Id:   "451029000000",
		},
		{
			City: "百色市",
			Name: "西林县",
			Id:   "451030000000",
		},
		{
			City: "百色市",
			Name: "隆林各族自治县",
			Id:   "451031000000",
		},
		{
			City: "百色市",
			Name: "靖西市",
			Id:   "451081000000",
		},
		{
			City: "百色市",
			Name: "平果市",
			Id:   "451082000000",
		},
	},
	"451100000000": {
		{
			City: "贺州市",
			Name: "市辖区",
			Id:   "451101000000",
		},
		{
			City: "贺州市",
			Name: "八步区",
			Id:   "451102000000",
		},
		{
			City: "贺州市",
			Name: "平桂区",
			Id:   "451103000000",
		},
		{
			City: "贺州市",
			Name: "昭平县",
			Id:   "451121000000",
		},
		{
			City: "贺州市",
			Name: "钟山县",
			Id:   "451122000000",
		},
		{
			City: "贺州市",
			Name: "富川瑶族自治县",
			Id:   "451123000000",
		},
	},
	"451200000000": {
		{
			City: "河池市",
			Name: "市辖区",
			Id:   "451201000000",
		},
		{
			City: "河池市",
			Name: "金城江区",
			Id:   "451202000000",
		},
		{
			City: "河池市",
			Name: "宜州区",
			Id:   "451203000000",
		},
		{
			City: "河池市",
			Name: "南丹县",
			Id:   "451221000000",
		},
		{
			City: "河池市",
			Name: "天峨县",
			Id:   "451222000000",
		},
		{
			City: "河池市",
			Name: "凤山县",
			Id:   "451223000000",
		},
		{
			City: "河池市",
			Name: "东兰县",
			Id:   "451224000000",
		},
		{
			City: "河池市",
			Name: "罗城仫佬族自治县",
			Id:   "451225000000",
		},
		{
			City: "河池市",
			Name: "环江毛南族自治县",
			Id:   "451226000000",
		},
		{
			City: "河池市",
			Name: "巴马瑶族自治县",
			Id:   "451227000000",
		},
		{
			City: "河池市",
			Name: "都安瑶族自治县",
			Id:   "451228000000",
		},
		{
			City: "河池市",
			Name: "大化瑶族自治县",
			Id:   "451229000000",
		},
	},
	"451300000000": {
		{
			City: "来宾市",
			Name: "市辖区",
			Id:   "451301000000",
		},
		{
			City: "来宾市",
			Name: "兴宾区",
			Id:   "451302000000",
		},
		{
			City: "来宾市",
			Name: "忻城县",
			Id:   "451321000000",
		},
		{
			City: "来宾市",
			Name: "象州县",
			Id:   "451322000000",
		},
		{
			City: "来宾市",
			Name: "武宣县",
			Id:   "451323000000",
		},
		{
			City: "来宾市",
			Name: "金秀瑶族自治县",
			Id:   "451324000000",
		},
		{
			City: "来宾市",
			Name: "合山市",
			Id:   "451381000000",
		},
	},
	"451400000000": {
		{
			City: "崇左市",
			Name: "市辖区",
			Id:   "451401000000",
		},
		{
			City: "崇左市",
			Name: "江州区",
			Id:   "451402000000",
		},
		{
			City: "崇左市",
			Name: "扶绥县",
			Id:   "451421000000",
		},
		{
			City: "崇左市",
			Name: "宁明县",
			Id:   "451422000000",
		},
		{
			City: "崇左市",
			Name: "龙州县",
			Id:   "451423000000",
		},
		{
			City: "崇左市",
			Name: "大新县",
			Id:   "451424000000",
		},
		{
			City: "崇左市",
			Name: "天等县",
			Id:   "451425000000",
		},
		{
			City: "崇左市",
			Name: "凭祥市",
			Id:   "451481000000",
		},
	},
	"460100000000": {
		{
			City: "海口市",
			Name: "市辖区",
			Id:   "460101000000",
		},
		{
			City: "海口市",
			Name: "秀英区",
			Id:   "460105000000",
		},
		{
			City: "海口市",
			Name: "龙华区",
			Id:   "460106000000",
		},
		{
			City: "海口市",
			Name: "琼山区",
			Id:   "460107000000",
		},
		{
			City: "海口市",
			Name: "美兰区",
			Id:   "460108000000",
		},
	},
	"460200000000": {
		{
			City: "三亚市",
			Name: "市辖区",
			Id:   "460201000000",
		},
		{
			City: "三亚市",
			Name: "海棠区",
			Id:   "460202000000",
		},
		{
			City: "三亚市",
			Name: "吉阳区",
			Id:   "460203000000",
		},
		{
			City: "三亚市",
			Name: "天涯区",
			Id:   "460204000000",
		},
		{
			City: "三亚市",
			Name: "崖州区",
			Id:   "460205000000",
		},
	},
	"460300000000": {
		{
			City: "三沙市",
			Name: "西沙群岛",
			Id:   "460321000000",
		},
		{
			City: "三沙市",
			Name: "南沙群岛",
			Id:   "460322000000",
		},
		{
			City: "三沙市",
			Name: "中沙群岛的岛礁及其海域",
			Id:   "460323000000",
		},
	},
	"469000000000": {
		{
			City: "省直辖县级行政区划",
			Name: "五指山市",
			Id:   "469001000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "琼海市",
			Id:   "469002000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "文昌市",
			Id:   "469005000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "万宁市",
			Id:   "469006000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "东方市",
			Id:   "469007000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "定安县",
			Id:   "469021000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "屯昌县",
			Id:   "469022000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "澄迈县",
			Id:   "469023000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "临高县",
			Id:   "469024000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "白沙黎族自治县",
			Id:   "469025000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "昌江黎族自治县",
			Id:   "469026000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "乐东黎族自治县",
			Id:   "469027000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "陵水黎族自治县",
			Id:   "469028000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "保亭黎族苗族自治县",
			Id:   "469029000000",
		},
		{
			City: "省直辖县级行政区划",
			Name: "琼中黎族苗族自治县",
			Id:   "469030000000",
		},
	},
	"500100000000": {
		{
			City: "市辖区",
			Name: "万州区",
			Id:   "500101000000",
		},
		{
			City: "市辖区",
			Name: "涪陵区",
			Id:   "500102000000",
		},
		{
			City: "市辖区",
			Name: "渝中区",
			Id:   "500103000000",
		},
		{
			City: "市辖区",
			Name: "大渡口区",
			Id:   "500104000000",
		},
		{
			City: "市辖区",
			Name: "江北区",
			Id:   "500105000000",
		},
		{
			City: "市辖区",
			Name: "沙坪坝区",
			Id:   "500106000000",
		},
		{
			City: "市辖区",
			Name: "九龙坡区",
			Id:   "500107000000",
		},
		{
			City: "市辖区",
			Name: "南岸区",
			Id:   "500108000000",
		},
		{
			City: "市辖区",
			Name: "北碚区",
			Id:   "500109000000",
		},
		{
			City: "市辖区",
			Name: "綦江区",
			Id:   "500110000000",
		},
		{
			City: "市辖区",
			Name: "大足区",
			Id:   "500111000000",
		},
		{
			City: "市辖区",
			Name: "渝北区",
			Id:   "500112000000",
		},
		{
			City: "市辖区",
			Name: "巴南区",
			Id:   "500113000000",
		},
		{
			City: "市辖区",
			Name: "黔江区",
			Id:   "500114000000",
		},
		{
			City: "市辖区",
			Name: "长寿区",
			Id:   "500115000000",
		},
		{
			City: "市辖区",
			Name: "江津区",
			Id:   "500116000000",
		},
		{
			City: "市辖区",
			Name: "合川区",
			Id:   "500117000000",
		},
		{
			City: "市辖区",
			Name: "永川区",
			Id:   "500118000000",
		},
		{
			City: "市辖区",
			Name: "南川区",
			Id:   "500119000000",
		},
		{
			City: "市辖区",
			Name: "璧山区",
			Id:   "500120000000",
		},
		{
			City: "市辖区",
			Name: "铜梁区",
			Id:   "500151000000",
		},
		{
			City: "市辖区",
			Name: "潼南区",
			Id:   "500152000000",
		},
		{
			City: "市辖区",
			Name: "荣昌区",
			Id:   "500153000000",
		},
		{
			City: "市辖区",
			Name: "开州区",
			Id:   "500154000000",
		},
		{
			City: "市辖区",
			Name: "梁平区",
			Id:   "500155000000",
		},
		{
			City: "市辖区",
			Name: "武隆区",
			Id:   "500156000000",
		},
	},
	"500200000000": {
		{
			City: "县",
			Name: "城口县",
			Id:   "500229000000",
		},
		{
			City: "县",
			Name: "丰都县",
			Id:   "500230000000",
		},
		{
			City: "县",
			Name: "垫江县",
			Id:   "500231000000",
		},
		{
			City: "县",
			Name: "忠县",
			Id:   "500233000000",
		},
		{
			City: "县",
			Name: "云阳县",
			Id:   "500235000000",
		},
		{
			City: "县",
			Name: "奉节县",
			Id:   "500236000000",
		},
		{
			City: "县",
			Name: "巫山县",
			Id:   "500237000000",
		},
		{
			City: "县",
			Name: "巫溪县",
			Id:   "500238000000",
		},
		{
			City: "县",
			Name: "石柱土家族自治县",
			Id:   "500240000000",
		},
		{
			City: "县",
			Name: "秀山土家族苗族自治县",
			Id:   "500241000000",
		},
		{
			City: "县",
			Name: "酉阳土家族苗族自治县",
			Id:   "500242000000",
		},
		{
			City: "县",
			Name: "彭水苗族土家族自治县",
			Id:   "500243000000",
		},
	},
	"510100000000": {
		{
			City: "成都市",
			Name: "市辖区",
			Id:   "510101000000",
		},
		{
			City: "成都市",
			Name: "锦江区",
			Id:   "510104000000",
		},
		{
			City: "成都市",
			Name: "青羊区",
			Id:   "510105000000",
		},
		{
			City: "成都市",
			Name: "金牛区",
			Id:   "510106000000",
		},
		{
			City: "成都市",
			Name: "武侯区",
			Id:   "510107000000",
		},
		{
			City: "成都市",
			Name: "成华区",
			Id:   "510108000000",
		},
		{
			City: "成都市",
			Name: "龙泉驿区",
			Id:   "510112000000",
		},
		{
			City: "成都市",
			Name: "青白江区",
			Id:   "510113000000",
		},
		{
			City: "成都市",
			Name: "新都区",
			Id:   "510114000000",
		},
		{
			City: "成都市",
			Name: "温江区",
			Id:   "510115000000",
		},
		{
			City: "成都市",
			Name: "双流区",
			Id:   "510116000000",
		},
		{
			City: "成都市",
			Name: "郫都区",
			Id:   "510117000000",
		},
		{
			City: "成都市",
			Name: "新津区",
			Id:   "510118000000",
		},
		{
			City: "成都市",
			Name: "金堂县",
			Id:   "510121000000",
		},
		{
			City: "成都市",
			Name: "大邑县",
			Id:   "510129000000",
		},
		{
			City: "成都市",
			Name: "蒲江县",
			Id:   "510131000000",
		},
		{
			City: "成都市",
			Name: "都江堰市",
			Id:   "510181000000",
		},
		{
			City: "成都市",
			Name: "彭州市",
			Id:   "510182000000",
		},
		{
			City: "成都市",
			Name: "邛崃市",
			Id:   "510183000000",
		},
		{
			City: "成都市",
			Name: "崇州市",
			Id:   "510184000000",
		},
		{
			City: "成都市",
			Name: "简阳市",
			Id:   "510185000000",
		},
	},
	"510300000000": {
		{
			City: "自贡市",
			Name: "市辖区",
			Id:   "510301000000",
		},
		{
			City: "自贡市",
			Name: "自流井区",
			Id:   "510302000000",
		},
		{
			City: "自贡市",
			Name: "贡井区",
			Id:   "510303000000",
		},
		{
			City: "自贡市",
			Name: "大安区",
			Id:   "510304000000",
		},
		{
			City: "自贡市",
			Name: "沿滩区",
			Id:   "510311000000",
		},
		{
			City: "自贡市",
			Name: "荣县",
			Id:   "510321000000",
		},
		{
			City: "自贡市",
			Name: "富顺县",
			Id:   "510322000000",
		},
	},
	"510400000000": {
		{
			City: "攀枝花市",
			Name: "市辖区",
			Id:   "510401000000",
		},
		{
			City: "攀枝花市",
			Name: "东区",
			Id:   "510402000000",
		},
		{
			City: "攀枝花市",
			Name: "西区",
			Id:   "510403000000",
		},
		{
			City: "攀枝花市",
			Name: "仁和区",
			Id:   "510411000000",
		},
		{
			City: "攀枝花市",
			Name: "米易县",
			Id:   "510421000000",
		},
		{
			City: "攀枝花市",
			Name: "盐边县",
			Id:   "510422000000",
		},
	},
	"510500000000": {
		{
			City: "泸州市",
			Name: "市辖区",
			Id:   "510501000000",
		},
		{
			City: "泸州市",
			Name: "江阳区",
			Id:   "510502000000",
		},
		{
			City: "泸州市",
			Name: "纳溪区",
			Id:   "510503000000",
		},
		{
			City: "泸州市",
			Name: "龙马潭区",
			Id:   "510504000000",
		},
		{
			City: "泸州市",
			Name: "泸县",
			Id:   "510521000000",
		},
		{
			City: "泸州市",
			Name: "合江县",
			Id:   "510522000000",
		},
		{
			City: "泸州市",
			Name: "叙永县",
			Id:   "510524000000",
		},
		{
			City: "泸州市",
			Name: "古蔺县",
			Id:   "510525000000",
		},
	},
	"510600000000": {
		{
			City: "德阳市",
			Name: "市辖区",
			Id:   "510601000000",
		},
		{
			City: "德阳市",
			Name: "旌阳区",
			Id:   "510603000000",
		},
		{
			City: "德阳市",
			Name: "罗江区",
			Id:   "510604000000",
		},
		{
			City: "德阳市",
			Name: "中江县",
			Id:   "510623000000",
		},
		{
			City: "德阳市",
			Name: "广汉市",
			Id:   "510681000000",
		},
		{
			City: "德阳市",
			Name: "什邡市",
			Id:   "510682000000",
		},
		{
			City: "德阳市",
			Name: "绵竹市",
			Id:   "510683000000",
		},
	},
	"510700000000": {
		{
			City: "绵阳市",
			Name: "市辖区",
			Id:   "510701000000",
		},
		{
			City: "绵阳市",
			Name: "涪城区",
			Id:   "510703000000",
		},
		{
			City: "绵阳市",
			Name: "游仙区",
			Id:   "510704000000",
		},
		{
			City: "绵阳市",
			Name: "安州区",
			Id:   "510705000000",
		},
		{
			City: "绵阳市",
			Name: "三台县",
			Id:   "510722000000",
		},
		{
			City: "绵阳市",
			Name: "盐亭县",
			Id:   "510723000000",
		},
		{
			City: "绵阳市",
			Name: "梓潼县",
			Id:   "510725000000",
		},
		{
			City: "绵阳市",
			Name: "北川羌族自治县",
			Id:   "510726000000",
		},
		{
			City: "绵阳市",
			Name: "平武县",
			Id:   "510727000000",
		},
		{
			City: "绵阳市",
			Name: "江油市",
			Id:   "510781000000",
		},
	},
	"510800000000": {
		{
			City: "广元市",
			Name: "市辖区",
			Id:   "510801000000",
		},
		{
			City: "广元市",
			Name: "利州区",
			Id:   "510802000000",
		},
		{
			City: "广元市",
			Name: "昭化区",
			Id:   "510811000000",
		},
		{
			City: "广元市",
			Name: "朝天区",
			Id:   "510812000000",
		},
		{
			City: "广元市",
			Name: "旺苍县",
			Id:   "510821000000",
		},
		{
			City: "广元市",
			Name: "青川县",
			Id:   "510822000000",
		},
		{
			City: "广元市",
			Name: "剑阁县",
			Id:   "510823000000",
		},
		{
			City: "广元市",
			Name: "苍溪县",
			Id:   "510824000000",
		},
	},
	"510900000000": {
		{
			City: "遂宁市",
			Name: "市辖区",
			Id:   "510901000000",
		},
		{
			City: "遂宁市",
			Name: "船山区",
			Id:   "510903000000",
		},
		{
			City: "遂宁市",
			Name: "安居区",
			Id:   "510904000000",
		},
		{
			City: "遂宁市",
			Name: "蓬溪县",
			Id:   "510921000000",
		},
		{
			City: "遂宁市",
			Name: "大英县",
			Id:   "510923000000",
		},
		{
			City: "遂宁市",
			Name: "射洪市",
			Id:   "510981000000",
		},
	},
	"511000000000": {
		{
			City: "内江市",
			Name: "市辖区",
			Id:   "511001000000",
		},
		{
			City: "内江市",
			Name: "市中区",
			Id:   "511002000000",
		},
		{
			City: "内江市",
			Name: "东兴区",
			Id:   "511011000000",
		},
		{
			City: "内江市",
			Name: "威远县",
			Id:   "511024000000",
		},
		{
			City: "内江市",
			Name: "资中县",
			Id:   "511025000000",
		},
		{
			City: "内江市",
			Name: "内江经济开发区",
			Id:   "511071000000",
		},
		{
			City: "内江市",
			Name: "隆昌市",
			Id:   "511083000000",
		},
	},
	"511100000000": {
		{
			City: "乐山市",
			Name: "市辖区",
			Id:   "511101000000",
		},
		{
			City: "乐山市",
			Name: "市中区",
			Id:   "511102000000",
		},
		{
			City: "乐山市",
			Name: "沙湾区",
			Id:   "511111000000",
		},
		{
			City: "乐山市",
			Name: "五通桥区",
			Id:   "511112000000",
		},
		{
			City: "乐山市",
			Name: "金口河区",
			Id:   "511113000000",
		},
		{
			City: "乐山市",
			Name: "犍为县",
			Id:   "511123000000",
		},
		{
			City: "乐山市",
			Name: "井研县",
			Id:   "511124000000",
		},
		{
			City: "乐山市",
			Name: "夹江县",
			Id:   "511126000000",
		},
		{
			City: "乐山市",
			Name: "沐川县",
			Id:   "511129000000",
		},
		{
			City: "乐山市",
			Name: "峨边彝族自治县",
			Id:   "511132000000",
		},
		{
			City: "乐山市",
			Name: "马边彝族自治县",
			Id:   "511133000000",
		},
		{
			City: "乐山市",
			Name: "峨眉山市",
			Id:   "511181000000",
		},
	},
	"511300000000": {
		{
			City: "南充市",
			Name: "市辖区",
			Id:   "511301000000",
		},
		{
			City: "南充市",
			Name: "顺庆区",
			Id:   "511302000000",
		},
		{
			City: "南充市",
			Name: "高坪区",
			Id:   "511303000000",
		},
		{
			City: "南充市",
			Name: "嘉陵区",
			Id:   "511304000000",
		},
		{
			City: "南充市",
			Name: "南部县",
			Id:   "511321000000",
		},
		{
			City: "南充市",
			Name: "营山县",
			Id:   "511322000000",
		},
		{
			City: "南充市",
			Name: "蓬安县",
			Id:   "511323000000",
		},
		{
			City: "南充市",
			Name: "仪陇县",
			Id:   "511324000000",
		},
		{
			City: "南充市",
			Name: "西充县",
			Id:   "511325000000",
		},
		{
			City: "南充市",
			Name: "阆中市",
			Id:   "511381000000",
		},
	},
	"511400000000": {
		{
			City: "眉山市",
			Name: "市辖区",
			Id:   "511401000000",
		},
		{
			City: "眉山市",
			Name: "东坡区",
			Id:   "511402000000",
		},
		{
			City: "眉山市",
			Name: "彭山区",
			Id:   "511403000000",
		},
		{
			City: "眉山市",
			Name: "仁寿县",
			Id:   "511421000000",
		},
		{
			City: "眉山市",
			Name: "洪雅县",
			Id:   "511423000000",
		},
		{
			City: "眉山市",
			Name: "丹棱县",
			Id:   "511424000000",
		},
		{
			City: "眉山市",
			Name: "青神县",
			Id:   "511425000000",
		},
	},
	"511500000000": {
		{
			City: "宜宾市",
			Name: "市辖区",
			Id:   "511501000000",
		},
		{
			City: "宜宾市",
			Name: "翠屏区",
			Id:   "511502000000",
		},
		{
			City: "宜宾市",
			Name: "南溪区",
			Id:   "511503000000",
		},
		{
			City: "宜宾市",
			Name: "叙州区",
			Id:   "511504000000",
		},
		{
			City: "宜宾市",
			Name: "江安县",
			Id:   "511523000000",
		},
		{
			City: "宜宾市",
			Name: "长宁县",
			Id:   "511524000000",
		},
		{
			City: "宜宾市",
			Name: "高县",
			Id:   "511525000000",
		},
		{
			City: "宜宾市",
			Name: "珙县",
			Id:   "511526000000",
		},
		{
			City: "宜宾市",
			Name: "筠连县",
			Id:   "511527000000",
		},
		{
			City: "宜宾市",
			Name: "兴文县",
			Id:   "511528000000",
		},
		{
			City: "宜宾市",
			Name: "屏山县",
			Id:   "511529000000",
		},
	},
	"511600000000": {
		{
			City: "广安市",
			Name: "市辖区",
			Id:   "511601000000",
		},
		{
			City: "广安市",
			Name: "广安区",
			Id:   "511602000000",
		},
		{
			City: "广安市",
			Name: "前锋区",
			Id:   "511603000000",
		},
		{
			City: "广安市",
			Name: "岳池县",
			Id:   "511621000000",
		},
		{
			City: "广安市",
			Name: "武胜县",
			Id:   "511622000000",
		},
		{
			City: "广安市",
			Name: "邻水县",
			Id:   "511623000000",
		},
		{
			City: "广安市",
			Name: "华蓥市",
			Id:   "511681000000",
		},
	},
	"511700000000": {
		{
			City: "达州市",
			Name: "市辖区",
			Id:   "511701000000",
		},
		{
			City: "达州市",
			Name: "通川区",
			Id:   "511702000000",
		},
		{
			City: "达州市",
			Name: "达川区",
			Id:   "511703000000",
		},
		{
			City: "达州市",
			Name: "宣汉县",
			Id:   "511722000000",
		},
		{
			City: "达州市",
			Name: "开江县",
			Id:   "511723000000",
		},
		{
			City: "达州市",
			Name: "大竹县",
			Id:   "511724000000",
		},
		{
			City: "达州市",
			Name: "渠县",
			Id:   "511725000000",
		},
		{
			City: "达州市",
			Name: "达州经济开发区",
			Id:   "511771000000",
		},
		{
			City: "达州市",
			Name: "万源市",
			Id:   "511781000000",
		},
	},
	"511800000000": {
		{
			City: "雅安市",
			Name: "市辖区",
			Id:   "511801000000",
		},
		{
			City: "雅安市",
			Name: "雨城区",
			Id:   "511802000000",
		},
		{
			City: "雅安市",
			Name: "名山区",
			Id:   "511803000000",
		},
		{
			City: "雅安市",
			Name: "荥经县",
			Id:   "511822000000",
		},
		{
			City: "雅安市",
			Name: "汉源县",
			Id:   "511823000000",
		},
		{
			City: "雅安市",
			Name: "石棉县",
			Id:   "511824000000",
		},
		{
			City: "雅安市",
			Name: "天全县",
			Id:   "511825000000",
		},
		{
			City: "雅安市",
			Name: "芦山县",
			Id:   "511826000000",
		},
		{
			City: "雅安市",
			Name: "宝兴县",
			Id:   "511827000000",
		},
	},
	"511900000000": {
		{
			City: "巴中市",
			Name: "市辖区",
			Id:   "511901000000",
		},
		{
			City: "巴中市",
			Name: "巴州区",
			Id:   "511902000000",
		},
		{
			City: "巴中市",
			Name: "恩阳区",
			Id:   "511903000000",
		},
		{
			City: "巴中市",
			Name: "通江县",
			Id:   "511921000000",
		},
		{
			City: "巴中市",
			Name: "南江县",
			Id:   "511922000000",
		},
		{
			City: "巴中市",
			Name: "平昌县",
			Id:   "511923000000",
		},
		{
			City: "巴中市",
			Name: "巴中经济开发区",
			Id:   "511971000000",
		},
	},
	"512000000000": {
		{
			City: "资阳市",
			Name: "市辖区",
			Id:   "512001000000",
		},
		{
			City: "资阳市",
			Name: "雁江区",
			Id:   "512002000000",
		},
		{
			City: "资阳市",
			Name: "安岳县",
			Id:   "512021000000",
		},
		{
			City: "资阳市",
			Name: "乐至县",
			Id:   "512022000000",
		},
	},
	"513200000000": {
		{
			City: "阿坝藏族羌族自治州",
			Name: "马尔康市",
			Id:   "513201000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "汶川县",
			Id:   "513221000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "理县",
			Id:   "513222000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "茂县",
			Id:   "513223000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "松潘县",
			Id:   "513224000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "九寨沟县",
			Id:   "513225000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "金川县",
			Id:   "513226000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "小金县",
			Id:   "513227000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "黑水县",
			Id:   "513228000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "壤塘县",
			Id:   "513230000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "阿坝县",
			Id:   "513231000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "若尔盖县",
			Id:   "513232000000",
		},
		{
			City: "阿坝藏族羌族自治州",
			Name: "红原县",
			Id:   "513233000000",
		},
	},
	"513300000000": {
		{
			City: "甘孜藏族自治州",
			Name: "康定市",
			Id:   "513301000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "泸定县",
			Id:   "513322000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "丹巴县",
			Id:   "513323000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "九龙县",
			Id:   "513324000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "雅江县",
			Id:   "513325000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "道孚县",
			Id:   "513326000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "炉霍县",
			Id:   "513327000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "甘孜县",
			Id:   "513328000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "新龙县",
			Id:   "513329000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "德格县",
			Id:   "513330000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "白玉县",
			Id:   "513331000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "石渠县",
			Id:   "513332000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "色达县",
			Id:   "513333000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "理塘县",
			Id:   "513334000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "巴塘县",
			Id:   "513335000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "乡城县",
			Id:   "513336000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "稻城县",
			Id:   "513337000000",
		},
		{
			City: "甘孜藏族自治州",
			Name: "得荣县",
			Id:   "513338000000",
		},
	},
	"513400000000": {
		{
			City: "凉山彝族自治州",
			Name: "西昌市",
			Id:   "513401000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "木里藏族自治县",
			Id:   "513422000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "盐源县",
			Id:   "513423000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "德昌县",
			Id:   "513424000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "会理县",
			Id:   "513425000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "会东县",
			Id:   "513426000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "宁南县",
			Id:   "513427000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "普格县",
			Id:   "513428000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "布拖县",
			Id:   "513429000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "金阳县",
			Id:   "513430000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "昭觉县",
			Id:   "513431000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "喜德县",
			Id:   "513432000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "冕宁县",
			Id:   "513433000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "越西县",
			Id:   "513434000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "甘洛县",
			Id:   "513435000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "美姑县",
			Id:   "513436000000",
		},
		{
			City: "凉山彝族自治州",
			Name: "雷波县",
			Id:   "513437000000",
		},
	},
	"520100000000": {
		{
			City: "贵阳市",
			Name: "市辖区",
			Id:   "520101000000",
		},
		{
			City: "贵阳市",
			Name: "南明区",
			Id:   "520102000000",
		},
		{
			City: "贵阳市",
			Name: "云岩区",
			Id:   "520103000000",
		},
		{
			City: "贵阳市",
			Name: "花溪区",
			Id:   "520111000000",
		},
		{
			City: "贵阳市",
			Name: "乌当区",
			Id:   "520112000000",
		},
		{
			City: "贵阳市",
			Name: "白云区",
			Id:   "520113000000",
		},
		{
			City: "贵阳市",
			Name: "观山湖区",
			Id:   "520115000000",
		},
		{
			City: "贵阳市",
			Name: "开阳县",
			Id:   "520121000000",
		},
		{
			City: "贵阳市",
			Name: "息烽县",
			Id:   "520122000000",
		},
		{
			City: "贵阳市",
			Name: "修文县",
			Id:   "520123000000",
		},
		{
			City: "贵阳市",
			Name: "清镇市",
			Id:   "520181000000",
		},
	},
	"520200000000": {
		{
			City: "六盘水市",
			Name: "钟山区",
			Id:   "520201000000",
		},
		{
			City: "六盘水市",
			Name: "六枝特区",
			Id:   "520203000000",
		},
		{
			City: "六盘水市",
			Name: "水城县",
			Id:   "520221000000",
		},
		{
			City: "六盘水市",
			Name: "盘州市",
			Id:   "520281000000",
		},
	},
	"520300000000": {
		{
			City: "遵义市",
			Name: "市辖区",
			Id:   "520301000000",
		},
		{
			City: "遵义市",
			Name: "红花岗区",
			Id:   "520302000000",
		},
		{
			City: "遵义市",
			Name: "汇川区",
			Id:   "520303000000",
		},
		{
			City: "遵义市",
			Name: "播州区",
			Id:   "520304000000",
		},
		{
			City: "遵义市",
			Name: "桐梓县",
			Id:   "520322000000",
		},
		{
			City: "遵义市",
			Name: "绥阳县",
			Id:   "520323000000",
		},
		{
			City: "遵义市",
			Name: "正安县",
			Id:   "520324000000",
		},
		{
			City: "遵义市",
			Name: "道真仡佬族苗族自治县",
			Id:   "520325000000",
		},
		{
			City: "遵义市",
			Name: "务川仡佬族苗族自治县",
			Id:   "520326000000",
		},
		{
			City: "遵义市",
			Name: "凤冈县",
			Id:   "520327000000",
		},
		{
			City: "遵义市",
			Name: "湄潭县",
			Id:   "520328000000",
		},
		{
			City: "遵义市",
			Name: "余庆县",
			Id:   "520329000000",
		},
		{
			City: "遵义市",
			Name: "习水县",
			Id:   "520330000000",
		},
		{
			City: "遵义市",
			Name: "赤水市",
			Id:   "520381000000",
		},
		{
			City: "遵义市",
			Name: "仁怀市",
			Id:   "520382000000",
		},
	},
	"520400000000": {
		{
			City: "安顺市",
			Name: "市辖区",
			Id:   "520401000000",
		},
		{
			City: "安顺市",
			Name: "西秀区",
			Id:   "520402000000",
		},
		{
			City: "安顺市",
			Name: "平坝区",
			Id:   "520403000000",
		},
		{
			City: "安顺市",
			Name: "普定县",
			Id:   "520422000000",
		},
		{
			City: "安顺市",
			Name: "镇宁布依族苗族自治县",
			Id:   "520423000000",
		},
		{
			City: "安顺市",
			Name: "关岭布依族苗族自治县",
			Id:   "520424000000",
		},
		{
			City: "安顺市",
			Name: "紫云苗族布依族自治县",
			Id:   "520425000000",
		},
	},
	"520500000000": {
		{
			City: "毕节市",
			Name: "市辖区",
			Id:   "520501000000",
		},
		{
			City: "毕节市",
			Name: "七星关区",
			Id:   "520502000000",
		},
		{
			City: "毕节市",
			Name: "大方县",
			Id:   "520521000000",
		},
		{
			City: "毕节市",
			Name: "黔西县",
			Id:   "520522000000",
		},
		{
			City: "毕节市",
			Name: "金沙县",
			Id:   "520523000000",
		},
		{
			City: "毕节市",
			Name: "织金县",
			Id:   "520524000000",
		},
		{
			City: "毕节市",
			Name: "纳雍县",
			Id:   "520525000000",
		},
		{
			City: "毕节市",
			Name: "威宁彝族回族苗族自治县",
			Id:   "520526000000",
		},
		{
			City: "毕节市",
			Name: "赫章县",
			Id:   "520527000000",
		},
	},
	"520600000000": {
		{
			City: "铜仁市",
			Name: "市辖区",
			Id:   "520601000000",
		},
		{
			City: "铜仁市",
			Name: "碧江区",
			Id:   "520602000000",
		},
		{
			City: "铜仁市",
			Name: "万山区",
			Id:   "520603000000",
		},
		{
			City: "铜仁市",
			Name: "江口县",
			Id:   "520621000000",
		},
		{
			City: "铜仁市",
			Name: "玉屏侗族自治县",
			Id:   "520622000000",
		},
		{
			City: "铜仁市",
			Name: "石阡县",
			Id:   "520623000000",
		},
		{
			City: "铜仁市",
			Name: "思南县",
			Id:   "520624000000",
		},
		{
			City: "铜仁市",
			Name: "印江土家族苗族自治县",
			Id:   "520625000000",
		},
		{
			City: "铜仁市",
			Name: "德江县",
			Id:   "520626000000",
		},
		{
			City: "铜仁市",
			Name: "沿河土家族自治县",
			Id:   "520627000000",
		},
		{
			City: "铜仁市",
			Name: "松桃苗族自治县",
			Id:   "520628000000",
		},
	},
	"522300000000": {
		{
			City: "黔西南布依族苗族自治州",
			Name: "兴义市",
			Id:   "522301000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "兴仁市",
			Id:   "522302000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "普安县",
			Id:   "522323000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "晴隆县",
			Id:   "522324000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "贞丰县",
			Id:   "522325000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "望谟县",
			Id:   "522326000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "册亨县",
			Id:   "522327000000",
		},
		{
			City: "黔西南布依族苗族自治州",
			Name: "安龙县",
			Id:   "522328000000",
		},
	},
	"522600000000": {
		{
			City: "黔东南苗族侗族自治州",
			Name: "凯里市",
			Id:   "522601000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "黄平县",
			Id:   "522622000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "施秉县",
			Id:   "522623000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "三穗县",
			Id:   "522624000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "镇远县",
			Id:   "522625000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "岑巩县",
			Id:   "522626000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "天柱县",
			Id:   "522627000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "锦屏县",
			Id:   "522628000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "剑河县",
			Id:   "522629000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "台江县",
			Id:   "522630000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "黎平县",
			Id:   "522631000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "榕江县",
			Id:   "522632000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "从江县",
			Id:   "522633000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "雷山县",
			Id:   "522634000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "麻江县",
			Id:   "522635000000",
		},
		{
			City: "黔东南苗族侗族自治州",
			Name: "丹寨县",
			Id:   "522636000000",
		},
	},
	"522700000000": {
		{
			City: "黔南布依族苗族自治州",
			Name: "都匀市",
			Id:   "522701000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "福泉市",
			Id:   "522702000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "荔波县",
			Id:   "522722000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "贵定县",
			Id:   "522723000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "瓮安县",
			Id:   "522725000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "独山县",
			Id:   "522726000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "平塘县",
			Id:   "522727000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "罗甸县",
			Id:   "522728000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "长顺县",
			Id:   "522729000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "龙里县",
			Id:   "522730000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "惠水县",
			Id:   "522731000000",
		},
		{
			City: "黔南布依族苗族自治州",
			Name: "三都水族自治县",
			Id:   "522732000000",
		},
	},
	"530100000000": {
		{
			City: "昆明市",
			Name: "市辖区",
			Id:   "530101000000",
		},
		{
			City: "昆明市",
			Name: "五华区",
			Id:   "530102000000",
		},
		{
			City: "昆明市",
			Name: "盘龙区",
			Id:   "530103000000",
		},
		{
			City: "昆明市",
			Name: "官渡区",
			Id:   "530111000000",
		},
		{
			City: "昆明市",
			Name: "西山区",
			Id:   "530112000000",
		},
		{
			City: "昆明市",
			Name: "东川区",
			Id:   "530113000000",
		},
		{
			City: "昆明市",
			Name: "呈贡区",
			Id:   "530114000000",
		},
		{
			City: "昆明市",
			Name: "晋宁区",
			Id:   "530115000000",
		},
		{
			City: "昆明市",
			Name: "富民县",
			Id:   "530124000000",
		},
		{
			City: "昆明市",
			Name: "宜良县",
			Id:   "530125000000",
		},
		{
			City: "昆明市",
			Name: "石林彝族自治县",
			Id:   "530126000000",
		},
		{
			City: "昆明市",
			Name: "嵩明县",
			Id:   "530127000000",
		},
		{
			City: "昆明市",
			Name: "禄劝彝族苗族自治县",
			Id:   "530128000000",
		},
		{
			City: "昆明市",
			Name: "寻甸回族彝族自治县",
			Id:   "530129000000",
		},
		{
			City: "昆明市",
			Name: "安宁市",
			Id:   "530181000000",
		},
	},
	"530300000000": {
		{
			City: "曲靖市",
			Name: "市辖区",
			Id:   "530301000000",
		},
		{
			City: "曲靖市",
			Name: "麒麟区",
			Id:   "530302000000",
		},
		{
			City: "曲靖市",
			Name: "沾益区",
			Id:   "530303000000",
		},
		{
			City: "曲靖市",
			Name: "马龙区",
			Id:   "530304000000",
		},
		{
			City: "曲靖市",
			Name: "陆良县",
			Id:   "530322000000",
		},
		{
			City: "曲靖市",
			Name: "师宗县",
			Id:   "530323000000",
		},
		{
			City: "曲靖市",
			Name: "罗平县",
			Id:   "530324000000",
		},
		{
			City: "曲靖市",
			Name: "富源县",
			Id:   "530325000000",
		},
		{
			City: "曲靖市",
			Name: "会泽县",
			Id:   "530326000000",
		},
		{
			City: "曲靖市",
			Name: "宣威市",
			Id:   "530381000000",
		},
	},
	"530400000000": {
		{
			City: "玉溪市",
			Name: "市辖区",
			Id:   "530401000000",
		},
		{
			City: "玉溪市",
			Name: "红塔区",
			Id:   "530402000000",
		},
		{
			City: "玉溪市",
			Name: "江川区",
			Id:   "530403000000",
		},
		{
			City: "玉溪市",
			Name: "通海县",
			Id:   "530423000000",
		},
		{
			City: "玉溪市",
			Name: "华宁县",
			Id:   "530424000000",
		},
		{
			City: "玉溪市",
			Name: "易门县",
			Id:   "530425000000",
		},
		{
			City: "玉溪市",
			Name: "峨山彝族自治县",
			Id:   "530426000000",
		},
		{
			City: "玉溪市",
			Name: "新平彝族傣族自治县",
			Id:   "530427000000",
		},
		{
			City: "玉溪市",
			Name: "元江哈尼族彝族傣族自治县",
			Id:   "530428000000",
		},
		{
			City: "玉溪市",
			Name: "澄江市",
			Id:   "530481000000",
		},
	},
	"530500000000": {
		{
			City: "保山市",
			Name: "市辖区",
			Id:   "530501000000",
		},
		{
			City: "保山市",
			Name: "隆阳区",
			Id:   "530502000000",
		},
		{
			City: "保山市",
			Name: "施甸县",
			Id:   "530521000000",
		},
		{
			City: "保山市",
			Name: "龙陵县",
			Id:   "530523000000",
		},
		{
			City: "保山市",
			Name: "昌宁县",
			Id:   "530524000000",
		},
		{
			City: "保山市",
			Name: "腾冲市",
			Id:   "530581000000",
		},
	},
	"530600000000": {
		{
			City: "昭通市",
			Name: "市辖区",
			Id:   "530601000000",
		},
		{
			City: "昭通市",
			Name: "昭阳区",
			Id:   "530602000000",
		},
		{
			City: "昭通市",
			Name: "鲁甸县",
			Id:   "530621000000",
		},
		{
			City: "昭通市",
			Name: "巧家县",
			Id:   "530622000000",
		},
		{
			City: "昭通市",
			Name: "盐津县",
			Id:   "530623000000",
		},
		{
			City: "昭通市",
			Name: "大关县",
			Id:   "530624000000",
		},
		{
			City: "昭通市",
			Name: "永善县",
			Id:   "530625000000",
		},
		{
			City: "昭通市",
			Name: "绥江县",
			Id:   "530626000000",
		},
		{
			City: "昭通市",
			Name: "镇雄县",
			Id:   "530627000000",
		},
		{
			City: "昭通市",
			Name: "彝良县",
			Id:   "530628000000",
		},
		{
			City: "昭通市",
			Name: "威信县",
			Id:   "530629000000",
		},
		{
			City: "昭通市",
			Name: "水富市",
			Id:   "530681000000",
		},
	},
	"530700000000": {
		{
			City: "丽江市",
			Name: "市辖区",
			Id:   "530701000000",
		},
		{
			City: "丽江市",
			Name: "古城区",
			Id:   "530702000000",
		},
		{
			City: "丽江市",
			Name: "玉龙纳西族自治县",
			Id:   "530721000000",
		},
		{
			City: "丽江市",
			Name: "永胜县",
			Id:   "530722000000",
		},
		{
			City: "丽江市",
			Name: "华坪县",
			Id:   "530723000000",
		},
		{
			City: "丽江市",
			Name: "宁蒗彝族自治县",
			Id:   "530724000000",
		},
	},
	"530800000000": {
		{
			City: "普洱市",
			Name: "市辖区",
			Id:   "530801000000",
		},
		{
			City: "普洱市",
			Name: "思茅区",
			Id:   "530802000000",
		},
		{
			City: "普洱市",
			Name: "宁洱哈尼族彝族自治县",
			Id:   "530821000000",
		},
		{
			City: "普洱市",
			Name: "墨江哈尼族自治县",
			Id:   "530822000000",
		},
		{
			City: "普洱市",
			Name: "景东彝族自治县",
			Id:   "530823000000",
		},
		{
			City: "普洱市",
			Name: "景谷傣族彝族自治县",
			Id:   "530824000000",
		},
		{
			City: "普洱市",
			Name: "镇沅彝族哈尼族拉祜族自治县",
			Id:   "530825000000",
		},
		{
			City: "普洱市",
			Name: "江城哈尼族彝族自治县",
			Id:   "530826000000",
		},
		{
			City: "普洱市",
			Name: "孟连傣族拉祜族佤族自治县",
			Id:   "530827000000",
		},
		{
			City: "普洱市",
			Name: "澜沧拉祜族自治县",
			Id:   "530828000000",
		},
		{
			City: "普洱市",
			Name: "西盟佤族自治县",
			Id:   "530829000000",
		},
	},
	"530900000000": {
		{
			City: "临沧市",
			Name: "市辖区",
			Id:   "530901000000",
		},
		{
			City: "临沧市",
			Name: "临翔区",
			Id:   "530902000000",
		},
		{
			City: "临沧市",
			Name: "凤庆县",
			Id:   "530921000000",
		},
		{
			City: "临沧市",
			Name: "云县",
			Id:   "530922000000",
		},
		{
			City: "临沧市",
			Name: "永德县",
			Id:   "530923000000",
		},
		{
			City: "临沧市",
			Name: "镇康县",
			Id:   "530924000000",
		},
		{
			City: "临沧市",
			Name: "双江拉祜族佤族布朗族傣族自治县",
			Id:   "530925000000",
		},
		{
			City: "临沧市",
			Name: "耿马傣族佤族自治县",
			Id:   "530926000000",
		},
		{
			City: "临沧市",
			Name: "沧源佤族自治县",
			Id:   "530927000000",
		},
	},
	"532300000000": {
		{
			City: "楚雄彝族自治州",
			Name: "楚雄市",
			Id:   "532301000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "双柏县",
			Id:   "532322000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "牟定县",
			Id:   "532323000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "南华县",
			Id:   "532324000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "姚安县",
			Id:   "532325000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "大姚县",
			Id:   "532326000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "永仁县",
			Id:   "532327000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "元谋县",
			Id:   "532328000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "武定县",
			Id:   "532329000000",
		},
		{
			City: "楚雄彝族自治州",
			Name: "禄丰县",
			Id:   "532331000000",
		},
	},
	"532500000000": {
		{
			City: "红河哈尼族彝族自治州",
			Name: "个旧市",
			Id:   "532501000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "开远市",
			Id:   "532502000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "蒙自市",
			Id:   "532503000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "弥勒市",
			Id:   "532504000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "屏边苗族自治县",
			Id:   "532523000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "建水县",
			Id:   "532524000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "石屏县",
			Id:   "532525000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "泸西县",
			Id:   "532527000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "元阳县",
			Id:   "532528000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "红河县",
			Id:   "532529000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "金平苗族瑶族傣族自治县",
			Id:   "532530000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "绿春县",
			Id:   "532531000000",
		},
		{
			City: "红河哈尼族彝族自治州",
			Name: "河口瑶族自治县",
			Id:   "532532000000",
		},
	},
	"532600000000": {
		{
			City: "文山壮族苗族自治州",
			Name: "文山市",
			Id:   "532601000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "砚山县",
			Id:   "532622000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "西畴县",
			Id:   "532623000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "麻栗坡县",
			Id:   "532624000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "马关县",
			Id:   "532625000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "丘北县",
			Id:   "532626000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "广南县",
			Id:   "532627000000",
		},
		{
			City: "文山壮族苗族自治州",
			Name: "富宁县",
			Id:   "532628000000",
		},
	},
	"532800000000": {
		{
			City: "西双版纳傣族自治州",
			Name: "景洪市",
			Id:   "532801000000",
		},
		{
			City: "西双版纳傣族自治州",
			Name: "勐海县",
			Id:   "532822000000",
		},
		{
			City: "西双版纳傣族自治州",
			Name: "勐腊县",
			Id:   "532823000000",
		},
	},
	"532900000000": {
		{
			City: "大理白族自治州",
			Name: "大理市",
			Id:   "532901000000",
		},
		{
			City: "大理白族自治州",
			Name: "漾濞彝族自治县",
			Id:   "532922000000",
		},
		{
			City: "大理白族自治州",
			Name: "祥云县",
			Id:   "532923000000",
		},
		{
			City: "大理白族自治州",
			Name: "宾川县",
			Id:   "532924000000",
		},
		{
			City: "大理白族自治州",
			Name: "弥渡县",
			Id:   "532925000000",
		},
		{
			City: "大理白族自治州",
			Name: "南涧彝族自治县",
			Id:   "532926000000",
		},
		{
			City: "大理白族自治州",
			Name: "巍山彝族回族自治县",
			Id:   "532927000000",
		},
		{
			City: "大理白族自治州",
			Name: "永平县",
			Id:   "532928000000",
		},
		{
			City: "大理白族自治州",
			Name: "云龙县",
			Id:   "532929000000",
		},
		{
			City: "大理白族自治州",
			Name: "洱源县",
			Id:   "532930000000",
		},
		{
			City: "大理白族自治州",
			Name: "剑川县",
			Id:   "532931000000",
		},
		{
			City: "大理白族自治州",
			Name: "鹤庆县",
			Id:   "532932000000",
		},
	},
	"533100000000": {
		{
			City: "德宏傣族景颇族自治州",
			Name: "瑞丽市",
			Id:   "533102000000",
		},
		{
			City: "德宏傣族景颇族自治州",
			Name: "芒市",
			Id:   "533103000000",
		},
		{
			City: "德宏傣族景颇族自治州",
			Name: "梁河县",
			Id:   "533122000000",
		},
		{
			City: "德宏傣族景颇族自治州",
			Name: "盈江县",
			Id:   "533123000000",
		},
		{
			City: "德宏傣族景颇族自治州",
			Name: "陇川县",
			Id:   "533124000000",
		},
	},
	"533300000000": {
		{
			City: "怒江傈僳族自治州",
			Name: "泸水市",
			Id:   "533301000000",
		},
		{
			City: "怒江傈僳族自治州",
			Name: "福贡县",
			Id:   "533323000000",
		},
		{
			City: "怒江傈僳族自治州",
			Name: "贡山独龙族怒族自治县",
			Id:   "533324000000",
		},
		{
			City: "怒江傈僳族自治州",
			Name: "兰坪白族普米族自治县",
			Id:   "533325000000",
		},
	},
	"533400000000": {
		{
			City: "迪庆藏族自治州",
			Name: "香格里拉市",
			Id:   "533401000000",
		},
		{
			City: "迪庆藏族自治州",
			Name: "德钦县",
			Id:   "533422000000",
		},
		{
			City: "迪庆藏族自治州",
			Name: "维西傈僳族自治县",
			Id:   "533423000000",
		},
	},
	"540100000000": {
		{
			City: "拉萨市",
			Name: "市辖区",
			Id:   "540101000000",
		},
		{
			City: "拉萨市",
			Name: "城关区",
			Id:   "540102000000",
		},
		{
			City: "拉萨市",
			Name: "堆龙德庆区",
			Id:   "540103000000",
		},
		{
			City: "拉萨市",
			Name: "达孜区",
			Id:   "540104000000",
		},
		{
			City: "拉萨市",
			Name: "林周县",
			Id:   "540121000000",
		},
		{
			City: "拉萨市",
			Name: "当雄县",
			Id:   "540122000000",
		},
		{
			City: "拉萨市",
			Name: "尼木县",
			Id:   "540123000000",
		},
		{
			City: "拉萨市",
			Name: "曲水县",
			Id:   "540124000000",
		},
		{
			City: "拉萨市",
			Name: "墨竹工卡县",
			Id:   "540127000000",
		},
		{
			City: "拉萨市",
			Name: "格尔木藏青工业园区",
			Id:   "540171000000",
		},
		{
			City: "拉萨市",
			Name: "拉萨经济技术开发区",
			Id:   "540172000000",
		},
		{
			City: "拉萨市",
			Name: "西藏文化旅游创意园区",
			Id:   "540173000000",
		},
		{
			City: "拉萨市",
			Name: "达孜工业园区",
			Id:   "540174000000",
		},
	},
	"540200000000": {
		{
			City: "日喀则市",
			Name: "桑珠孜区",
			Id:   "540202000000",
		},
		{
			City: "日喀则市",
			Name: "南木林县",
			Id:   "540221000000",
		},
		{
			City: "日喀则市",
			Name: "江孜县",
			Id:   "540222000000",
		},
		{
			City: "日喀则市",
			Name: "定日县",
			Id:   "540223000000",
		},
		{
			City: "日喀则市",
			Name: "萨迦县",
			Id:   "540224000000",
		},
		{
			City: "日喀则市",
			Name: "拉孜县",
			Id:   "540225000000",
		},
		{
			City: "日喀则市",
			Name: "昂仁县",
			Id:   "540226000000",
		},
		{
			City: "日喀则市",
			Name: "谢通门县",
			Id:   "540227000000",
		},
		{
			City: "日喀则市",
			Name: "白朗县",
			Id:   "540228000000",
		},
		{
			City: "日喀则市",
			Name: "仁布县",
			Id:   "540229000000",
		},
		{
			City: "日喀则市",
			Name: "康马县",
			Id:   "540230000000",
		},
		{
			City: "日喀则市",
			Name: "定结县",
			Id:   "540231000000",
		},
		{
			City: "日喀则市",
			Name: "仲巴县",
			Id:   "540232000000",
		},
		{
			City: "日喀则市",
			Name: "亚东县",
			Id:   "540233000000",
		},
		{
			City: "日喀则市",
			Name: "吉隆县",
			Id:   "540234000000",
		},
		{
			City: "日喀则市",
			Name: "聂拉木县",
			Id:   "540235000000",
		},
		{
			City: "日喀则市",
			Name: "萨嘎县",
			Id:   "540236000000",
		},
		{
			City: "日喀则市",
			Name: "岗巴县",
			Id:   "540237000000",
		},
	},
	"540300000000": {
		{
			City: "昌都市",
			Name: "卡若区",
			Id:   "540302000000",
		},
		{
			City: "昌都市",
			Name: "江达县",
			Id:   "540321000000",
		},
		{
			City: "昌都市",
			Name: "贡觉县",
			Id:   "540322000000",
		},
		{
			City: "昌都市",
			Name: "类乌齐县",
			Id:   "540323000000",
		},
		{
			City: "昌都市",
			Name: "丁青县",
			Id:   "540324000000",
		},
		{
			City: "昌都市",
			Name: "察雅县",
			Id:   "540325000000",
		},
		{
			City: "昌都市",
			Name: "八宿县",
			Id:   "540326000000",
		},
		{
			City: "昌都市",
			Name: "左贡县",
			Id:   "540327000000",
		},
		{
			City: "昌都市",
			Name: "芒康县",
			Id:   "540328000000",
		},
		{
			City: "昌都市",
			Name: "洛隆县",
			Id:   "540329000000",
		},
		{
			City: "昌都市",
			Name: "边坝县",
			Id:   "540330000000",
		},
	},
	"540400000000": {
		{
			City: "林芝市",
			Name: "巴宜区",
			Id:   "540402000000",
		},
		{
			City: "林芝市",
			Name: "工布江达县",
			Id:   "540421000000",
		},
		{
			City: "林芝市",
			Name: "米林县",
			Id:   "540422000000",
		},
		{
			City: "林芝市",
			Name: "墨脱县",
			Id:   "540423000000",
		},
		{
			City: "林芝市",
			Name: "波密县",
			Id:   "540424000000",
		},
		{
			City: "林芝市",
			Name: "察隅县",
			Id:   "540425000000",
		},
		{
			City: "林芝市",
			Name: "朗县",
			Id:   "540426000000",
		},
	},
	"540500000000": {
		{
			City: "山南市",
			Name: "市辖区",
			Id:   "540501000000",
		},
		{
			City: "山南市",
			Name: "乃东区",
			Id:   "540502000000",
		},
		{
			City: "山南市",
			Name: "扎囊县",
			Id:   "540521000000",
		},
		{
			City: "山南市",
			Name: "贡嘎县",
			Id:   "540522000000",
		},
		{
			City: "山南市",
			Name: "桑日县",
			Id:   "540523000000",
		},
		{
			City: "山南市",
			Name: "琼结县",
			Id:   "540524000000",
		},
		{
			City: "山南市",
			Name: "曲松县",
			Id:   "540525000000",
		},
		{
			City: "山南市",
			Name: "措美县",
			Id:   "540526000000",
		},
		{
			City: "山南市",
			Name: "洛扎县",
			Id:   "540527000000",
		},
		{
			City: "山南市",
			Name: "加查县",
			Id:   "540528000000",
		},
		{
			City: "山南市",
			Name: "隆子县",
			Id:   "540529000000",
		},
		{
			City: "山南市",
			Name: "错那县",
			Id:   "540530000000",
		},
		{
			City: "山南市",
			Name: "浪卡子县",
			Id:   "540531000000",
		},
	},
	"540600000000": {
		{
			City: "那曲市",
			Name: "色尼区",
			Id:   "540602000000",
		},
		{
			City: "那曲市",
			Name: "嘉黎县",
			Id:   "540621000000",
		},
		{
			City: "那曲市",
			Name: "比如县",
			Id:   "540622000000",
		},
		{
			City: "那曲市",
			Name: "聂荣县",
			Id:   "540623000000",
		},
		{
			City: "那曲市",
			Name: "安多县",
			Id:   "540624000000",
		},
		{
			City: "那曲市",
			Name: "申扎县",
			Id:   "540625000000",
		},
		{
			City: "那曲市",
			Name: "索县",
			Id:   "540626000000",
		},
		{
			City: "那曲市",
			Name: "班戈县",
			Id:   "540627000000",
		},
		{
			City: "那曲市",
			Name: "巴青县",
			Id:   "540628000000",
		},
		{
			City: "那曲市",
			Name: "尼玛县",
			Id:   "540629000000",
		},
		{
			City: "那曲市",
			Name: "双湖县",
			Id:   "540630000000",
		},
	},
	"542500000000": {
		{
			City: "阿里地区",
			Name: "普兰县",
			Id:   "542521000000",
		},
		{
			City: "阿里地区",
			Name: "札达县",
			Id:   "542522000000",
		},
		{
			City: "阿里地区",
			Name: "噶尔县",
			Id:   "542523000000",
		},
		{
			City: "阿里地区",
			Name: "日土县",
			Id:   "542524000000",
		},
		{
			City: "阿里地区",
			Name: "革吉县",
			Id:   "542525000000",
		},
		{
			City: "阿里地区",
			Name: "改则县",
			Id:   "542526000000",
		},
		{
			City: "阿里地区",
			Name: "措勤县",
			Id:   "542527000000",
		},
	},
	"610100000000": {
		{
			City: "西安市",
			Name: "市辖区",
			Id:   "610101000000",
		},
		{
			City: "西安市",
			Name: "新城区",
			Id:   "610102000000",
		},
		{
			City: "西安市",
			Name: "碑林区",
			Id:   "610103000000",
		},
		{
			City: "西安市",
			Name: "莲湖区",
			Id:   "610104000000",
		},
		{
			City: "西安市",
			Name: "灞桥区",
			Id:   "610111000000",
		},
		{
			City: "西安市",
			Name: "未央区",
			Id:   "610112000000",
		},
		{
			City: "西安市",
			Name: "雁塔区",
			Id:   "610113000000",
		},
		{
			City: "西安市",
			Name: "阎良区",
			Id:   "610114000000",
		},
		{
			City: "西安市",
			Name: "临潼区",
			Id:   "610115000000",
		},
		{
			City: "西安市",
			Name: "长安区",
			Id:   "610116000000",
		},
		{
			City: "西安市",
			Name: "高陵区",
			Id:   "610117000000",
		},
		{
			City: "西安市",
			Name: "鄠邑区",
			Id:   "610118000000",
		},
		{
			City: "西安市",
			Name: "蓝田县",
			Id:   "610122000000",
		},
		{
			City: "西安市",
			Name: "周至县",
			Id:   "610124000000",
		},
	},
	"610200000000": {
		{
			City: "铜川市",
			Name: "市辖区",
			Id:   "610201000000",
		},
		{
			City: "铜川市",
			Name: "王益区",
			Id:   "610202000000",
		},
		{
			City: "铜川市",
			Name: "印台区",
			Id:   "610203000000",
		},
		{
			City: "铜川市",
			Name: "耀州区",
			Id:   "610204000000",
		},
		{
			City: "铜川市",
			Name: "宜君县",
			Id:   "610222000000",
		},
	},
	"610300000000": {
		{
			City: "宝鸡市",
			Name: "市辖区",
			Id:   "610301000000",
		},
		{
			City: "宝鸡市",
			Name: "渭滨区",
			Id:   "610302000000",
		},
		{
			City: "宝鸡市",
			Name: "金台区",
			Id:   "610303000000",
		},
		{
			City: "宝鸡市",
			Name: "陈仓区",
			Id:   "610304000000",
		},
		{
			City: "宝鸡市",
			Name: "凤翔县",
			Id:   "610322000000",
		},
		{
			City: "宝鸡市",
			Name: "岐山县",
			Id:   "610323000000",
		},
		{
			City: "宝鸡市",
			Name: "扶风县",
			Id:   "610324000000",
		},
		{
			City: "宝鸡市",
			Name: "眉县",
			Id:   "610326000000",
		},
		{
			City: "宝鸡市",
			Name: "陇县",
			Id:   "610327000000",
		},
		{
			City: "宝鸡市",
			Name: "千阳县",
			Id:   "610328000000",
		},
		{
			City: "宝鸡市",
			Name: "麟游县",
			Id:   "610329000000",
		},
		{
			City: "宝鸡市",
			Name: "凤县",
			Id:   "610330000000",
		},
		{
			City: "宝鸡市",
			Name: "太白县",
			Id:   "610331000000",
		},
	},
	"610400000000": {
		{
			City: "咸阳市",
			Name: "市辖区",
			Id:   "610401000000",
		},
		{
			City: "咸阳市",
			Name: "秦都区",
			Id:   "610402000000",
		},
		{
			City: "咸阳市",
			Name: "杨陵区",
			Id:   "610403000000",
		},
		{
			City: "咸阳市",
			Name: "渭城区",
			Id:   "610404000000",
		},
		{
			City: "咸阳市",
			Name: "三原县",
			Id:   "610422000000",
		},
		{
			City: "咸阳市",
			Name: "泾阳县",
			Id:   "610423000000",
		},
		{
			City: "咸阳市",
			Name: "乾县",
			Id:   "610424000000",
		},
		{
			City: "咸阳市",
			Name: "礼泉县",
			Id:   "610425000000",
		},
		{
			City: "咸阳市",
			Name: "永寿县",
			Id:   "610426000000",
		},
		{
			City: "咸阳市",
			Name: "长武县",
			Id:   "610428000000",
		},
		{
			City: "咸阳市",
			Name: "旬邑县",
			Id:   "610429000000",
		},
		{
			City: "咸阳市",
			Name: "淳化县",
			Id:   "610430000000",
		},
		{
			City: "咸阳市",
			Name: "武功县",
			Id:   "610431000000",
		},
		{
			City: "咸阳市",
			Name: "兴平市",
			Id:   "610481000000",
		},
		{
			City: "咸阳市",
			Name: "彬州市",
			Id:   "610482000000",
		},
	},
	"610500000000": {
		{
			City: "渭南市",
			Name: "市辖区",
			Id:   "610501000000",
		},
		{
			City: "渭南市",
			Name: "临渭区",
			Id:   "610502000000",
		},
		{
			City: "渭南市",
			Name: "华州区",
			Id:   "610503000000",
		},
		{
			City: "渭南市",
			Name: "潼关县",
			Id:   "610522000000",
		},
		{
			City: "渭南市",
			Name: "大荔县",
			Id:   "610523000000",
		},
		{
			City: "渭南市",
			Name: "合阳县",
			Id:   "610524000000",
		},
		{
			City: "渭南市",
			Name: "澄城县",
			Id:   "610525000000",
		},
		{
			City: "渭南市",
			Name: "蒲城县",
			Id:   "610526000000",
		},
		{
			City: "渭南市",
			Name: "白水县",
			Id:   "610527000000",
		},
		{
			City: "渭南市",
			Name: "富平县",
			Id:   "610528000000",
		},
		{
			City: "渭南市",
			Name: "韩城市",
			Id:   "610581000000",
		},
		{
			City: "渭南市",
			Name: "华阴市",
			Id:   "610582000000",
		},
	},
	"610600000000": {
		{
			City: "延安市",
			Name: "市辖区",
			Id:   "610601000000",
		},
		{
			City: "延安市",
			Name: "宝塔区",
			Id:   "610602000000",
		},
		{
			City: "延安市",
			Name: "安塞区",
			Id:   "610603000000",
		},
		{
			City: "延安市",
			Name: "延长县",
			Id:   "610621000000",
		},
		{
			City: "延安市",
			Name: "延川县",
			Id:   "610622000000",
		},
		{
			City: "延安市",
			Name: "志丹县",
			Id:   "610625000000",
		},
		{
			City: "延安市",
			Name: "吴起县",
			Id:   "610626000000",
		},
		{
			City: "延安市",
			Name: "甘泉县",
			Id:   "610627000000",
		},
		{
			City: "延安市",
			Name: "富县",
			Id:   "610628000000",
		},
		{
			City: "延安市",
			Name: "洛川县",
			Id:   "610629000000",
		},
		{
			City: "延安市",
			Name: "宜川县",
			Id:   "610630000000",
		},
		{
			City: "延安市",
			Name: "黄龙县",
			Id:   "610631000000",
		},
		{
			City: "延安市",
			Name: "黄陵县",
			Id:   "610632000000",
		},
		{
			City: "延安市",
			Name: "子长市",
			Id:   "610681000000",
		},
	},
	"610700000000": {
		{
			City: "汉中市",
			Name: "市辖区",
			Id:   "610701000000",
		},
		{
			City: "汉中市",
			Name: "汉台区",
			Id:   "610702000000",
		},
		{
			City: "汉中市",
			Name: "南郑区",
			Id:   "610703000000",
		},
		{
			City: "汉中市",
			Name: "城固县",
			Id:   "610722000000",
		},
		{
			City: "汉中市",
			Name: "洋县",
			Id:   "610723000000",
		},
		{
			City: "汉中市",
			Name: "西乡县",
			Id:   "610724000000",
		},
		{
			City: "汉中市",
			Name: "勉县",
			Id:   "610725000000",
		},
		{
			City: "汉中市",
			Name: "宁强县",
			Id:   "610726000000",
		},
		{
			City: "汉中市",
			Name: "略阳县",
			Id:   "610727000000",
		},
		{
			City: "汉中市",
			Name: "镇巴县",
			Id:   "610728000000",
		},
		{
			City: "汉中市",
			Name: "留坝县",
			Id:   "610729000000",
		},
		{
			City: "汉中市",
			Name: "佛坪县",
			Id:   "610730000000",
		},
	},
	"610800000000": {
		{
			City: "榆林市",
			Name: "市辖区",
			Id:   "610801000000",
		},
		{
			City: "榆林市",
			Name: "榆阳区",
			Id:   "610802000000",
		},
		{
			City: "榆林市",
			Name: "横山区",
			Id:   "610803000000",
		},
		{
			City: "榆林市",
			Name: "府谷县",
			Id:   "610822000000",
		},
		{
			City: "榆林市",
			Name: "靖边县",
			Id:   "610824000000",
		},
		{
			City: "榆林市",
			Name: "定边县",
			Id:   "610825000000",
		},
		{
			City: "榆林市",
			Name: "绥德县",
			Id:   "610826000000",
		},
		{
			City: "榆林市",
			Name: "米脂县",
			Id:   "610827000000",
		},
		{
			City: "榆林市",
			Name: "佳县",
			Id:   "610828000000",
		},
		{
			City: "榆林市",
			Name: "吴堡县",
			Id:   "610829000000",
		},
		{
			City: "榆林市",
			Name: "清涧县",
			Id:   "610830000000",
		},
		{
			City: "榆林市",
			Name: "子洲县",
			Id:   "610831000000",
		},
		{
			City: "榆林市",
			Name: "神木市",
			Id:   "610881000000",
		},
	},
	"610900000000": {
		{
			City: "安康市",
			Name: "市辖区",
			Id:   "610901000000",
		},
		{
			City: "安康市",
			Name: "汉滨区",
			Id:   "610902000000",
		},
		{
			City: "安康市",
			Name: "汉阴县",
			Id:   "610921000000",
		},
		{
			City: "安康市",
			Name: "石泉县",
			Id:   "610922000000",
		},
		{
			City: "安康市",
			Name: "宁陕县",
			Id:   "610923000000",
		},
		{
			City: "安康市",
			Name: "紫阳县",
			Id:   "610924000000",
		},
		{
			City: "安康市",
			Name: "岚皋县",
			Id:   "610925000000",
		},
		{
			City: "安康市",
			Name: "平利县",
			Id:   "610926000000",
		},
		{
			City: "安康市",
			Name: "镇坪县",
			Id:   "610927000000",
		},
		{
			City: "安康市",
			Name: "旬阳县",
			Id:   "610928000000",
		},
		{
			City: "安康市",
			Name: "白河县",
			Id:   "610929000000",
		},
	},
	"611000000000": {
		{
			City: "商洛市",
			Name: "市辖区",
			Id:   "611001000000",
		},
		{
			City: "商洛市",
			Name: "商州区",
			Id:   "611002000000",
		},
		{
			City: "商洛市",
			Name: "洛南县",
			Id:   "611021000000",
		},
		{
			City: "商洛市",
			Name: "丹凤县",
			Id:   "611022000000",
		},
		{
			City: "商洛市",
			Name: "商南县",
			Id:   "611023000000",
		},
		{
			City: "商洛市",
			Name: "山阳县",
			Id:   "611024000000",
		},
		{
			City: "商洛市",
			Name: "镇安县",
			Id:   "611025000000",
		},
		{
			City: "商洛市",
			Name: "柞水县",
			Id:   "611026000000",
		},
	},
	"620100000000": {
		{
			City: "兰州市",
			Name: "市辖区",
			Id:   "620101000000",
		},
		{
			City: "兰州市",
			Name: "城关区",
			Id:   "620102000000",
		},
		{
			City: "兰州市",
			Name: "七里河区",
			Id:   "620103000000",
		},
		{
			City: "兰州市",
			Name: "西固区",
			Id:   "620104000000",
		},
		{
			City: "兰州市",
			Name: "安宁区",
			Id:   "620105000000",
		},
		{
			City: "兰州市",
			Name: "红古区",
			Id:   "620111000000",
		},
		{
			City: "兰州市",
			Name: "永登县",
			Id:   "620121000000",
		},
		{
			City: "兰州市",
			Name: "皋兰县",
			Id:   "620122000000",
		},
		{
			City: "兰州市",
			Name: "榆中县",
			Id:   "620123000000",
		},
		{
			City: "兰州市",
			Name: "兰州新区",
			Id:   "620171000000",
		},
	},
	"620200000000": {
		{
			City: "嘉峪关市",
			Name: "市辖区",
			Id:   "620201000000",
		},
	},
	"620300000000": {
		{
			City: "金昌市",
			Name: "市辖区",
			Id:   "620301000000",
		},
		{
			City: "金昌市",
			Name: "金川区",
			Id:   "620302000000",
		},
		{
			City: "金昌市",
			Name: "永昌县",
			Id:   "620321000000",
		},
	},
	"620400000000": {
		{
			City: "白银市",
			Name: "市辖区",
			Id:   "620401000000",
		},
		{
			City: "白银市",
			Name: "白银区",
			Id:   "620402000000",
		},
		{
			City: "白银市",
			Name: "平川区",
			Id:   "620403000000",
		},
		{
			City: "白银市",
			Name: "靖远县",
			Id:   "620421000000",
		},
		{
			City: "白银市",
			Name: "会宁县",
			Id:   "620422000000",
		},
		{
			City: "白银市",
			Name: "景泰县",
			Id:   "620423000000",
		},
	},
	"620500000000": {
		{
			City: "天水市",
			Name: "市辖区",
			Id:   "620501000000",
		},
		{
			City: "天水市",
			Name: "秦州区",
			Id:   "620502000000",
		},
		{
			City: "天水市",
			Name: "麦积区",
			Id:   "620503000000",
		},
		{
			City: "天水市",
			Name: "清水县",
			Id:   "620521000000",
		},
		{
			City: "天水市",
			Name: "秦安县",
			Id:   "620522000000",
		},
		{
			City: "天水市",
			Name: "甘谷县",
			Id:   "620523000000",
		},
		{
			City: "天水市",
			Name: "武山县",
			Id:   "620524000000",
		},
		{
			City: "天水市",
			Name: "张家川回族自治县",
			Id:   "620525000000",
		},
	},
	"620600000000": {
		{
			City: "武威市",
			Name: "市辖区",
			Id:   "620601000000",
		},
		{
			City: "武威市",
			Name: "凉州区",
			Id:   "620602000000",
		},
		{
			City: "武威市",
			Name: "民勤县",
			Id:   "620621000000",
		},
		{
			City: "武威市",
			Name: "古浪县",
			Id:   "620622000000",
		},
		{
			City: "武威市",
			Name: "天祝藏族自治县",
			Id:   "620623000000",
		},
	},
	"620700000000": {
		{
			City: "张掖市",
			Name: "市辖区",
			Id:   "620701000000",
		},
		{
			City: "张掖市",
			Name: "甘州区",
			Id:   "620702000000",
		},
		{
			City: "张掖市",
			Name: "肃南裕固族自治县",
			Id:   "620721000000",
		},
		{
			City: "张掖市",
			Name: "民乐县",
			Id:   "620722000000",
		},
		{
			City: "张掖市",
			Name: "临泽县",
			Id:   "620723000000",
		},
		{
			City: "张掖市",
			Name: "高台县",
			Id:   "620724000000",
		},
		{
			City: "张掖市",
			Name: "山丹县",
			Id:   "620725000000",
		},
	},
	"620800000000": {
		{
			City: "平凉市",
			Name: "市辖区",
			Id:   "620801000000",
		},
		{
			City: "平凉市",
			Name: "崆峒区",
			Id:   "620802000000",
		},
		{
			City: "平凉市",
			Name: "泾川县",
			Id:   "620821000000",
		},
		{
			City: "平凉市",
			Name: "灵台县",
			Id:   "620822000000",
		},
		{
			City: "平凉市",
			Name: "崇信县",
			Id:   "620823000000",
		},
		{
			City: "平凉市",
			Name: "庄浪县",
			Id:   "620825000000",
		},
		{
			City: "平凉市",
			Name: "静宁县",
			Id:   "620826000000",
		},
		{
			City: "平凉市",
			Name: "华亭市",
			Id:   "620881000000",
		},
	},
	"620900000000": {
		{
			City: "酒泉市",
			Name: "市辖区",
			Id:   "620901000000",
		},
		{
			City: "酒泉市",
			Name: "肃州区",
			Id:   "620902000000",
		},
		{
			City: "酒泉市",
			Name: "金塔县",
			Id:   "620921000000",
		},
		{
			City: "酒泉市",
			Name: "瓜州县",
			Id:   "620922000000",
		},
		{
			City: "酒泉市",
			Name: "肃北蒙古族自治县",
			Id:   "620923000000",
		},
		{
			City: "酒泉市",
			Name: "阿克塞哈萨克族自治县",
			Id:   "620924000000",
		},
		{
			City: "酒泉市",
			Name: "玉门市",
			Id:   "620981000000",
		},
		{
			City: "酒泉市",
			Name: "敦煌市",
			Id:   "620982000000",
		},
	},
	"621000000000": {
		{
			City: "庆阳市",
			Name: "市辖区",
			Id:   "621001000000",
		},
		{
			City: "庆阳市",
			Name: "西峰区",
			Id:   "621002000000",
		},
		{
			City: "庆阳市",
			Name: "庆城县",
			Id:   "621021000000",
		},
		{
			City: "庆阳市",
			Name: "环县",
			Id:   "621022000000",
		},
		{
			City: "庆阳市",
			Name: "华池县",
			Id:   "621023000000",
		},
		{
			City: "庆阳市",
			Name: "合水县",
			Id:   "621024000000",
		},
		{
			City: "庆阳市",
			Name: "正宁县",
			Id:   "621025000000",
		},
		{
			City: "庆阳市",
			Name: "宁县",
			Id:   "621026000000",
		},
		{
			City: "庆阳市",
			Name: "镇原县",
			Id:   "621027000000",
		},
	},
	"621100000000": {
		{
			City: "定西市",
			Name: "市辖区",
			Id:   "621101000000",
		},
		{
			City: "定西市",
			Name: "安定区",
			Id:   "621102000000",
		},
		{
			City: "定西市",
			Name: "通渭县",
			Id:   "621121000000",
		},
		{
			City: "定西市",
			Name: "陇西县",
			Id:   "621122000000",
		},
		{
			City: "定西市",
			Name: "渭源县",
			Id:   "621123000000",
		},
		{
			City: "定西市",
			Name: "临洮县",
			Id:   "621124000000",
		},
		{
			City: "定西市",
			Name: "漳县",
			Id:   "621125000000",
		},
		{
			City: "定西市",
			Name: "岷县",
			Id:   "621126000000",
		},
	},
	"621200000000": {
		{
			City: "陇南市",
			Name: "市辖区",
			Id:   "621201000000",
		},
		{
			City: "陇南市",
			Name: "武都区",
			Id:   "621202000000",
		},
		{
			City: "陇南市",
			Name: "成县",
			Id:   "621221000000",
		},
		{
			City: "陇南市",
			Name: "文县",
			Id:   "621222000000",
		},
		{
			City: "陇南市",
			Name: "宕昌县",
			Id:   "621223000000",
		},
		{
			City: "陇南市",
			Name: "康县",
			Id:   "621224000000",
		},
		{
			City: "陇南市",
			Name: "西和县",
			Id:   "621225000000",
		},
		{
			City: "陇南市",
			Name: "礼县",
			Id:   "621226000000",
		},
		{
			City: "陇南市",
			Name: "徽县",
			Id:   "621227000000",
		},
		{
			City: "陇南市",
			Name: "两当县",
			Id:   "621228000000",
		},
	},
	"622900000000": {
		{
			City: "临夏回族自治州",
			Name: "临夏市",
			Id:   "622901000000",
		},
		{
			City: "临夏回族自治州",
			Name: "临夏县",
			Id:   "622921000000",
		},
		{
			City: "临夏回族自治州",
			Name: "康乐县",
			Id:   "622922000000",
		},
		{
			City: "临夏回族自治州",
			Name: "永靖县",
			Id:   "622923000000",
		},
		{
			City: "临夏回族自治州",
			Name: "广河县",
			Id:   "622924000000",
		},
		{
			City: "临夏回族自治州",
			Name: "和政县",
			Id:   "622925000000",
		},
		{
			City: "临夏回族自治州",
			Name: "东乡族自治县",
			Id:   "622926000000",
		},
		{
			City: "临夏回族自治州",
			Name: "积石山保安族东乡族撒拉族自治县",
			Id:   "622927000000",
		},
	},
	"623000000000": {
		{
			City: "甘南藏族自治州",
			Name: "合作市",
			Id:   "623001000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "临潭县",
			Id:   "623021000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "卓尼县",
			Id:   "623022000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "舟曲县",
			Id:   "623023000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "迭部县",
			Id:   "623024000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "玛曲县",
			Id:   "623025000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "碌曲县",
			Id:   "623026000000",
		},
		{
			City: "甘南藏族自治州",
			Name: "夏河县",
			Id:   "623027000000",
		},
	},
	"630100000000": {
		{
			City: "西宁市",
			Name: "市辖区",
			Id:   "630101000000",
		},
		{
			City: "西宁市",
			Name: "城东区",
			Id:   "630102000000",
		},
		{
			City: "西宁市",
			Name: "城中区",
			Id:   "630103000000",
		},
		{
			City: "西宁市",
			Name: "城西区",
			Id:   "630104000000",
		},
		{
			City: "西宁市",
			Name: "城北区",
			Id:   "630105000000",
		},
		{
			City: "西宁市",
			Name: "湟中区",
			Id:   "630106000000",
		},
		{
			City: "西宁市",
			Name: "大通回族土族自治县",
			Id:   "630121000000",
		},
		{
			City: "西宁市",
			Name: "湟源县",
			Id:   "630123000000",
		},
	},
	"630200000000": {
		{
			City: "海东市",
			Name: "乐都区",
			Id:   "630202000000",
		},
		{
			City: "海东市",
			Name: "平安区",
			Id:   "630203000000",
		},
		{
			City: "海东市",
			Name: "民和回族土族自治县",
			Id:   "630222000000",
		},
		{
			City: "海东市",
			Name: "互助土族自治县",
			Id:   "630223000000",
		},
		{
			City: "海东市",
			Name: "化隆回族自治县",
			Id:   "630224000000",
		},
		{
			City: "海东市",
			Name: "循化撒拉族自治县",
			Id:   "630225000000",
		},
	},
	"632200000000": {
		{
			City: "海北藏族自治州",
			Name: "门源回族自治县",
			Id:   "632221000000",
		},
		{
			City: "海北藏族自治州",
			Name: "祁连县",
			Id:   "632222000000",
		},
		{
			City: "海北藏族自治州",
			Name: "海晏县",
			Id:   "632223000000",
		},
		{
			City: "海北藏族自治州",
			Name: "刚察县",
			Id:   "632224000000",
		},
	},
	"632300000000": {
		{
			City: "黄南藏族自治州",
			Name: "同仁县",
			Id:   "632321000000",
		},
		{
			City: "黄南藏族自治州",
			Name: "尖扎县",
			Id:   "632322000000",
		},
		{
			City: "黄南藏族自治州",
			Name: "泽库县",
			Id:   "632323000000",
		},
		{
			City: "黄南藏族自治州",
			Name: "河南蒙古族自治县",
			Id:   "632324000000",
		},
	},
	"632500000000": {
		{
			City: "海南藏族自治州",
			Name: "共和县",
			Id:   "632521000000",
		},
		{
			City: "海南藏族自治州",
			Name: "同德县",
			Id:   "632522000000",
		},
		{
			City: "海南藏族自治州",
			Name: "贵德县",
			Id:   "632523000000",
		},
		{
			City: "海南藏族自治州",
			Name: "兴海县",
			Id:   "632524000000",
		},
		{
			City: "海南藏族自治州",
			Name: "贵南县",
			Id:   "632525000000",
		},
	},
	"632600000000": {
		{
			City: "果洛藏族自治州",
			Name: "玛沁县",
			Id:   "632621000000",
		},
		{
			City: "果洛藏族自治州",
			Name: "班玛县",
			Id:   "632622000000",
		},
		{
			City: "果洛藏族自治州",
			Name: "甘德县",
			Id:   "632623000000",
		},
		{
			City: "果洛藏族自治州",
			Name: "达日县",
			Id:   "632624000000",
		},
		{
			City: "果洛藏族自治州",
			Name: "久治县",
			Id:   "632625000000",
		},
		{
			City: "果洛藏族自治州",
			Name: "玛多县",
			Id:   "632626000000",
		},
	},
	"632700000000": {
		{
			City: "玉树藏族自治州",
			Name: "玉树市",
			Id:   "632701000000",
		},
		{
			City: "玉树藏族自治州",
			Name: "杂多县",
			Id:   "632722000000",
		},
		{
			City: "玉树藏族自治州",
			Name: "称多县",
			Id:   "632723000000",
		},
		{
			City: "玉树藏族自治州",
			Name: "治多县",
			Id:   "632724000000",
		},
		{
			City: "玉树藏族自治州",
			Name: "囊谦县",
			Id:   "632725000000",
		},
		{
			City: "玉树藏族自治州",
			Name: "曲麻莱县",
			Id:   "632726000000",
		},
	},
	"632800000000": {
		{
			City: "海西蒙古族藏族自治州",
			Name: "格尔木市",
			Id:   "632801000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "德令哈市",
			Id:   "632802000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "茫崖市",
			Id:   "632803000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "乌兰县",
			Id:   "632821000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "都兰县",
			Id:   "632822000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "天峻县",
			Id:   "632823000000",
		},
		{
			City: "海西蒙古族藏族自治州",
			Name: "大柴旦行政委员会",
			Id:   "632857000000",
		},
	},
	"640100000000": {
		{
			City: "银川市",
			Name: "市辖区",
			Id:   "640101000000",
		},
		{
			City: "银川市",
			Name: "兴庆区",
			Id:   "640104000000",
		},
		{
			City: "银川市",
			Name: "西夏区",
			Id:   "640105000000",
		},
		{
			City: "银川市",
			Name: "金凤区",
			Id:   "640106000000",
		},
		{
			City: "银川市",
			Name: "永宁县",
			Id:   "640121000000",
		},
		{
			City: "银川市",
			Name: "贺兰县",
			Id:   "640122000000",
		},
		{
			City: "银川市",
			Name: "灵武市",
			Id:   "640181000000",
		},
	},
	"640200000000": {
		{
			City: "石嘴山市",
			Name: "市辖区",
			Id:   "640201000000",
		},
		{
			City: "石嘴山市",
			Name: "大武口区",
			Id:   "640202000000",
		},
		{
			City: "石嘴山市",
			Name: "惠农区",
			Id:   "640205000000",
		},
		{
			City: "石嘴山市",
			Name: "平罗县",
			Id:   "640221000000",
		},
	},
	"640300000000": {
		{
			City: "吴忠市",
			Name: "市辖区",
			Id:   "640301000000",
		},
		{
			City: "吴忠市",
			Name: "利通区",
			Id:   "640302000000",
		},
		{
			City: "吴忠市",
			Name: "红寺堡区",
			Id:   "640303000000",
		},
		{
			City: "吴忠市",
			Name: "盐池县",
			Id:   "640323000000",
		},
		{
			City: "吴忠市",
			Name: "同心县",
			Id:   "640324000000",
		},
		{
			City: "吴忠市",
			Name: "青铜峡市",
			Id:   "640381000000",
		},
	},
	"640400000000": {
		{
			City: "固原市",
			Name: "市辖区",
			Id:   "640401000000",
		},
		{
			City: "固原市",
			Name: "原州区",
			Id:   "640402000000",
		},
		{
			City: "固原市",
			Name: "西吉县",
			Id:   "640422000000",
		},
		{
			City: "固原市",
			Name: "隆德县",
			Id:   "640423000000",
		},
		{
			City: "固原市",
			Name: "泾源县",
			Id:   "640424000000",
		},
		{
			City: "固原市",
			Name: "彭阳县",
			Id:   "640425000000",
		},
	},
	"640500000000": {
		{
			City: "中卫市",
			Name: "市辖区",
			Id:   "640501000000",
		},
		{
			City: "中卫市",
			Name: "沙坡头区",
			Id:   "640502000000",
		},
		{
			City: "中卫市",
			Name: "中宁县",
			Id:   "640521000000",
		},
		{
			City: "中卫市",
			Name: "海原县",
			Id:   "640522000000",
		},
	},
	"650100000000": {
		{
			City: "乌鲁木齐市",
			Name: "市辖区",
			Id:   "650101000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "天山区",
			Id:   "650102000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "沙依巴克区",
			Id:   "650103000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "新市区",
			Id:   "650104000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "水磨沟区",
			Id:   "650105000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "头屯河区",
			Id:   "650106000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "达坂城区",
			Id:   "650107000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "米东区",
			Id:   "650109000000",
		},
		{
			City: "乌鲁木齐市",
			Name: "乌鲁木齐县",
			Id:   "650121000000",
		},
	},
	"650200000000": {
		{
			City: "克拉玛依市",
			Name: "市辖区",
			Id:   "650201000000",
		},
		{
			City: "克拉玛依市",
			Name: "独山子区",
			Id:   "650202000000",
		},
		{
			City: "克拉玛依市",
			Name: "克拉玛依区",
			Id:   "650203000000",
		},
		{
			City: "克拉玛依市",
			Name: "白碱滩区",
			Id:   "650204000000",
		},
		{
			City: "克拉玛依市",
			Name: "乌尔禾区",
			Id:   "650205000000",
		},
	},
	"650400000000": {
		{
			City: "吐鲁番市",
			Name: "高昌区",
			Id:   "650402000000",
		},
		{
			City: "吐鲁番市",
			Name: "鄯善县",
			Id:   "650421000000",
		},
		{
			City: "吐鲁番市",
			Name: "托克逊县",
			Id:   "650422000000",
		},
	},
	"650500000000": {
		{
			City: "哈密市",
			Name: "伊州区",
			Id:   "650502000000",
		},
		{
			City: "哈密市",
			Name: "巴里坤哈萨克自治县",
			Id:   "650521000000",
		},
		{
			City: "哈密市",
			Name: "伊吾县",
			Id:   "650522000000",
		},
	},
	"652300000000": {
		{
			City: "昌吉回族自治州",
			Name: "昌吉市",
			Id:   "652301000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "阜康市",
			Id:   "652302000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "呼图壁县",
			Id:   "652323000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "玛纳斯县",
			Id:   "652324000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "奇台县",
			Id:   "652325000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "吉木萨尔县",
			Id:   "652327000000",
		},
		{
			City: "昌吉回族自治州",
			Name: "木垒哈萨克自治县",
			Id:   "652328000000",
		},
	},
	"652700000000": {
		{
			City: "博尔塔拉蒙古自治州",
			Name: "博乐市",
			Id:   "652701000000",
		},
		{
			City: "博尔塔拉蒙古自治州",
			Name: "阿拉山口市",
			Id:   "652702000000",
		},
		{
			City: "博尔塔拉蒙古自治州",
			Name: "精河县",
			Id:   "652722000000",
		},
		{
			City: "博尔塔拉蒙古自治州",
			Name: "温泉县",
			Id:   "652723000000",
		},
	},
	"652800000000": {
		{
			City: "巴音郭楞蒙古自治州",
			Name: "库尔勒市",
			Id:   "652801000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "轮台县",
			Id:   "652822000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "尉犁县",
			Id:   "652823000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "若羌县",
			Id:   "652824000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "且末县",
			Id:   "652825000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "焉耆回族自治县",
			Id:   "652826000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "和静县",
			Id:   "652827000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "和硕县",
			Id:   "652828000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "博湖县",
			Id:   "652829000000",
		},
		{
			City: "巴音郭楞蒙古自治州",
			Name: "库尔勒经济技术开发区",
			Id:   "652871000000",
		},
	},
	"652900000000": {
		{
			City: "阿克苏地区",
			Name: "阿克苏市",
			Id:   "652901000000",
		},
		{
			City: "阿克苏地区",
			Name: "库车市",
			Id:   "652902000000",
		},
		{
			City: "阿克苏地区",
			Name: "温宿县",
			Id:   "652922000000",
		},
		{
			City: "阿克苏地区",
			Name: "沙雅县",
			Id:   "652924000000",
		},
		{
			City: "阿克苏地区",
			Name: "新和县",
			Id:   "652925000000",
		},
		{
			City: "阿克苏地区",
			Name: "拜城县",
			Id:   "652926000000",
		},
		{
			City: "阿克苏地区",
			Name: "乌什县",
			Id:   "652927000000",
		},
		{
			City: "阿克苏地区",
			Name: "阿瓦提县",
			Id:   "652928000000",
		},
		{
			City: "阿克苏地区",
			Name: "柯坪县",
			Id:   "652929000000",
		},
	},
	"653000000000": {
		{
			City: "克孜勒苏柯尔克孜自治州",
			Name: "阿图什市",
			Id:   "653001000000",
		},
		{
			City: "克孜勒苏柯尔克孜自治州",
			Name: "阿克陶县",
			Id:   "653022000000",
		},
		{
			City: "克孜勒苏柯尔克孜自治州",
			Name: "阿合奇县",
			Id:   "653023000000",
		},
		{
			City: "克孜勒苏柯尔克孜自治州",
			Name: "乌恰县",
			Id:   "653024000000",
		},
	},
	"653100000000": {
		{
			City: "喀什地区",
			Name: "喀什市",
			Id:   "653101000000",
		},
		{
			City: "喀什地区",
			Name: "疏附县",
			Id:   "653121000000",
		},
		{
			City: "喀什地区",
			Name: "疏勒县",
			Id:   "653122000000",
		},
		{
			City: "喀什地区",
			Name: "英吉沙县",
			Id:   "653123000000",
		},
		{
			City: "喀什地区",
			Name: "泽普县",
			Id:   "653124000000",
		},
		{
			City: "喀什地区",
			Name: "莎车县",
			Id:   "653125000000",
		},
		{
			City: "喀什地区",
			Name: "叶城县",
			Id:   "653126000000",
		},
		{
			City: "喀什地区",
			Name: "麦盖提县",
			Id:   "653127000000",
		},
		{
			City: "喀什地区",
			Name: "岳普湖县",
			Id:   "653128000000",
		},
		{
			City: "喀什地区",
			Name: "伽师县",
			Id:   "653129000000",
		},
		{
			City: "喀什地区",
			Name: "巴楚县",
			Id:   "653130000000",
		},
		{
			City: "喀什地区",
			Name: "塔什库尔干塔吉克自治县",
			Id:   "653131000000",
		},
	},
	"653200000000": {
		{
			City: "和田地区",
			Name: "和田市",
			Id:   "653201000000",
		},
		{
			City: "和田地区",
			Name: "和田县",
			Id:   "653221000000",
		},
		{
			City: "和田地区",
			Name: "墨玉县",
			Id:   "653222000000",
		},
		{
			City: "和田地区",
			Name: "皮山县",
			Id:   "653223000000",
		},
		{
			City: "和田地区",
			Name: "洛浦县",
			Id:   "653224000000",
		},
		{
			City: "和田地区",
			Name: "策勒县",
			Id:   "653225000000",
		},
		{
			City: "和田地区",
			Name: "于田县",
			Id:   "653226000000",
		},
		{
			City: "和田地区",
			Name: "民丰县",
			Id:   "653227000000",
		},
	},
	"654000000000": {
		{
			City: "伊犁哈萨克自治州",
			Name: "伊宁市",
			Id:   "654002000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "奎屯市",
			Id:   "654003000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "霍尔果斯市",
			Id:   "654004000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "伊宁县",
			Id:   "654021000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "察布查尔锡伯自治县",
			Id:   "654022000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "霍城县",
			Id:   "654023000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "巩留县",
			Id:   "654024000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "新源县",
			Id:   "654025000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "昭苏县",
			Id:   "654026000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "特克斯县",
			Id:   "654027000000",
		},
		{
			City: "伊犁哈萨克自治州",
			Name: "尼勒克县",
			Id:   "654028000000",
		},
	},
	"654200000000": {
		{
			City: "塔城地区",
			Name: "塔城市",
			Id:   "654201000000",
		},
		{
			City: "塔城地区",
			Name: "乌苏市",
			Id:   "654202000000",
		},
		{
			City: "塔城地区",
			Name: "额敏县",
			Id:   "654221000000",
		},
		{
			City: "塔城地区",
			Name: "沙湾县",
			Id:   "654223000000",
		},
		{
			City: "塔城地区",
			Name: "托里县",
			Id:   "654224000000",
		},
		{
			City: "塔城地区",
			Name: "裕民县",
			Id:   "654225000000",
		},
		{
			City: "塔城地区",
			Name: "和布克赛尔蒙古自治县",
			Id:   "654226000000",
		},
	},
	"654300000000": {
		{
			City: "阿勒泰地区",
			Name: "阿勒泰市",
			Id:   "654301000000",
		},
		{
			City: "阿勒泰地区",
			Name: "布尔津县",
			Id:   "654321000000",
		},
		{
			City: "阿勒泰地区",
			Name: "富蕴县",
			Id:   "654322000000",
		},
		{
			City: "阿勒泰地区",
			Name: "福海县",
			Id:   "654323000000",
		},
		{
			City: "阿勒泰地区",
			Name: "哈巴河县",
			Id:   "654324000000",
		},
		{
			City: "阿勒泰地区",
			Name: "青河县",
			Id:   "654325000000",
		},
		{
			City: "阿勒泰地区",
			Name: "吉木乃县",
			Id:   "654326000000",
		},
	},
	"659000000000": {
		{
			City: "自治区直辖县级行政区划",
			Name: "石河子市",
			Id:   "659001000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "阿拉尔市",
			Id:   "659002000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "图木舒克市",
			Id:   "659003000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "五家渠市",
			Id:   "659004000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "北屯市",
			Id:   "659005000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "铁门关市",
			Id:   "659006000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "双河市",
			Id:   "659007000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "可克达拉市",
			Id:   "659008000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "昆玉市",
			Id:   "659009000000",
		},
		{
			City: "自治区直辖县级行政区划",
			Name: "胡杨河市",
			Id:   "659010000000",
		},
	},
}
